{
  "chapter_beginnings": [
    {
      "beginning_sentence": "A DOLL'S HOUSE"
    },
    {
      "beginning_sentence": "Dramatis Personae"
    },
    {
      "beginning_sentence": "Act I"
    },
    {
      "beginning_sentence": "Act II"
    },
    {
      "beginning_sentence": "Act III"
    }
  ],
  "plots": [
    {
      "text": "— A room furnished comfortably and tastefully, but not\r\nextravagantly. At the back, a door to the right leads to the\r\nentrance-hall, another to the left leads to Helmer's study. Between the\r\ndoors stands a piano. In the middle of the left-hand wall is a door, and\r\nbeyond it a window. Near the window are a round table, armchairs and a\r\nsmall sofa. In the right-hand wall, at the farther end, another door;\r\nand on the same side, nearer the footlights, a stove, two easy chairs\r\nand a rocking-chair; between the stove and the door, a small table.\r\nEngravings on the wall; a cabinet with china and other small objects; a\r\nsmall book-case with well-bound books. The floors are carpeted, and a\r\nfire burns in the stove. It is winter.\n\nA bell rings in the hall; shortly afterwards the door is heard to open.\r\nEnter NORA, humming a tune and in high spirits. She is in out-door\r\ndress and carries a number of parcels; these she lays on the table to\r\nthe right. She leaves the outer door open after her, and through it is\r\nseen a PORTER who is carrying a Christmas Tree and a basket, which he\r\ngives to the MAID who has opened the door .)\n\nNora . Hide the Christmas Tree carefully, Helen. Be sure the children\r\ndo not see it till this evening, when it is dressed. ( To the PORTER, taking out her purse .) How much?\n\nPorter . Sixpence.\n\nNora . There is a shilling. No, keep the change. ( The PORTER thanks\r\nher, and goes out . NORA shuts the door. She is laughing to herself, as\r\nshe takes off her hat and coat. She takes a packet of macaroons from her\r\npocket and eats one or two; then goes cautiously to her husband's door\r\nand listens .) Yes, he is in. ( Still humming, she goes to the table on\r\nthe right .)\n\nHelmer ( calls out from his room ). Is that my little lark twittering\r\nout there?\n\nNora ( busy opening some of the parcels ). Yes, it is!\n\nHelmer . Is it my little squirrel bustling about?\n\nNora . Yes!\n\nHelmer . When did my squirrel come home?\n\nNora . Just now. ( Puts the bag of macaroons into her pocket and wipes\r\nher mouth .) Come in here, Torvald, and see what I have bought.\n\nHelmer . Don't disturb me. ( A little later, he opens the door and\r\nlooks into the room, pen in hand .) Bought, did you say? All these\r\nthings? Has my little spendthrift been wasting money again?\n\nNora . Yes, but, Torvald, this year we really can let ourselves go a\r\nlittle. This is the first Christmas that we have not needed to\r\neconomize.\n\nHelmer . Still, you know, we can't spend money recklessly.\n\nNora . Yes, Torvald, we may be a wee bit more reckless now, mayn't we?\r\nJust a tiny wee bit! You are going to have a big salary and earn lots\r\nand lots of money.\n\nHelmer . Yes, after the New Year; but then it will be a whole quarter\r\nbefore the salary is due.\n\nNora . Pooh! we can borrow till then.\n\nHelmer . Nora! ( Goes up to her and takes her playfully by the ear .)\r\nThe same little featherhead! Suppose, now, that I borrowed fifty pounds\r\ntoday, and you spent it all in the Christmas week, and then on New\r\nYear's Eve a slate fell on my head and killed me, and—\n\nNora ( putting her hands over his mouth ). Oh! don't say such horrid\r\nthings.\n\nHelmer . Still, suppose that happened,—what then?\n\nNora . If that were to happen, I don't suppose I should care whether I\r\nowed money or not.\n\nHelmer . Yes, but what about the people who had lent it?\n\nNora . They? Who would bother about them? I should not know who they\r\nwere.\n\nHelmer . That is like a woman! But seriously, Nora, you know what I\r\nthink about that. No debt, no borrowing. There can be no freedom or\r\nbeauty about a home life that depends on borrowing and debt. We two have\r\nkept bravely on the straight road so far, and we will go on the same way\r\nfor the short time longer that there need be any struggle.\n\nNora ( moving towards the stove ). As you please, Torvald.\n\nHelmer ( following her ). Come, come, my little skylark must not droop\r\nher wings. What is this! Is my little squirrel out of temper? ( Taking\r\nout his purse .) Nora, what do you think I have got here?\n\nNora ( turning round quickly ). Money!\n\nHelmer . There you are. ( Gives her some money .) Do you think I don't\r\nknow what a lot is wanted for housekeeping at Christmas-time?\n\nNora ( counting ). Ten shillings—a pound—two pounds! Thank you,\r\nthank you, Torvald; that will keep me going for a long time.\n\nHelmer . Indeed it must.\n\nNora . Yes, yes, it will. But come here and let me show you what I have\r\nbought. And ah so cheap! Look, here is a new suit for Ivar, and a sword;\r\nand a horse and a trumpet for Bob; and a doll and dolly's bedstead for\r\nEmmy.—they are very plain, but anyway she will soon break them in\r\npieces. And here are dress-lengths and handkerchiefs for the maids; old\r\nAnne ought really to have something better.\n\nHelmer . And what is in this parcel?\n\nNora ( crying out ). No, no! you mustn't see that till this evening.\n\nHelmer . Very well. But now tell me, you extravagant little person,\r\nwhat would you like for yourself?\n\nNora . For myself? Oh, I am sure I don't want anything.\n\nHelmer . Yes, but you must. Tell me something reasonable that you would\r\nparticularly like to have.\n\nNora . No, I really can't think of anything—unless, Torvald—\n\nHelmer . Well?\n\nNora ( playing with his coat buttons, and without raising her eyes to\r\nhis ). If you really want to give me something, you might—you might—\n\nHelmer . Well, out with it!\n\nNora ( speaking quickly ). You might give me money, Torvald. Only just\r\nas much as you can afford; and then one of these days I will buy\r\nsomething with it.\n\nHelmer . But, Nora—\n\nNora . Oh, do! dear Torvald; please, please do! Then I will wrap it up\r\nin beautiful gilt paper and hang it on the Christmas Tree. Wouldn't that\r\nbe fun?\n\nHelmer . What are little people called that are always wasting money?\n\nNora . Spendthrifts—I know. Let us do as you suggest, Torvald, and\r\nthen I shall have time to think what I am most in want of. That is a\r\nvery sensible plan, isn't it?\n\nHelmer ( smiling ). Indeed it is—that is to say, if you were really\r\nto save out of the money I give you, and then really buy something for\r\nyourself. But if you spend it all on the housekeeping and any number of\r\nunnecessary things, then I merely have to pay up again.\n\nNora . Oh but, Torvald—\n\nHelmer . You can't deny it, my dear, little Nora. ( Puts his arm round\r\nher waist .) It's a sweet little spendthrift, but she uses up a deal of\r\nmoney. One would hardly believe how expensive such little persons are!\n\nNora . It's a shame to say that. I do really save all I can.\n\nHelmer ( laughing ). That's very true,—all you can. But you can't\r\nsave anything!\n\nNora ( smiling quietly and happily ). You haven't any idea how many\r\nexpenses we skylarks and squirrels have, Torvald.\n\nHelmer . You are an odd little soul. Very like your father. You always\r\nfind some new way of wheedling money out of me, and, as soon as you have\r\ngot it, it seems to melt in your hands. You never know where it has\r\ngone. Still, one must take you as you are. It is in the blood; for\r\nindeed it is true that you can inherit these things, Nora.\n\nNora . Ah, I wish I had inherited many of papa's qualities.\n\nHelmer . And I would not wish you to be anything but just what you are,\r\nmy sweet little skylark. But, do you know, it strikes me that you are\r\nlooking rather—what shall I say—rather uneasy today?\n\nNora . Do I?\n\nHelmer . You do, really. Look straight at me.\n\nNora ( looks at him ). Well?\n\nHelmer ( wagging his finger at her ). Hasn't Miss Sweet-Tooth been\r\nbreaking rules in town today?\n\nNora . No; what makes you think that?\n\nHelmer . Hasn't she paid a visit to the confectioner's?\n\nNora . No, I assure you, Torvald—\n\nHelmer . Not been nibbling sweets?\n\nNora . No, certainly not.\n\nHelmer . Not even taken a bite at a macaroon or two?\n\nNora . No, Torvald, I assure you really—\n\nHelmer . There, there, of course I was only joking.\n\nNora ( going to the table on the right ). I should not think of going\r\nagainst your wishes.\n\nHelmer . No, I am sure of that; besides, you gave me your word—( Going\r\nup to her .) Keep your little Christmas secrets to yourself, my darling.\r\nThey will all be revealed tonight when the Christmas Tree is lit, no\r\ndoubt.\n\nNora . Did you remember to invite Doctor Rank?\n\nHelmer . No. But there is no need; as a matter of course he will come\r\nto dinner with us. However, I will ask him when he comes in this\r\nmorning. I have ordered some good wine. Nora, you can't think how I am\r\nlooking forward to this evening.\n\nNora . So am I! And how the children will enjoy themselves, Torvald!\n\nHelmer . It is splendid to feel that one has a perfectly safe\r\nappointment, and a big enough income. It's delightful to think of, isn't\r\nit?\n\nNora . It's wonderful!\n\nHelmer . Do you remember last Christmas? For a full three weeks\r\nbeforehand you shut yourself up every evening till long after midnight,\r\nmaking ornaments for the Christmas Tree and all the other fine things\r\nthat were to be a surprise to us. It was the dullest three weeks I ever\r\nspent!\n\nNora . I didn't find it dull.\n\nHelmer ( smiling ). But there was precious little result, Nora.\n\nNora . Oh, you shouldn't tease me about that again. How could I help\r\nthe cat's going in and tearing everything to pieces?\n\nHelmer . Of course you couldn't, poor little girl. You had the best of\r\nintentions to please us all, and that's the main thing. But it is a good\r\nthing that our hard times are over.\n\nNora . Yes, it is really wonderful.\n\nHelmer . This time I needn't sit here and be dull all alone, and you\r\nneedn't ruin your dear eyes and your pretty little hands—\n\nNora ( clapping her hands ). No, Torvald, I needn't any longer, need\r\nI! It's wonderfully lovely to hear you say so! ( Taking his arm .) Now I\r\nwill tell you how I have been thinking we ought to arrange things,\r\nTorvald. As soon as Christmas is over—( A bell rings in the hall .)\r\nThere's the bell. ( She tidies the room a little .) There's someone at\r\nthe door. What a nuisance!\n\nHelmer . If it is a caller, remember I am not at home.\n\nMaid ( in the doorway ). A lady to see you, ma'am,—a stranger.\n\nNora . Ask her to come in.\n\nMaid ( to HELMER). The doctor came at the same time, sir.\n\nHelmer . Did he go straight into my room?\n\nMaid . Yes, sir.\n\n(HELMER goes into his room. The MAID ushers in MRS. LINDE, who is\r\nin traveling dress, and shuts the door .)\n\nMrs Linde ( in a dejected and timid voice ). How do you do, Nora?\n\nNora ( doubtfully ). How do you do—\n\nMrs. Linde . You don't recognize me, I suppose.\n\nNora No, I don't know—yes, to be sure, I seem to—( Suddenly .) Yes!\r\nChristine! Is it really you?\n\nMrs. Linde . Yes, it is I.\n\nNora . Christine! To think of my not recognising you! And yet how could\r\nI—( In a gentle voice .) How you have altered, Christine!\n\nMrs. Linde . Yes, I have indeed. In nine, ten long years—\n\nNora . Is it so long since we met? I suppose it is. The last eight\r\nyears have been a happy time for me, I can tell you. And so now you have\r\ncome into the town, and have taken this long journey in winter—that was\r\nplucky of you.\n\nMrs. Linde . I arrived by steamer this morning.\n\nNora . To have some fun at Christmas-time, of course. How delightful!\r\nWe will have such fun together! But take off your things. You are not\r\ncold, I hope. ( Helps her .) Now we will sit down by the stove, and be\r\ncosy. No, take this arm-chair; I will sit here in the rocking-chair.\r\n( Takes her hands .) Now you look like your old self again; it was only\r\nthe first moment—You are a little paler, Christine, and perhaps a\r\nlittle thinner.\n\nMrs. Linde . And much, much older, Nora.\n\nNora . Perhaps a little older; very, very little; certainly not much.\r\n( Stops suddenly and speaks seriously .) What a thoughtless creature I\r\nam, chattering away like this. My poor, dear Christine, do forgive me.\n\nMrs. Linde . What do you mean, Nora?\n\nNora ( gently ). Poor Christine, you are a widow.\n\nMrs. Linde . Yes; it is three years ago now.\n\nNora . Yes, I knew; I saw it in the papers. I assure you, Christine, I\r\nmeant ever so often to write to you at the time, but I always put it off\r\nand something always prevented me.\n\nMrs. Linde . I quite understand, dear.\n\nNora . It was very bad of me, Christine. Poor thing, how you must have\r\nsuffered. And he left you nothing?\n\nMrs. Linde . No.\n\nNora . And no children?\n\nMrs. Linde . No.\n\nNora . Nothing at all, then?\n\nMrs. Linde . Not even any sorrow or grief to live upon.\n\nNora ( looking incredulously at her ). But, Christine, is that\r\npossible?\n\nMrs. Linde ( smiles sadly and strokes her hair ). It sometimes\r\nhappens, Nora.\n\nNora . So you are quite alone. How dreadfully sad that must be. I have\r\nthree lovely children. You can't see them just now, for they are out\r\nwith their nurse. But now you must tell me all about it.\n\nMrs. Linde . No, no; I want to hear about you.\n\nNora . No, you must begin. I mustn't be selfish today; today I must\r\nonly think of your affairs. But there is one thing I must tell you. Do\r\nyou know we have just had a great piece of good luck?\n\nMrs. Linde . No, what is it?\n\nNora . Just fancy, my husband has been made manager of the Bank!\n\nMrs. Linde . Your husband? What good luck!\n\nNora . Yes tremendous! A barrister's profession is such an uncertain\r\nthing, especially if he won't undertake unsavoury cases; and naturally\r\nTorvald has never been willing to do that, and I quite agree with him.\r\nYou may imagine how pleased we are! He is to take up his work in the\r\nBank at the New Year, and then he will have a big salary and lots of\r\ncommissions. For the future we can live quite differently—we can do\r\njust as we like. I feel so relieved and so happy, Christine! It will be\r\nsplendid to have heaps of money and not need to have any anxiety, won't\r\nit?\n\nMrs. Linde . Yes, anyhow I think it would be delightful to have what\r\none needs.\n\nNora . No, not only what one needs, but heaps and heaps of money.\n\nMrs. Linde ( smiling ). Nora, Nora, haven't you learnt sense yet? In\r\nour schooldays you were a great spendthrift.\n\nNora ( laughing ). Yes, that is what Torvald says now. ( Wags her\r\nfinger at her .) But \"Nora, Nora\" is not so silly as you think. We have\r\nnot been in a position for me to waste money. We have both had to work.\n\nMrs. Linde . You too?\n\nNora . Yes; odds and ends, needlework, crochet-work, embroidery, and\r\nthat kind of thing. ( Dropping her voice .) And other things as well.\r\nYou know Torvald left his office when we were married? There was no\r\nprospect of promotion there, and he had to try and earn more than\r\nbefore. But during the first year he overworked himself dreadfully. You\r\nsee, he had to make money every way he could, and he worked early and\r\nlate; but he couldn't stand it, and fell dreadfully ill, and the doctors\r\nsaid it was necessary for him to go south.\n\nMrs. Linde . You spent a whole year in Italy, didn't you?\n\nNora . Yes. It was no easy matter to get away, I can tell you. It was\r\njust after Ivar was born; but naturally we had to go. It was a\r\nwonderfully beautiful journey, and it saved Torvald's life. But it cost\r\na tremendous lot of money, Christine.\n\nMrs. Linde . So I should think.\n\nNora . It cost about two hundred and fifty pounds. That's a lot, isn't\r\nit?\n\nMrs. Linde . Yes, and in emergencies like that it is lucky to have the\r\nmoney.\n\nNora . I ought to tell you that we had it from papa.\n\nMrs. Linde . Oh, I see. It was just about that time that he died,\r\nwasn't it?\n\nNora . Yes; and, just think of it, I couldn't go and nurse him. I was\r\nexpecting little Ivar's birth every day and I had my poor sick Torvald\r\nto look after. My dear, kind father—I never saw him again, Christine.\r\nThat was the saddest time I have known since our marriage.\n\nMrs. Linde . I know how fond you were of him. And then you went off to\r\nItaly?\n\nNora . Yes; you see we had money then, and the doctors insisted on our\r\ngoing, so we started a month later.\n\nMrs. Linde . And your husband came back quite well?\n\nNora . As sound as a bell!\n\nMrs Linde . But—the doctor?\n\nNora . What doctor?\n\nMrs Linde . I thought your maid said the gentleman who arrived here\r\njust as I did, was the doctor?\n\nNora . Yes, that was Doctor Rank, but he doesn't come here\r\nprofessionally. He is our greatest friend, and comes in at least once\r\nevery day. No, Torvald has not had an hour's illness since then, and our\r\nchildren are strong and healthy and so am I. ( Jumps up and claps her\r\nhands .) Christine! Christine! it's good to be alive and happy!—But how\r\nhorrid of me; I am talking of nothing but my own affairs. ( Sits on a\r\nstool near her, and rests her arms on her knees .) You mustn't be angry\r\nwith me. Tell me, is it really true that you did not love your husband?\r\nWhy did you marry him?\n\nMrs. Linde . My mother was alive then, and was bedridden and helpless,\r\nand I had to provide for my two younger brothers; so I did not think I\r\nwas justified in refusing his offer.\n\nNora . No, perhaps you were quite right. He was rich at that time,\r\nthen?\n\nMrs. Linde . I believe he was quite well off. But his business was a\r\nprecarious one; and, when he died, it all went to pieces and there was\r\nnothing left.\n\nNora . And then?—\n\nMrs. Linde . Well, I had to turn my hand to anything I could\r\nfind—first a small shop, then a small school, and so on. The last three\r\nyears have seemed like one long working-day, with no rest. Now it is at\r\nan end, Nora. My poor mother needs me no more, for she is gone; and the\r\nboys do not need me either; they have got situations and can shift for\r\nthemselves.\n\nNora . What a relief you must feel it—\n\nMrs. Linde . No, indeed; I only feel my life unspeakably empty. No one\r\nto live for any more. ( Gets up restlessly .) That is why I could not\r\nstand the life in my little backwater any longer. I hope it may be\r\neasier here to find something which will busy me and occupy my thoughts.\r\nIf only I could have the good luck to get some regular work—office work\r\nof some kind—\n\nNora . But, Christine, that is so frightfully tiring, and you look\r\ntired out now. You had far better go away to some watering-place.\n\nMrs. Linde ( walking to the window ). I have no father to give me\r\nmoney for a journey, Nora.\n\nNora ( rising ). Oh, don't be angry with me.\n\nMrs. Linde ( going up to her ). It is you that must not be angry with\r\nme, dear. The worst of a position like mine is that it makes one so\r\nbitter. No one to work for, and yet obliged to be always on the look-out\r\nfor chances. One must live, and so one becomes selfish. When you told me\r\nof the happy turn your fortunes have taken—you will hardly believe\r\nit—I was delighted not so much on your account as on my own.\n\nNora . How do you mean?—Oh, I understand. You mean that perhaps\r\nTorvald could get you something to do.\n\nMrs. Linde . Yes, that was what I was thinking of.\n\nNora . He must, Christine. Just leave it to me; I will broach the\r\nsubject very cleverly—I will think of something that will please him\r\nvery much. It will make me so happy to be of some use to you.\n\nMrs. Linde . How kind you are, Nora, to be so anxious to help me! It is\r\ndoubly kind in you, for you know so little of the burdens and troubles\r\nof life.\n\nNora . I—? I know so little of them?\n\nMrs Linde ( smiling ). My dear! Small household cares and that sort of\r\nthing!—You are a child, Nora.\n\nNora ( tosses her head and crosses the stage ). You ought not to be so\r\nsuperior.\n\nMrs. Linde . No?\n\nNora . You are just like all the others. They all think that I am\r\nincapable of anything really serious—\n\nMrs. Linde . Come, come—\n\nNora .—that I have gone through nothing in this world of cares.\n\nMrs. Linde . But, my dear Nora, you have just told me all your\r\ntroubles.\n\nNora . Pooh!—those were trifles. ( Lowering her voice .) I have not\r\ntold you the important thing.\n\nMrs. Linde . The important thing? What do you mean?\n\nNora . You look down upon me altogether, Christine—but you ought not\r\nto. You are proud, aren't you, of having-worked so hard and so long for\r\nyour mother?\n\nMrs. Linde . Indeed, I don't look down on any one. But it is true that\r\nI am both proud and glad to think that I was privileged to make the end\r\nof my mother's life almost free from care.\n\nNora . And you are proud to think of what you have done for your\r\nbrothers.\n\nMrs. Linde . I think I have the right to be.\n\nNora . I think so, too. But now, listen to this; I too have something\r\nto be proud and glad of.\n\nMrs. Linde . I have no doubt you have. But what do you refer to?\n\nNora . Speak low. Suppose Torvald were to hear! He mustn't on any\r\naccount—no one in the world must know, Christine, except you.\n\nMrs. Linde . But what is it?\n\nNora . Come here. ( Pulls her down on the sofa beside her .) Now I will\r\nshow you that I too have something to be proud and glad of. It was I who\r\nsaved Torvald's life.\n\nMrs. Linde . \"Saved\"? How?\n\nNora . I told you about our trip to Italy. Torvald would never have\r\nrecovered if he had not gone there—\n\nMrs. Linde . Yes, but your father gave you the necessary funds.\n\nNora ( smiling ). Yes, that is what Torvald and all the others think,\r\nbut—\n\nMrs. Linde . But.—\n\nNora . Papa didn't give us a shilling. It was I who procured the money.\n\nMrs. Linde . You? All that large sum?\n\nNora . Two hundred and fifty pounds. What do you think of that?\n\nMrs. Linde . But, Nora, how could you possibly do it? Did you win a\r\nprize in the Lottery?\n\nNora ( contemptuously ). In the Lottery? There would have been no\r\ncredit in that.\n\nMrs. Linde . But where did you get it from, then?\n\nNora ( humming and smiling with an air of mystery ). Hm, hu! Aha!\n\nMrs. Linde . Because you couldn't have borrowed it.\n\nNora . Couldn't I? Why not?\n\nMrs. Linde . No, a wife cannot borrow without her husband's consent.\n\nNora ( tossing her head ). Oh, if it is a wife who has any head for\r\nbusiness—a wife who has the wit to be a little bit clever—\n\nMrs. Linde . I don't understand it at all, Nora.\n\nNora . There is no need you should. I never said I had borrowed the\r\nmoney. I may have got it some other way. ( Lies back on the sofa. )\r\nPerhaps I got it from some other admirer. When anyone is as attractive\r\nas I am—\n\nMrs. Linde . You are a mad creature.\n\nNora . Now, you know you're full of curiosity, Christine.\n\nMrs. Linde . Listen to me, Nora dear. Haven't you been a little bit\r\nimprudent?\n\nNora ( sits up straight ). Is it imprudent to save your husband's\r\nlife?\n\nMrs. Linde . It seems to me imprudent, without his knowledge, to—\n\nNora . But it was absolutely necessary that he should not know! My\r\ngoodness, can't you understand that? It was necessary he should have no\r\nidea what a dangerous condition he was in. It was to me that the doctors\r\ncame and said that his life was in danger, and that the only thing to\r\nsave him was to live in the south. Do you suppose I didn't try, first of\r\nall, to get what I wanted as if it were for myself? I told him how much\r\nI should love to travel abroad like other young wives; I tried tears and\r\nentreaties with him; I told him that he ought to remember the condition\r\nI was in, and that he ought to be kind and indulgent to me; I even\r\nhinted that he might raise a loan. That nearly made him angry,\r\nChristine. He said I was thoughtless, and that it was his duty as my\r\nhusband not to indulge me in my whims and caprices—as I believe he\r\ncalled them. Very well, I thought, you must be saved—and that was how I\r\ncame to devise a way out of the difficulty—\n\nMrs. Linde . And did your husband never get to know from your father\r\nthat the money had not come from him?\n\nNora . No, never. Papa died just at that time. I had meant to let him\r\ninto the secret and beg him never to reveal it. But he was so ill\r\nthen—alas, there never was any need to tell him.\n\nMrs. Linde . And since then have you never told your secret to your\r\nhusband?\n\nNora . Good Heavens, no! How could you think so? A man who has such\r\nstrong opinions about these things! And besides, how painful and\r\nhumiliating it would be for Torvald, with his manly independence, to\r\nknow that he owed me anything! It would upset our mutual relations\r\naltogether; our beautiful happy home would no longer be what it is now.\n\nMrs. Linde . Do you mean never to tell him about it?\n\nNora ( meditatively, and with a half smile. ) Yes—some day, perhaps,\r\nafter many years, when I am no longer as nice-looking as I am now.\r\nDon't laugh at me! I mean, of course, when Torvald is no longer as\r\ndevoted to me as he is now; when my dancing and dressing-up and reciting\r\nhave palled on him; then it may be a good thing to have something in\r\nreserve—( Breaking off, ) What nonsense! That time will never come.\r\nNow, what do you think of my great secret, Christine? Do you still think\r\nI am of no use? I can tell you, too, that this affair has caused me a\r\nlot of worry. It has been by no means easy for me to meet my engagements\r\npunctually. I may tell you that there is something that is called, in\r\nbusiness, quarterly interest, and another thing called payment in\r\ninstalments, and it is always so dreadfully difficult to manage them. I\r\nhave had to save a little here and there, where I could, you understand.\r\nI have not been able to put aside much from my housekeeping money, for\r\nTorvald must have a good table. I couldn't let my children be shabbily\r\ndressed; I have felt obliged to use up all he gave me for them, the\r\nsweet little darlings!\n\nMrs. Linde . So it has all had to come out of your own necessaries of\r\nlife, poor Nora?\n\nNora . Of course. Besides, I was the one responsible for it. Whenever\r\nTorvald has given me money for new dresses and such things, I have never\r\nspent more than half of it; I have always bought the simplest and\r\ncheapest things. Thank Heaven, any clothes look well on me, and so\r\nTorvald has never noticed it. But it was often very hard on me,\r\nChristine—because it is delightful to be really well dressed, isn't it?\n\nMrs. Linde . Quite so.\n\nNora . Well, then I have found other ways of earning money. Last winter\r\nI was lucky enough to get a lot of copying to do; so I locked myself up\r\nand sat writing every evening until quite late at night. Many a time I\r\nwas desperately tired; but all the same it was a tremendous pleasure to\r\nsit there working and earning money. It was like being a man.\n\nMrs. Linde . How much have you been able to pay off in that way?\n\nNora . I can't tell you exactly. You see, it is very difficult to keep\r\nan account of a business matter of that kind. I only know that I have\r\npaid every penny that I could scrape together. Many a time I was at my\r\nwits' end. ( Smiles. ) Then I used to sit here and imagine that a rich\r\nold gentleman had fallen in love with me—\n\nMrs. Linde . What! Who was it?\n\nNora . Be quiet!—that he had died; and that when his will was opened\r\nit contained, written in big letters, the instruction: \"The lovely Mrs.\r\nNora Helmer is to have all I possess paid over to her at once in cash.\"\n\nMrs. Linde . But, my dear Nora—who could the man be?\n\nNora . Good gracious, can't you understand? There was no old gentleman\r\nat all; it was only something that I used to sit here and imagine, when\r\nI couldn't think of any way of procuring money. But it's all the same\r\nnow; the tiresome old person can stay where he is, as far as I am\r\nconcerned; I don't care about him or his will either, for I am free from\r\ncare now. ( Jumps up .) My goodness, it's delightful to think of,\r\nChristine! Free from care! To be able to be free from care, quite free\r\nfrom care; to be able to play and romp with the children; to be able to\r\nkeep the house beautifully and have everything just as Torvald likes it!\r\nAnd, think of it, soon the spring will come and the big blue sky!\r\nPerhaps we shall be able to take a little trip—perhaps I shall see the\r\nsea again! Oh, it's a wonderful thing to be alive and be happy. ( A bell\r\nis heard in the hall .)\n\nMrs. Linde ( rising ). There is the bell; perhaps I had better go.\n\nNora . No, don't go; no one will come in here; it is sure to be for\r\nTorvald.\n\nServant ( at the hall door ). Excuse me, ma'am—there is a gentleman\r\nto see the master, and as the doctor is with him—\n\nNora . Who is it?\n\nKrogstad ( at the door ). It is I, Mrs. Helmer. ( Mrs. LINDE starts,\r\ntrembles, and turns to the window .)\n\nNora ( takes a step towards him, and speaks in a strained low voice ).\r\nYou? What is it? What do you want to see my husband about?\n\nKrogstad . Bank business—in a way. I have a small post in the Bank,\r\nand I hear your husband is to be our chief now—\n\nNora . Then it is—\n\nKrogstad . Nothing but dry business matters, Mrs. Helmers; absolutely\r\nnothing else.\n\nNora . Be so good as to go into the study then. ( She bows\r\nindifferently to him and shuts the door into the hall; then comes back\r\nand makes up the fire in the stove .)\n\nMrs. Linde . Nora—who was that man?\n\nNora . A lawyer, of the name of Krogstad.\n\nMrs. Linde . Then it really was he.\n\nNora . Do you know the man?\n\nMrs. Linde . I used to—many years ago. At one time he was a\r\nsolicitor's clerk in our town.\n\nNora . Yes, he was.\n\nMrs. Linde . He is greatly altered.\n\nNora . He made a very unhappy marriage.\n\nMrs. Linde . He is a widower now, isn't he?\n\nNora . With several children. There now, it is burning up. ( Shuts the\r\ndoor of the stove and moves the rocking-chair aside .)\n\nMrs. Linde . They say he carries on various kinds of business.\n\nNora . Really! Perhaps he does; I don't know anything about it. But\r\ndon't let us think of business; it is so tiresome.\n\nDoctor Rank ( comes out of HELMER'S study. Before he shuts the door\r\nhe calls to him ). No, my dear fellow, I won't disturb you; I would\r\nrather go in to your wife for a little while. ( Shuts the door and sees Mrs. LINDE.) I beg your pardon; I am afraid I am disturbing you too.\n\nNora . No, not at all. ( Introducing him .) Doctor Rank, Mrs. Linde.\n\nRank . I have often heard Mrs. Linde's name mentioned here. I think I\r\npassed you on the stairs when I arrived, Mrs. Linde?\n\nMrs. Linde . Yes, I go up very slowly; I can't manage stairs well.\n\nRank . Ah! some slight internal weakness?",
      "summary": "The opening scene introduces Nora Helmer, who returns home from Christmas shopping. She interacts with her husband Torvald, revealing their financial situation and relationship dynamics. Nora's old friend Christine Linde visits, and they catch up on their lives. Nora confides in Christine about secretly borrowing money to save Torvald's life, which she's been repaying in secret. The arrival of Krogstad, a bank employee, causes tension. Dr. Rank also makes an appearance.",
      "prominence": 95,
      "key_characters": [
        {
          "name": "Nora Helmer",
          "description": "The protagonist, wife of Torvald Helmer, mother of three children.",
          "summary": "Nora appears cheerful and carefree but harbors a secret about borrowing money to save her husband's life. She's been repaying the debt in secret, showing resourcefulness and determination."
        },
        {
          "name": "Torvald Helmer",
          "description": "Nora's husband, recently appointed as bank manager.",
          "summary": "Torvald treats Nora in a patronizing manner, calling her pet names and controlling their finances. He's unaware of Nora's secret loan and her efforts to repay it."
        },
        {
          "name": "Christine Linde",
          "description": "Nora's old friend, a widow who has fallen on hard times.",
          "summary": "Christine visits Nora after years apart, seeking employment. She listens to Nora's secret and provides a contrasting perspective on life and marriage."
        },
        {
          "name": "Nils Krogstad",
          "description": "A bank employee with a questionable past.",
          "summary": "Krogstad's arrival causes tension, hinting at a potential conflict related to Torvald's new position at the bank."
        },
        {
          "name": "Doctor Rank",
          "description": "A friend of the Helmers who visits regularly.",
          "summary": "Dr. Rank makes a brief appearance, showing his familiarity with the household and hinting at some health issues."
        }
      ],
      "chapter": "Act I",
      "conversation": [
        {
          "scenario": "Nora has just returned home from Christmas shopping and is interacting with her husband Torvald in their living room.",
          "topic": "Nora's spending habits and their financial situation",
          "key_characters": [
            {
              "name": "Nora Helmer",
              "thought": "[I'm excited about our improved financial situation, but I must be careful not to reveal my secret loan. I'll play the role of the carefree spendthrift he expects me to be.]"
            },
            {
              "name": "Torvald Helmer",
              "thought": "[I need to keep Nora's spending in check, but I also want to indulge her a little. She's like a child when it comes to money matters.]"
            }
          ],
          "dialogues": [
            {
              "character": "Nora",
              "message": "[I can't wait to show Torvald what I've bought. I hope he won't be too upset about the spending.] (enters the room, humming cheerfully) Torvald, come here and see what I have bought!"
            },
            {
              "character": "Torvald",
              "message": "[Here we go again with her spending. I need to be firm but gentle.] (comes into the room, pen in hand) Bought, did you say? All these things? Has my little spendthrift been wasting money again?"
            },
            {
              "character": "Nora",
              "message": "[He doesn't understand how careful I've actually been. I'll remind him of our improved circumstances.] Yes, but, Torvald, this year we really can let ourselves go a little. This is the first Christmas that we have not needed to economize."
            },
            {
              "character": "Torvald",
              "message": "[She's right, but we still need to be cautious.] Still, you know, we can't spend money recklessly."
            },
            {
              "character": "Nora",
              "message": "[I'll use my charm to soften him up.] Yes, Torvald, we may be a wee bit more reckless now, mayn't we? Just a tiny wee bit! You are going to have a big salary and earn lots and lots of money."
            },
            {
              "character": "Torvald",
              "message": "[She's so childlike in her understanding of finances. I need to explain it to her.] Yes, after the New Year; but then it will be a whole quarter before the salary is due."
            },
            {
              "character": "Nora",
              "message": "[If only he knew how well I understand financial matters now. I'll play along.] Pooh! we can borrow till then."
            },
            {
              "character": "Torvald",
              "message": "[I can't believe she suggested borrowing. I need to correct this immediately.] Nora! (Goes up to her and takes her playfully by the ear.) The same little featherhead! Suppose, now, that I borrowed fifty pounds today, and you spent it all in the Christmas week, and then on New Year's Eve a slate fell on my head and killed me, and—"
            },
            {
              "character": "Nora",
              "message": "[His hypothetical scenario is too close to our real situation. I need to change the subject.] (putting her hands over his mouth) Oh! don't say such horrid things."
            },
            {
              "character": "Torvald",
              "message": "[She's not taking this seriously. I need to make her understand.] Still, suppose that happened,—what then?"
            },
            {
              "character": "Nora",
              "message": "[If only he knew the truth. I'll give a flippant answer to avoid suspicion.] If that were to happen, I don't suppose I should care whether I owed money or not."
            },
            {
              "character": "Torvald",
              "message": "[Her answer shows her lack of responsibility. I need to educate her.] Yes, but what about the people who had lent it?"
            },
            {
              "character": "Nora",
              "message": "[I know all too well about lenders, but I can't let him see that.] They? Who would bother about them? I should not know who they were."
            },
            {
              "character": "Torvald",
              "message": "[Her attitude is concerning. I need to reinforce our principles.] That is like a woman! But seriously, Nora, you know what I think about that. No debt, no borrowing. There can be no freedom or beauty about a home life that depends on borrowing and debt. We two have kept bravely on the straight road so far, and we will go on the same way for the short time longer that there need be any struggle."
            },
            {
              "character": "Nora",
              "message": "[If only he knew how I've struggled to keep us afloat. But I must keep playing my part.] (moving towards the stove) As you please, Torvald."
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "(THE SAME SCENE— The Christmas Tree is in the corner by the piano,\r\nstripped of its ornaments and with burnt-down candle-ends on its\r\ndishevelled branches. NORA'S cloak and hat are lying on the sofa. She\r\nis alone in the room, walking about uneasily. She stops by the sofa and\r\ntakes up her cloak. )\n\nNora ( drops the cloak ). Someone is coming now! ( Goes to the door\r\nand listens. ) No—it is no one. Of course, no one will come today,\r\nChristmas Day—nor tomorrow either. But, perhaps—( opens the door and\r\nlooks out .) No, nothing in the letter-box; it is quite empty. ( Comes\r\nforward. ) What rubbish! of course he can't be in earnest about it. Such\r\na thing couldn't happen; it is impossible—I have three little children.\n\n( Enter the NURSE from the room on the left, carrying a big cardboard\r\nbox. )\n\nNurse . At last I have found the box with the fancy dress.\n\nNora . Thanks; put it on the table.\n\nNurse ( doing so ). But it is very much in want of mending.\n\nNora . I should like to tear it into a hundred thousand pieces.\n\nNurse . What an idea! It can easily be put in order—just a little\r\npatience.\n\nNora . Yes, I will go and get Mrs. Linde to come and help me with it.\n\nNurse . What, out again? In this horrible weather? You will catch cold,\r\nma'am, and make yourself ill.\n\nNora . Well, worse than that might happen. How are the children?\n\nNurse . The poor little souls are playing with their Christmas\r\npresents, but—\n\nNora . Do they ask much for me?\n\nNurse . You see, they are so accustomed to have their mamma with them.\n\nNora . Yes, but, nurse, I shall not be able to be so much with them now\r\nas I was before.\n\nNurse . Oh well, young children easily get accustomed to anything.\n\nNora . Do you think so? Do you think they would forget their mother if\r\nshe went away altogether?\n\nNurse . Good heavens!—went away altogether?\n\nNora . Nurse, I want you to tell me something I have often wondered\r\nabout—how could you have the heart to put your own child out among\r\nstrangers?\n\nNurse . I was obliged to, if I wanted to be little Nora's nurse.\n\nNora . Yes, but how could you be willing to do it?",
      "summary": "Act II opens with Nora alone, anxious about her secret. She interacts with the nurse about her children and a fancy dress for an upcoming ball. Mrs. Linde arrives to help with the dress. Nora's anxiety about her past actions and their potential consequences is evident throughout the scene.",
      "prominence": 90,
      "key_characters": [
        {
          "name": "Nora Helmer",
          "description": "The protagonist, wife of Torvald, anxious about her secret.",
          "summary": "Nora is visibly anxious and conflicted about her past actions. She contemplates the consequences of her choices and shows concern for her children's future."
        },
        {
          "name": "Nurse",
          "description": "The Helmers' nursemaid who cared for Nora as a child.",
          "summary": "The nurse provides insight into Nora's past and her own experience as a mother who had to give up her child. She helps with practical matters and offers support to Nora."
        },
        {
          "name": "Mrs. Linde",
          "description": "Nora's old friend who has come to help with her costume.",
          "summary": "Mrs. Linde arrives to assist Nora with her fancy dress for the upcoming ball. Her presence provides Nora with a confidante and support."
        }
      ],
      "chapter": "Act II",
      "conversation": [
        {
          "scenario": "Nora is alone in the living room, anxious about her secret and the potential consequences of her actions.",
          "topic": "Nora's anxiety and her relationship with her children",
          "key_characters": [
            {
              "name": "Nora Helmer",
              "thought": "[I'm terrified of the consequences of my actions. What if the truth comes out? How will it affect my children?]"
            },
            {
              "name": "Nurse",
              "thought": "[I'm concerned about Nora's state of mind. She seems unusually anxious and preoccupied.]"
            }
          ],
          "dialogues": [
            {
              "character": "Nora",
              "message": "[I can't shake this feeling of dread.] (walks about uneasily) Someone is coming now! (Goes to the door and listens) No—it is no one. Of course, no one will come today, Christmas Day—nor tomorrow either. But, perhaps— (opens the door and looks out) No, nothing in the letterbox; it is quite empty. (Comes forward) What rubbish! of course he can't be in earnest about it. Such a thing couldn't happen; it is impossible—I have three little children."
            },
            {
              "character": "Environment",
              "message": "The Christmas tree stands in the corner, stripped of its ornaments, a symbol of the fading holiday cheer. Nora's cloak and hat lie on the sofa, evidence of her recent outing."
            },
            {
              "character": "Nurse",
              "message": "(enters carrying a big cardboard box) [Nora seems distracted. I should try to cheer her up.] At last I have found the box with the fancy dress."
            },
            {
              "character": "Nora",
              "message": "[I need to focus on something else to distract myself.] Thanks; put it on the table."
            },
            {
              "character": "Nurse",
              "message": "(doing so) [The dress needs work. Maybe this will give Nora something to focus on.] But it is very much in want of mending."
            },
            {
              "character": "Nora",
              "message": "[I feel like tearing everything apart, just like my life might be torn apart.] I should like to tear it into a hundred thousand pieces."
            },
            {
              "character": "Nurse",
              "message": "[She's clearly upset about something. I'll try to reassure her.] What an idea! It can easily be put in order—just a little patience."
            },
            {
              "character": "Nora",
              "message": "[I need help, but I can't reveal too much.] Yes, I will go and get Mrs. Linde to come and help me with it."
            },
            {
              "character": "Nurse",
              "message": "[She shouldn't go out in this state.] What, out again? In this horrible weather? You will catch cold, ma'am, and make yourself ill."
            },
            {
              "character": "Nora",
              "message": "[If only she knew what I'm really worried about.] Well, worse than that might happen. How are the children?"
            },
            {
              "character": "Nurse",
              "message": "[The poor dear, always thinking of her children.] The poor little souls are playing with their Christmas presents, but—"
            },
            {
              "character": "Nora",
              "message": "[I fear I might lose them. I need to know they still need me.] Do they ask much for me?"
            },
            {
              "character": "Nurse",
              "message": "[She seems unusually concerned about the children.] You see, they are so accustomed to have their mamma with them."
            },
            {
              "character": "Nora",
              "message": "[I might not be able to be with them much longer. I need to prepare them.] Yes, but, nurse, I shall not be able to be so much with them now as I was before."
            },
            {
              "character": "Nurse",
              "message": "[Why is she talking like this? I should reassure her.] Oh well, young children easily get accustomed to anything."
            },
            {
              "character": "Nora",
              "message": "[The thought of my children forgetting me is unbearable.] Do you think so? Do you think they would forget their mother if she went away altogether?"
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "But I suppose your daughter has quite forgotten you.\n\nNurse . No, indeed she hasn't. She wrote to me when she was confirmed,\r\nand when she was married.\n\nNora ( putting her arms round her neck ). Dear old Anne, you were a\r\ngood mother to me when I was little.\n\nNurse . Little Nora, poor dear, had no other mother but me.\n\nNora . And if my little ones had no other mother, I am sure you\r\nwould—What nonsense I am talking! ( Opens the box. ) Go in to them. Now\r\nI must—. You will see tomorrow how charming I shall look.\n\nNurse . I am sure there will be no one at the ball so charming as you,\r\nma'am. ( Goes into the room on the left. )\n\nNora ( begins to unpack the box, but soon pushes it away from her ).\r\nIf only I dared go out. If only no one would come. If only I could be\r\nsure nothing would happen here in the meantime. Stuff and nonsense! No\r\none will come. Only I mustn't think about it. I will brush my muff. What\r\nlovely, lovely gloves! Out of my thoughts, out of my thoughts! One, two,\r\nthree, four, five, six—( Screams. ) Ah! there is someone coming—.\r\n( Makes a movement towards the door, but stands irresolute .)\n\n( Enter MRS. LINDE from the hall, where she has taken off her cloak\r\nand hat .)\n\nNora . Oh, it's you, Christine. There is no one else out there, is\r\nthere? How good of you to come!\n\nMrs. Linde . I heard you were up asking for me.\n\nNora . Yes, I was passing by. As a matter of fact, it is something you\r\ncould help me with. Let us sit down here on the sofa. Look here.\r\nTomorrow evening there is to be a fancy-dress ball at the Stenborgs',\r\nwho live above us; and Torvald wants me to go as a Neapolitan\r\nfisher-girl, and dance the Tarantella that I learnt at Capri.\n\nMrs. Linde . I see; you are going to keep up the character.\n\nNora . Yes, Torvald wants me to. Look, here is the dress; Torvald had\r\nit made for me there, but now it is all so torn, and I haven't any\r\nidea—\n\nMrs. Linde . We will easily put that right. It is only some of the\r\ntrimming come unsewn here and there. Needle and thread? Now then, that's\r\nall we want.\n\nNora . It is nice of you.\n\nMrs. Linde ( sewing ). So you are going to be dressed up tomorrow,\r\nNora. I will tell you what—I shall come in for a moment and see you in\r\nyour fine feathers. But I have completely forgotten to thank you for a\r\ndelightful evening yesterday.\n\nNora ( gets up, and crosses the stage ). Well I don't think yesterday\r\nwas as pleasant as usual. You ought to have come to town a little\r\nearlier, Christine. Certainly Torvald does understand how to make a\r\nhouse dainty and attractive.\n\nMrs. Linde . And so do you, it seems to me; you are not your father's\r\ndaughter for nothing. But tell me, is Doctor Rank always as depressed as\r\nhe was yesterday?\n\nNora . No; yesterday it was very noticeable. I must tell you that he\r\nsuffers from a very dangerous disease. He has consumption of the\r\nspine, poor creature. His father was a horrible man who committed all\r\nsorts of excesses; and that is why his son was sickly from childhood, do\r\nyou understand?\n\nMrs. Linde ( dropping her sewing ). But, my dearest Nora, how do you\r\nknow anything about such things?\n\nNora ( walking about ). Pooh! When you have three children, you get\r\nvisits now and then from—from married women, who know something of\r\nmedical matters, and they talk about one thing and another.\n\nMrs. Linde ( goes on sewing. A short silence ). Does Doctor Rank come\r\nhere every day?\n\nNora . Every day regularly. He is Torvald's most intimate friend, and a\r\ngreat friend of mine too. He is just like one of the family.\n\nMrs. Linde . But tell me this—is he perfectly sincere? I mean, isn't\r\nhe the kind of a man that is very anxious to make himself agreeable?\n\nNora . Not in the least. What makes you think that?\n\nMrs. Linde . When you introduced him to me yesterday, he declared he\r\nhad often heard my name mentioned in this house; but afterwards I\r\nnoticed that your husband hadn't the slightest idea who I was. So how\r\ncould Doctor Rank—?\n\nNora . That is quite right, Christine. Torvald is so absurdly fond of\r\nme that he wants me absolutely to himself, as he says. At first he used\r\nto seem almost jealous if I mentioned any of the dear folk at home, so\r\nnaturally I gave up doing so. But I often talk about such things with\r\nDoctor Rank, because he likes hearing about them.\n\nMrs. Linde . Listen to me, Nora. You are still very like a child in\r\nmany ways, and I am older than you in many ways and have a little more\r\nexperience. Let me tell you this—you ought to make an end of it with\r\nDoctor Rank.\n\nNora . What ought I to make an end of?\n\nMrs. Linde . Of two things, I think. Yesterday you talked some nonsense\r\nabout a rich admirer who was to leave you money—\n\nNora . An admirer who doesn't exist, unfortunately! But what then?\n\nMrs. Linde . Is Doctor Rank a man of means?\n\nNora . Yes, he is.\n\nMrs. Linde . And has no one to provide for?\n\nNora . No, no one; but—\n\nMrs. Linde . And comes here every day?\n\nNora . Yes, I told you so.\n\nMrs. Linde . But how can this well-bred man be so tactless?\n\nNora . I don't understand you at all.\n\nMrs. Linde . Don't prevaricate, Nora. Do you suppose I don't guess who\r\nlent you the two hundred and fifty pounds.\n\nNora . Are you out of your senses? How can you think of such a thing! A\r\nfriend of ours, who comes here every day! Do you realise what a horribly\r\npainful position that would be?\n\nMrs. Linde . Then it really isn't he?\n\nNora . No, certainly not. It would never have entered into my head for\r\na moment. Besides, he had no money to lend then; he came into his money\r\nafterwards.\n\nMrs. Linde . Well, I think that was lucky for you, my dear Nora.\n\nNora . No, it would never have come into my head to ask Doctor Rank.\r\nAlthough I am quite sure that if I had asked him—\n\nMrs. Linde . But of course you won't.\n\nNora . Of course not. I have no reason to think it could possibly be\r\nnecessary. But I am quite sure that if I told Doctor Rank—\n\nMrs. Linde . Behind your husband's back?\n\nNora . I must make an end of it with the other one, and that will be\r\nbehind his back too. I must make an end of it with him.\n\nMrs. Linde . Yes, that is what I told you yesterday, but—\n\nNora ( walking up and down ). A man can put a thing like that straight\r\nmuch easier than a woman—\n\nMrs. Linde . One's husband, yes.\n\nNora . Nonsense! ( Standing still .) When you pay off a debt you get\r\nyour bond back, don't you?\n\nMrs. Linde . Yes, as a matter of course.\n\nNora . And can tear it into a hundred thousand pieces, and burn it\r\nup—the nasty, dirty paper!\n\nMrs. Linde ( looks hard at her, lays down her sewing and gets up\r\nslowly ). Nora, you are concealing something from me.\n\nNora . Do I look as if I were?\n\nMrs. Linde . Something has happened to you since yesterday morning.\r\nNora, what is it?\n\nNora ( going nearer to her ). Christine! ( Listens .) Hush! there's\r\nTorvald come home. Do you mind going in to the children for the present?\r\nTorvald can't bear to see dressmaking going on. Let Anne help you.\n\nMrs. Linde ( gathering some of the things together ). Certainly—but I\r\nam not going away from here till we have had it out with one another.\r\n( She goes into the room, on the left, as Helmer comes in from, the\r\nhall .)\n\nNora ( going up to HELMAR). I have wanted you so much, Torvald dear.\n\nHelmer . Was that the dressmaker?\n\nNora . No, it was Christine; she is helping me to put my dress in\r\norder. You will see I shall look quite smart.\n\nHelmer . Wasn't that a happy thought of mine, now?\n\nNora . Splendid! But don't you think it is nice of me, too, to do as\r\nyou wish?\n\nHelmer . Nice?—because you do as your husband wishes? Well, well, you\r\nlittle rogue, I am sure you did not mean it in that way. But I am not\r\ngoing to disturb you; you will want to be trying on your dress, I\r\nexpect.\n\nNora . I suppose you are going to work.\n\nHelmer . Yes. ( Shows her a bundle of papers .) Look at that. I have\r\njust been into the bank. ( Turns to go into his room .)\n\nNora . Torvald.\n\nHelmer . Yes.\n\nNora . If your little squirrel were to ask you for something very, very\r\nprettily—?\n\nHelmer . What then?\n\nNora . Would you do it?\n\nHelmer . I should like to hear what it is, first.\n\nNora . Your squirrel would run about and do all her tricks if you would\r\nbe nice, and do what she wants.\n\nHelmer . Speak plainly.\n\nNora . Your skylark would chirp about in every room, with her song\r\nrising and falling—\n\nHelmer . Well, my skylark does that anyhow.\n\nNora . I would play the fairy and dance for you in the moonlight,\r\nTorvald.\n\nHelmer . Nora—you surely don't mean that request you made of me this\r\nmorning?\n\nNora ( going near him ). Yes, Torvald, I beg you so earnestly—\n\nHelmer . Have you really the courage to open up that question again?\n\nNora . Yes, dear, you must do as I ask; you must let Krogstad keep\r\nhis post in the bank.\n\nHelmer . My dear Nora, it is his post that I have arranged Mrs. Linde\r\nshall have.\n\nNora. Yes, you have been awfully kind about that; but you could just\r\nas well dismiss some other clerk instead of Krogstad.\n\nHelmer. This is simply incredible obstinacy! Because you chose to give\r\nhim a thoughtless promise that you would speak for him, I am expected\r\nto—\n\nNora. That isn't the reason, Torvald. It is for your own sake. This\r\nfellow writes in the most scurrilous newspapers; you have told me so\r\nyourself. He can do you an unspeakable amount of harm. I am frightened\r\nto death of him—\n\nHelmer. Ah, I understand; it is recollections of the past that scare\r\nyou.\n\nNora. What do you mean?\n\nHelmer. Naturally you are thinking of your father.\n\nNora. Yes—yes, of course. Just recall to your mind what these\r\nmalicious creatures wrote in the papers about papa, and how horribly\r\nthey slandered him. I believe they would have procured his dismissal if\r\nthe Department had not sent you over to inquire into it, and if you had\r\nnot been so kindly disposed and helpful to him.\n\nHelmer. My little Nora, there is an important difference between your\r\nfather and me. Your father's reputation as a public official was not\r\nabove suspicion. Mine is, and I hope it will continue to be so, as long\r\nas I hold my office.\n\nNora. You never can tell what mischief these men may contrive. We\r\nought to be so well off, so snug and happy here in our peaceful home,\r\nand have no cares—you and I and the children, Torvald! That is why I\r\nbeg you so earnestly—\n\nHelmer . And it is just by interceding for him that you make it\r\nimpossible for me to keep him. It is already known at the Bank that I\r\nmean to dismiss Krogstad. Is it to get about now that the new manager\r\nhas changed his mind at his wife's bidding—\n\nNora . And what if it did?\n\nHelmer . Of course!—if only this obstinate little person can get her\r\nway! Do you suppose I am going to make myself ridiculous before my whole\r\nstaff, to let people think that I am a man to be swayed by all sorts of\r\noutside influence? I should very soon feel the consequences of it, I can\r\ntell you. And besides, there is one thing that makes it quite impossible\r\nfor me to have Krogstad in the bank as long as I am manager.\n\nNora . Whatever is that?\n\nHelmer . His moral failings I might perhaps have overlooked, if\r\nnecessary—\n\nNora . Yes, you could—couldn't you?\n\nHelmer . And, I hear he is a good worker, too. But I knew him when we\r\nwere boys. It was one of those rash friendships that so often prove an\r\nincubus in after life. I may as well tell you plainly, we were once on\r\nvery intimate terms with one another. But this tactless fellow lays no\r\nrestraint upon himself when other people are present. On the contrary,\r\nhe thinks it gives him the right to adopt a familiar tone with me, and\r\nevery minute it is \"I say, Helmer, old fellow!\" and that sort of thing.\r\nI assure you it is extremely painful to me. He would make my position in\r\nthe bank intolerable.\n\nNora . Torvald, I don't believe you mean that.\n\nHelmer . Don't you? Why not?\n\nNora . Because it is such a narrow-minded way of looking at things.\n\nHelmer . What are you saying? Narrow-minded? Do you think I am\r\nnarrow-minded?\n\nNora . No, just the opposite, dear—and it is exactly for that reason.\n\nHelmer . It's the same thing. You say my point of view is\r\nnarrow-minded, so I must be so, too. Narrow-minded! Very well—I must\r\nput an end to this. ( Goes to the hall door and calls.) Helen!\n\nNora . What are you going to do?\n\nHelmer ( looking among his papers) . Settle it. ( Enter MAID.) Look\r\nhere; take this letter and go downstairs with it at once. Find a\r\nmessenger and tell him to deliver it, and be quick. The address is on\r\nit, and here is the money.\n\nMaid . Very well, sir. ( Exit with the letter .)\n\nHelmer ( putting his papers together ). Now, then, little Miss\r\nObstinate.\n\nNora ( breathlessly ). Torvald—what was that letter?\n\nHelmer . Krogstad's dismissal.\n\nNora . Call her back, Torvald! There is still time. Oh Torvald, call\r\nher back! Do it for my sake—for your own sake, for the children's sake!\r\nDo you hear me, Torvald? Call her back! You don't know what that letter\r\ncan bring upon us.\n\nHelmer . It's too late.\n\nNora . Yes, it's too late.\n\nHelmer . My dear Nora, I can forgive the anxiety you are in, although\r\nreally it is an insult to me. It is, indeed. Isn't it an insult to think\r\nthat I should be afraid of a starving quill-driver's vengeance? But I\r\nforgive you, nevertheless, because it is such eloquent witness to your\r\ngreat love for me. ( Takes her in his arms.) And that is as it should\r\nbe, my own darling Nora. Come what will, you may be sure I shall have\r\nboth courage and strength if they be needed. You will see I am man\r\nenough to take everything upon myself.\n\nNora ( in a horror-stricken voice ). What do you mean by that?\n\nHelmer . Everything I say—\n\nNora ( recovering herself ). You will never have to do that.\n\nHelmer . That's right. Well, we will share it, Nora, as man and wife\r\nshould. That is how it shall be. ( Caressing her .) Are you content now?\r\nThere! There!—not these frightened dove's eyes! The whole thing is only\r\nthe wildest fancy!—Now, you must go and play through the Tarantella and\r\npractice with your tambourine. I shall go into the inner office and shut\r\nthe door, and I shall hear nothing; you can make as much noise as you\r\nplease. ( Turns back at the door.) And when Rank comes, tell him where\r\nhe will find me. ( Nods to her, takes his papers and goes into his room,\r\nand shuts the door after him .)\n\nNora ( bewildered with anxiety, stands as if rooted to the spot, and\r\nwhispers ). He was capable of doing it. He will do it. He will do it in\r\nspite of everything.—No, not that! Never, never! Anything rather than\r\nthat! Oh, for some help, some way out of it. ( The door-bell rings .)\r\nDoctor Rank! Anything rather than that—anything, whatever it is! ( She\r\nputs her hands over her face, pulls herself together, goes to the door\r\nand opens it. RANK is standing without, hanging up his coat. During\r\nthe following dialogue it begins to grow dark .)\n\nNora . Good-day, Doctor Rank. I knew your ring. But you mustn't go into\r\nTorvald now; I think he is busy with something.\n\nRank . And you?\n\nNora ( brings him in and shuts the door after him ). Oh, you know very\r\nwell I always have time for you.\n\nRank . Thank you. I shall make use of as much of it as I can.\n\nNora . What do you mean by that? As much of it as you can.\n\nRank . Well, does that alarm you?\n\nNora . It was such a strange way of putting it. Is anything likely to\r\nhappen?\n\nRank . Nothing but what I have long been prepared for. But I certainly\r\ndidn't expect it to happen so soon.\n\nNora ( gripping him by the arm ). What have you found out? Doctor\r\nRank, you must tell me.\n\nRank ( sitting down by the stove ). It is all up with me. And it can't\r\nbe helped.\n\nNora ( with a sigh of relief ). Is it about yourself?\n\nRank . Who else? It is no use lying to one's self. I am the most\r\nwretched of all my patients, Mrs. Helmer. Lately I have been taking\r\nstock of my internal economy. Bankrupt! Probably within a month I shall\r\nlie rotting in the church-yard.\n\nNora . What an ugly thing to say!\n\nRank . The thing itself is cursedly ugly, and the worst of it is that I\r\nshall have to face so much more that is ugly before that. I shall only\r\nmake one more examination of myself; when I have done that, I shall know\r\npretty certainly when it will be that the horrors of dissolution will\r\nbegin. There is something I want to tell you. Helmer's refined nature\r\ngives him an unconquerable disgust of everything that is ugly; I won't\r\nhave him in my sick-room.\n\nNora . Oh, but, Doctor Rank—\n\nRank . I won't have him there. Not on any account. I bar my door to\r\nhim. As soon as I am quite certain that the worst has come, I shall send\r\nyou my card with a black cross on it, and then you will know that the\r\nloathsome end has begun.\n\nNora . You are quite absurd to-day. And I wanted you so much to be in a\r\nreally good humour.\n\nRank . With death stalking beside me?—To have to pay this penalty for\r\nanother man's sin! Is there any justice in that? And in every single\r\nfamily, in one way or another, some such inexorable retribution is being\r\nexacted—\n\nNora ( putting her hands over her ears ). Rubbish! Do talk of\r\nsomething cheerful.\n\nRank . Oh, it's a mere laughing matter, the whole thing. My poor\r\ninnocent spine has to suffer for my father's youthful amusements.\n\nNora ( sitting at the table on the left ). I suppose you mean that he\r\nwas too partial to asparagus and pate de foie gras, don't you?\n\nRank . Yes, and to truffles.\n\nNora . Truffles, yes. And oysters too, I suppose?\n\nRank . Oysters, of course, that goes without saying.\n\nNora . And heaps of port and champagne. It is sad that all these nice\r\nthings should take their revenge on our bones.\n\nRank . Especially that they should revenge themselves on the unlucky\r\nbones of those who have not had the satisfaction of enjoying them.\n\nNora . Yes, that's the saddest part of it all.\n\nRank ( with a searching look at her ). Hm!—\n\nNora ( after a short pause ). Why did you smile?\n\nRand . No, it was you that laughed.\n\nNora . No, it was you that smiled, Doctor Rank!\n\nRank ( rising ). You are a greater rascal than I thought.\n\nNora . I am in a silly mood today.\n\nRank . So it seems.\n\nNora ( putting her hands on his shoulders ). Dear, dear Doctor Rank,\r\ndeath mustn't take you away from Torvald and me.\n\nRank . It is a loss you would easily recover from. Those who are gone\r\nare soon forgotten.\n\nNora ( looking at him anxiously ). Do you believe that?\n\nRank . People form new ties, and then—\n\nNora . Who will form new ties?\n\nRank . Both you and Helmer, when I am gone. You yourself are already on\r\nthe high road to it, I think. What did that Mrs. Linde want here last\r\nnight?\n\nNora . Oho!—you don't mean to say you are jealous of poor Christine?\n\nRank . Yes, I am. She will be my successor in this house. When I am\r\ndone for, this woman will—\n\nNora . Hush! don't speak so loud. She is in that room.\n\nRank . To-day again. There, you see.\n\nNora . She has only come to sew my dress for me. Bless my soul, how\r\nunreasonable you are! ( Sits down on the sofa .) Be nice now, Doctor\r\nRank, and to-morrow you will see how beautifully I shall dance, and you\r\ncan imagine I am doing it all for you—and for Torvald too, of course.\r\n( Takes various things out of the box. ) Doctor Rank, come and sit down\r\nhere, and I will show you something.\n\nRank ( sitting down ). What is it?\n\nNora . Just look at those.\n\nRank . Silk stockings.\n\nNora . Flesh-coloured. Aren't they lovely? It is so dark here now, but\r\nto-morrow—. No, no, no! you must only look at the feet. Oh, well, you\r\nmay have leave to look at the legs too.\n\nRank . Hm!—\n\nNora . Why are you looking so critical? Don't you think they will fit\r\nme?\n\nRank . I have no means of forming an opinion about that.\n\nNora ( looks at him for a moment ). For shame! ( Hits him lightly on\r\nthe ear with the stockings .) That's to punish you. ( Folds them up\r\nagain .)\n\nRank . And what other nice things am I to be allowed to see?\n\nNora . Not a single thing more, for being so naughty. ( She looks among\r\nthe things, humming to herself .)\n\nRank ( after a short silence ). When I am sitting here, talking to you\r\nas intimately as this, I cannot imagine for a moment what would have\r\nbecome of me if I had never come into this house.\n\nNora ( smiling ). I believe you do feel thoroughly at home with us.\n\nRank ( in a lower voice, looking straight in front of him ). And to be\r\nobliged to leave it all—\n\nNora . Nonsense, you are not going to leave it.\n\nRank ( as before ). And not be able to leave behind one the slightest\r\ntoken of one's gratitude, scarcely even a fleeting regret—nothing but\r\nan empty place which the first comer can fill as well as any other.\n\nNora . And if I asked you now for a—? No!\n\nRank . For what?\n\nNora . For a big proof of your friendship—\n\nRank . Yes, yes.\n\nNora . I mean a tremendously big favour—\n\nRank . Would you really make me so happy for once?\n\nNora . Ah, but you don't know what it is yet.\n\nRank . No—but tell me.\n\nNora . I really can't, Doctor Rank. It is something out of all reason;\r\nit means advice, and help, and a favour—\n\nRank . The bigger a thing it is the better. I can't conceive what it is\r\nyou mean. Do tell me. Haven't I your confidence?\n\nNora . More than anyone else. I know you are my truest and best friend,\r\nand so I will tell you what it is. Well, Doctor Rank, it is something\r\nyou must help me to prevent. You know how devotedly, how inexpressibly\r\ndeeply Torvald loves me; he would never for a moment hesitate to give\r\nhis life for me.\n\nRank ( leaning toward her ). Nora—do you think he is the only one—?\n\nNora ( with a slight start ). The only one—?\n\nRank . The only one who would gladly give his life for your sake.\n\nNora ( sadly ). Is that it?\n\nRank . I was determined you should know it before I went away, and\r\nthere will never be a better opportunity than this. Now you know it,\r\nNora. And now you know, too, that you can trust me as you would trust no\r\none else.\n\nNora ( rises deliberately and quietly ). Let me pass.\n\nRank ( makes room for her to pass him, but sits still ). Nora!\n\nNora ( at the hall door ). Helen, bring in the lamp. ( Goes over to\r\nthe stove .) Dear Doctor Rank, that was really horrid of you.\n\nRank . To have loved you as much as anyone else does? Was that horrid?\n\nNora . No, but to go and tell me so. There was really no need—\n\nRank . What do you mean? Did you know—? (MAID enters with lamp, puts\r\nit down on the table, and goes out .) Nora—Mrs. Helmer—tell me, had\r\nyou any idea of this?\n\nNora . Oh, how do I know whether I had or whether I hadn't. I really\r\ncan't tell you—To think you could be so clumsy, Doctor Rank! We were\r\ngetting on so nicely.\n\nBank . Well, at all events you know now that you can command me, body\r\nand soul. So won't you speak out?\n\nNora ( looking at him ). After what happened?\n\nRank . I beg you to let me know what it is.\n\nNora . I can't tell you anything now.\n\nRank . Yes, yes. You mustn't punish me in that way. Let me have\r\npermission to do for you whatever a man may do.\n\nNora . You can do nothing for me now. Besides, I really don't need any\r\nhelp at all. You will find that the whole thing is merely fancy on my\r\npart. It really is so—of course it is! ( Sits down in the\r\nrocking-chair, and looks at him with a smile .) You are a nice sort of\r\nman, Doctor Rank!—don't you feel ashamed of yourself, now the lamp has\r\ncome?\n\nRank . Not a bit. But perhaps I had better go—forever?\n\nNora . No, indeed, you shall not. Of course you must come here just as\r\nbefore. You know very well Torvald can't do without you.\n\nRank . Yes, but you?\n\nNora . Oh, I am always tremendously pleased when you come.\n\nRank . It is just that, that put me on the wrong track. You are a\r\nriddle to me. I have often thought that you would almost as soon be in\r\nmy company as in Helmer's.\n\nNora . Yes—you see there are some people one loves best, and others\r\nwhom one would almost always rather have as companions.\n\nRank . Yes, there is something in that.\n\nNora . When I was at home, of course I loved papa best. But I always\r\nthought it tremendous fun if I could steal down into the maids' room,\r\nbecause they never moralized at all, and talked to each other about such\r\nentertaining things.\n\nRank . I see—it is their place I have taken.\n\nNora ( jumping-up and going to him ). Oh, dear, nice Doctor Rank, I\r\nnever meant that at all. But surely you can understand that being with\r\nTorvald is a little like being with papa—( Enter MAID from the hall .)\n\nMaid . If you please, ma'am. ( Whispers and hands her a card .)\n\nNora ( glancing at the card ). Oh! ( Puts it in her pocket .)\n\nRank . Is there anything wrong?\n\nNora . No, no, not in the least. It is only something—It is my new\r\ndress—\n\nRank . What? Your dress is lying there.\n\nNora . Oh, yes, that one; but this is another. I ordered it. Torvald\r\nmustn't know about it—\n\nRank . Oho! Then that was the great secret.\n\nNora . Of course. Just go in to him; he is sitting in the inner room.\r\nKeep him as long as—\n\nRank . Make your mind easy; I won't let him escape. ( Goes into HELMER'S room .)\n\nNora ( to the MAID). And he is standing waiting in the kitchen?\n\nMaid . Yes; he came up the back stairs.\n\nNora . But didn't you tell him no one was in?\n\nMaid . Yes, but it was no good.\n\nNora . He won't go away?\n\nMaid . No; he says he won't until he has seen you, ma'am.\n\nNora . Well, let him come in—but quietly. Helen, you mustn't say\r\nanything about it to any one. It is a surprise for my husband.\n\nMaid . Yes, ma'am, I quite understand. ( Exit .)\n\nNora . This dreadful thing is going to happen. It will happen in spite\r\nof me! No, no, no, it can't happen—it shan't happen! ( She bolts the\r\ndoor of HELMER'S room. The MAID opens the hall door for KROGSTAD and shuts it after him. He is wearing a fur coat, high boots and a fur\r\ncap .)\n\nNora ( advancing towards him ). Speak low—my husband is at home.\n\nKrogstad . No matter about that.\n\nNora . What do you want of me?\n\nKrogstad . An explanation of something.\n\nNora . Make haste then. What is it?\n\nKrogstad . You know, I suppose, that I have got my dismissal.\n\nNora . I couldn't prevent it, Mr. Krogstad. I fought as hard as I could\r\non your side, but it was no good.\n\nKrogstad . Does your husband love you so little, then? He knows what I\r\ncan expose you to, and yet he ventures—\n\nNora . How can you suppose that he has any knowledge of the sort?\n\nKrogstad . I didn't suppose so at all. It would not be the least like\r\nour dear Torvald Helmer to show so much courage—\n\nNora . Mr. Krogstad, a little respect for my husband, please.\n\nKrogstad . Certainly—all the respect he deserves. But since you have\r\nkept the matter so carefully to yourself, I make bold to suppose that\r\nyou have a little clearer idea than you had yesterday, of what it\r\nactually is that you have done?\n\nNora . More than you could ever teach me.\n\nKrogstad . Yes, such a bad lawyer as I am.\n\nNora . What is it you want of me?\n\nKrogstad . Only to see how you were, Mrs. Helmer. I have been thinking\r\nabout you all day long. A mere cashier—a quill-driver, a—well, a man\r\nlike me—even he has a little of what is called feeling, you know.\n\nNora . Show it, then; think of my little children.\n\nKrogstad . Have you and your husband thought of mine? But never mind\r\nabout that. I only wanted to tell you that you need not take this matter\r\ntoo seriously. In the first place there will be no accusation made on my\r\npart.\n\nNora . No, of course not; I was sure of that.\n\nKrogstad . The whole thing can be arranged amicably; there is no reason\r\nwhy anyone should know anything about it. It will remain a secret\r\nbetween us three.\n\nNora . My husband must never get to know anything about it.\n\nKrogstad . How will you be able to prevent it? Am I to understand that\r\nyou can pay the balance that is owing?\n\nNora . No, not just at present.\n\nKrogstad . Or perhaps that you have some expedient for raising the\r\nmoney soon?\n\nNora . No expedient that I mean to make use of.\n\nKrogstad . Well, in any case, it would have been of no use to you now.\r\nIf you stood there with ever so much money in your hand, I would never\r\npart with your bond.\n\nNora . Tell me what purpose you mean to put it to.\n\nKrogstad . I shall only preserve it—keep it in my possession. No one\r\nwho is not concerned in the matter shall have the slightest hint of it.\r\nSo that if the thought of it has driven you to any desperate\r\nresolution—\n\nNora . It has.\n\nKrogstad . If you had it in your mind to run away from your home—\n\nNora . I had.\n\nKrogstad . Or even something worse—\n\nNora . How could you know that?\n\nKrogstad . Give up the idea.\n\nNora . How did you know I had thought of that?\n\nKrogstad . Most of us think of that at first. I did, too—but I hadn't\r\nthe courage.\n\nNora ( faintly ). No more had I.\n\nKrogstad ( in a tone of relief) . No, that's it, isn't it—you hadn't\r\nthe courage either?\n\nNora . No, I haven't—I haven't.\n\nKrogstad . Besides, it would have been a great piece of folly. Once the\r\nfirst storm at home is over—. I have a letter for your husband in my\r\npocket.\n\nNora . Telling him everything?\n\nKrogstad . In as lenient a manner as I possibly could.\n\nNora ( quickly) . He mustn't get the letter. Tear it up. I will find\r\nsome means of getting money.\n\nKrogstad . Excuse me, Mrs. Helmer, but I think I told you just how—\n\nNora . I am not speaking of what I owe you. Tell me what sum you are\r\nasking my husband for, and I will get the money.\n\nKrogstad . I am not asking your husband for a penny.\n\nNora . What do you want, then?\n\nKrogstad . I will tell you. I want to rehabilitate myself, Mrs. Helmer;\r\nI want to get on; and in that your husband must help me. For the last\r\nyear and a half I have not had a hand in anything dishonourable, and all\r\nthat time I have been struggling in most restricted circumstances. I was\r\ncontent to work my way up step by step. Now I am turned out, and I am\r\nnot going to be satisfied with merely being taken into favour again. I\r\nwant to get on, I tell you. I want to get into the Bank again, in a\r\nhigher position. Your husband must make a place for me—\n\nNora . That he will never do!\n\nKrogstad . He will; I know him; he dare not protest. And as soon as I\r\nam in there again with him, then you will see! Within a year I shall be\r\nthe manager's right hand. It will be Nils Krogstad and not Torvald\r\nHelmer who manages the Bank.\n\nNora . That's a thing you will never see!\n\nKrogstad . Do you mean that you will—?\n\nNora . I have courage enough for it now.\n\nKrogstad . Oh, you can't frighten me. A fine, spoilt lady like you—\n\nNora . You will see, you will see.\n\nKrogstad . Under the ice, perhaps? Down into the cold, coal-black\r\nwater? And then, in the spring, to float up to the surface, all horrible\r\nand unrecognizable, with your hair fallen out—\n\nNora . You can't frighten me.\n\nKrogstad . Nor you me. People don't do such things, Mrs. Helmer.\r\nBesides, what use would it be? I should have him completely in my power\r\nall the same.\n\nNora . Afterwards? When I am no longer—\n\nKrogstad . Have you forgot that it is I who have the keeping of your\r\nreputation? ( Nora stands speechlessly looking at him.) Well, now, I\r\nhave warned you. Do not do anything foolish. When Helmer has had my\r\nletter, I shall expect a message from him. And be sure you remember that\r\nit is your husband himself who has forced me into such ways as this\r\nagain. I will never forgive him for that. Good-bye, Mrs. Helmer. ( Exit\r\nthrough the hall.)\n\nNora ( goes to the hall door, opens it slightly and listens ). He is\r\ngoing. He is not putting the letter in the box. Oh, no, no, that's\r\nimpossible! ( Opens the door by degrees. ) What is that? He is standing\r\noutside. He is not going downstairs. Is he hesitating? Can he—? ( A\r\nletter drops into the box; then KROGSTAD'S footsteps are heard, till\r\nthey die away as he goes downstairs. NORA utters a stifled cry, and\r\nruns across the room to the table by the sofa. A short pause .)\n\nNora . In the letter-box. ( Steals across to the hall-door .) There it\r\nlies—Torvald, Torvald, there is no hope for us now!\n\n(MRS. LINDE comes in from the room on the left, carrying the dress .)\n\nMrs. Linde . There, I can't see anything more to mend now. Would you\r\nlike to try it on—?\n\nNora ( in a hoarse whisper ). Christine, come here.\n\nMrs. Linde ( throwing the dress down on the sofa ). What is the matter\r\nwith you? You look so agitated!\n\nNora . Come here. Do you see that letter? There, look—you can see it\r\nthrough the glass in the letter-box.\n\nMrs. Linde . Yes, I see it.\n\nNora . That letter is from Krogstad.\n\nMrs. Linde . Nora—it was Krogstad who lent you the money!\n\nNora . Yes, and now Torvald will know all about it.\n\nMrs. Linde . Believe me, Nora, that's the best thing for both of you.\n\nNora . You don't know all. I forged a name.\n\nMrs. Linde . Good heavens—!\n\nNora . I only want to say this to you, Christine—you",
      "summary": "This chunk continues Act II, focusing on Nora's increasing anxiety about her secret. She interacts with various characters, including Mrs. Linde, Dr. Rank, and Krogstad. The tension builds as Krogstad threatens to reveal Nora's forgery to her husband, Torvald. Nora becomes increasingly desperate, considering drastic measures. The scene ends with Krogstad leaving a letter for Torvald that will expose Nora's actions, leaving her in a state of panic.",
      "prominence": 95,
      "key_characters": [
        {
          "name": "Nora Helmer",
          "description": "The protagonist, wife of Torvald, struggling with a secret from her past.",
          "summary": "Nora's anxiety intensifies as she faces the threat of her forgery being exposed. She considers desperate measures and tries to maintain composure while interacting with others."
        },
        {
          "name": "Krogstad",
          "description": "A man from Nora's past who knows her secret and is using it to blackmail her.",
          "summary": "Krogstad confronts Nora, threatening to expose her forgery unless she helps him keep his position at the bank. He ultimately leaves a letter for Torvald revealing the truth."
        },
        {
          "name": "Torvald Helmer",
          "description": "Nora's husband, unaware of her secret.",
          "summary": "Torvald interacts with Nora, oblivious to her inner turmoil. He dismisses Krogstad from the bank, inadvertently escalating the situation."
        },
        {
          "name": "Dr. Rank",
          "description": "A close friend of the Helmers who harbors feelings for Nora.",
          "summary": "Dr. Rank reveals his terminal illness to Nora and confesses his love for her, adding to her emotional burden."
        },
        {
          "name": "Mrs. Linde",
          "description": "Nora's old friend who has come to help her.",
          "summary": "Mrs. Linde provides support to Nora and becomes aware of the gravity of her situation."
        }
      ],
      "chapter": "Act II",
      "conversation": [
        {
          "scenario": "Nora is in her living room, increasingly anxious about Krogstad's threats. Krogstad arrives to confront her about his dismissal from the bank.",
          "topic": "Krogstad's blackmail and Nora's desperate situation",
          "key_characters": [
            {
              "name": "Nora Helmer",
              "thought": "[I'm terrified of what Krogstad might do. I must find a way to prevent him from ruining everything.]"
            },
            {
              "name": "Krogstad",
              "thought": "[I need to use Nora's secret to secure my position. I can't afford to lose everything.]"
            }
          ],
          "dialogues": [
            {
              "character": "Environment",
              "message": "The living room of the Helmer's house. The atmosphere is tense as Krogstad enters, his presence unwelcome and threatening."
            },
            {
              "character": "Nora",
              "message": "[I must stay calm and not show my fear.] Speak low—my husband is at home."
            },
            {
              "character": "Krogstad",
              "message": "[She's clearly frightened. Good.] No matter about that."
            },
            {
              "character": "Nora",
              "message": "[What could he want now? I need to get this over with quickly.] What do you want of me?"
            },
            {
              "character": "Krogstad",
              "message": "[I'll get straight to the point.] An explanation of something."
            },
            {
              "character": "Nora",
              "message": "[I can't let this drag on.] Make haste then. What is it?"
            },
            {
              "character": "Krogstad",
              "message": "[She needs to understand the gravity of the situation.] You know, I suppose, that I have got my dismissal."
            },
            {
              "character": "Nora",
              "message": "[I need to make him understand it wasn't my fault.] I couldn't prevent it, Mr. Krogstad. I fought as hard as I could on your side, but it was no good."
            },
            {
              "character": "Krogstad",
              "message": "[She's either naive or playing dumb.] Does your husband love you so little, then? He knows what I can expose you to, and yet he ventures—"
            },
            {
              "character": "Nora",
              "message": "[I can't let him think Torvald knows.] How can you suppose that he has any knowledge of the sort?"
            },
            {
              "character": "Krogstad",
              "message": "[So, Helmer doesn't know. This could work in my favor.] I didn't suppose so at all. It would not be the least like our dear Torvald Helmer to show so much courage—"
            },
            {
              "character": "Nora",
              "message": "[I won't let him insult Torvald.] Mr. Krogstad, a little respect for my husband, please."
            },
            {
              "character": "Krogstad",
              "message": "[I'll play along for now.] Certainly—all the respect he deserves. But since you have kept the matter so carefully to yourself, I make bold to suppose that you have a little clearer idea than you had yesterday, of what it actually is that you have done?"
            },
            {
              "character": "Nora",
              "message": "[I won't let him patronize me.] More than you could ever teach me."
            },
            {
              "character": "Krogstad",
              "message": "[She's putting on a brave face, but I can see through it.] Yes, such a bad lawyer as I am."
            },
            {
              "character": "Nora",
              "message": "[I need to end this conversation.] What is it you want of me?"
            },
            {
              "character": "Krogstad",
              "message": "[Time to show a bit of humanity, it might work in my favor.] Only to see how you were, Mrs. Helmer. I have been thinking about you all day long. A mere cashier—a quill-driver, a—well, a man like me—even he has a little of what is called feeling, you know."
            },
            {
              "character": "Nora",
              "message": "[I'll appeal to his compassion.] Show it, then; think of my little children."
            },
            {
              "character": "Krogstad",
              "message": "[Two can play at that game.] Have you and your husband thought of mine? But never mind about that. I only wanted to tell you that you need not take this matter too seriously. In the first place there will be no accusation made on my part."
            },
            {
              "character": "Nora",
              "message": "[Is he really backing down? I can't trust him.] No, of course not; I was sure of that."
            },
            {
              "character": "Krogstad",
              "message": "[Now to lay out my terms.] The whole thing can be arranged amicably; there is no reason why anyone should know anything about it. It will remain a secret between us three."
            },
            {
              "character": "Nora",
              "message": "[I must protect Torvald at all costs.] My husband must never get to know anything about it."
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": " must be my witness.\n\nMrs. Linde . Your witness! What do you mean? What am I to—?\n\nNora . If I should go out of my mind—and it might easily happen—\n\nMrs. Linde . Nora!",
      "summary": "This chunk continues Act II and begins Act III. The tension escalates as Nora's secret threatens to be exposed. Krogstad leaves a letter for Torvald revealing Nora's forgery. Nora becomes increasingly desperate and considers drastic measures. The scene ends with Torvald discovering the letter and confronting Nora.",
      "prominence": 95,
      "key_characters": [
        {
          "name": "Nora Helmer",
          "description": "The protagonist, wife of Torvald, struggling with a secret from her past.",
          "summary": "Nora's anxiety intensifies as she faces the imminent exposure of her forgery. She becomes increasingly desperate, considering suicide, and tries to delay Torvald from reading Krogstad's letter."
        },
        {
          "name": "Torvald Helmer",
          "description": "Nora's husband, unaware of her secret until the end of the chunk.",
          "summary": "Torvald remains oblivious to Nora's inner turmoil for most of the scene. He discovers Krogstad's letter at the end and confronts Nora about its contents."
        },
        {
          "name": "Dr. Rank",
          "description": "A close friend of the Helmers who harbors feelings for Nora.",
          "summary": "Dr. Rank visits the Helmers and subtly indicates his impending death through his calling cards. His imminent demise adds to the emotional tension of the scene."
        },
        {
          "name": "Mrs. Linde",
          "description": "Nora's old friend who has come to help her.",
          "summary": "Mrs. Linde tries to convince Nora to tell Torvald the truth about her forgery. She also reconciles with Krogstad, potentially changing the course of events."
        },
        {
          "name": "Krogstad",
          "description": "A man from Nora's past who knows her secret and is using it to blackmail her.",
          "summary": "Krogstad leaves a letter for Torvald revealing Nora's forgery. He reconciles with Mrs. Linde, which may influence his future actions."
        }
      ],
      "chapter": "Act II",
      "conversation": [
        {
          "scenario": "Nora and Torvald return home from a party. Nora is anxious about Krogstad's letter in the mailbox, while Torvald is oblivious to her distress.",
          "topic": "Nora's desperate attempts to distract Torvald from reading the mail",
          "key_characters": [
            {
              "name": "Nora Helmer",
              "thought": "[I must prevent Torvald from reading that letter at all costs. My entire world is about to crumble.]"
            },
            {
              "name": "Torvald Helmer",
              "thought": "[What a wonderful evening we've had. Nora was the belle of the ball, and I'm so proud of her.]"
            }
          ],
          "dialogues": [
            {
              "character": "Environment",
              "message": "The Helmers' living room, late at night after a party. The atmosphere is tense, with Nora's anxiety palpable in contrast to Torvald's cheerful mood."
            },
            {
              "character": "Nora",
              "message": "[I must keep him away from that letterbox.] Don't go to the letterbox, Torvald!"
            },
            {
              "character": "Torvald",
              "message": "[Why is she so concerned about the mail?] Why not?"
            },
            {
              "character": "Nora",
              "message": "[I need to think of an excuse, quickly.] Torvald, please don't. There is nothing there."
            },
            {
              "character": "Torvald",
              "message": "[Her behavior is peculiar. I'll humor her for now.] Well, let me look. (Turns to go to the letter-box. NORA, at the piano, plays the first bars of the Tarantella. TORVALD stops in the doorway.) Aha!"
            },
            {
              "character": "Nora",
              "message": "[Music might distract him.] I can't dance tomorrow if I don't practice with you."
            },
            {
              "character": "Torvald",
              "message": "[She's so eager to practice. How charming.] (going up to her) Are you really so afraid of it, dear?"
            },
            {
              "character": "Nora",
              "message": "[I must convince him to help me practice now.] Yes, so dreadfully afraid of it. Let me practice at once; there is time now, before we go to dinner. Sit down and play for me, Torvald dear; criticise me, and correct me as you play."
            },
            {
              "character": "Torvald",
              "message": "[Her enthusiasm is contagious.] With great pleasure, if you wish me to. (Sits down at the piano.)"
            },
            {
              "character": "Nora",
              "message": "[I need to keep this going as long as possible.] (takes out of the box a tambourine and a long variegated shawl. She hastily drapes the shawl round her. Then she springs to the front of the stage and calls out) Now play for me! I am going to dance!"
            },
            {
              "character": "Torvald",
              "message": "[She's dancing so frantically. Is something wrong?] (after playing a little) Slower, slower!"
            },
            {
              "character": "Nora",
              "message": "[I must keep dancing, no matter how tired I am.] I can't do it any other way."
            },
            {
              "character": "Torvald",
              "message": "[She's not listening to me at all.] Not so violently, Nora!"
            },
            {
              "character": "Nora",
              "message": "[I can't stop now. I must keep his attention.] This is the way."
            },
            {
              "character": "Torvald",
              "message": "[This is not right at all.] (stops playing) No, no—that is not a bit right."
            }
          ]
        }
      ],
      "state": "finished"
    }
  ]
}