{
  "chapter_beginnings": [
    {
      "beginning_sentence": "The Indian Gentleman"
    },
    {
      "beginning_sentence": "The Diamond Mines Again"
    },
    {
      "beginning_sentence": "9"
    },
    {
      "beginning_sentence": "Melchisedec"
    }
  ],
  "plots": [
    {
      "text": "But it was a perilous thing for Ermengarde and Lottie to make pilgrimages to the attic. They could never be quite sure when Sara would be there, and they could scarcely ever be certain that Miss Amelia would not make a tour of inspection through the bedrooms after the pupils were supposed to be asleep. So their visits were rare ones, and Sara lived a strange and lonely life. It was a lonelier life when she was downstairs than when she was in her attic. She had no one to talk to; and when she was sent out on errands and walked through the streets, a forlorn little figure carrying a basket or a parcel, trying to hold her hat on when the wind was blowing, and feeling the water soak through her shoes when it was raining, she felt as if the crowds hurrying past her made her loneliness greater. When she had been the Princess Sara, driving through the streets in her brougham, or walking, attended by Mariette, the sight of her bright, eager little face and picturesque coats and hats had often caused people to look after her. A happy, beautifully cared for little girl naturally attracts attention. Shabby, poorly dressed children are not rare enough and pretty enough to make people turn around to look at them and smile. No one looked at Sara in these days, and no one seemed to see her as she hurried along the crowded pavements. She had begun to grow very fast, and, as she was dressed only in such clothes as the plainer remnants of her wardrobe would supply, she knew she looked very queer, indeed. All her valuable garments had been disposed of, and such as had been left for her use she was expected to wear so long as she could put them on at all. Sometimes, when she passed a shop window with a mirror in it, she almost laughed outright on catching a glimpse of herself, and sometimes her face went red and she bit her lip and turned away.\n\nIn the evening, when she passed houses whose windows were lighted up, she used to look into the warm rooms and amuse herself by imagining things about the people she saw sitting before the fires or about the tables. It always interested her to catch glimpses of rooms before the shutters were closed. There were several families in the square in which Miss Minchin lived, with which she had become quite familiar in a way of her own. The one she liked best she called the Large Family. She called it the Large Family not because the members of it were big- -for, indeed, most of them were little--but because there were so many of them. There were eight children in the Large Family, and a stout, rosy mother, and a stout, rosy father, and a stout, rosy grandmother, and any number of servants. The eight children were always either being taken out to walk or to ride in perambulators by comfortable nurses, or they were going to drive with their mamma, or they were flying to the door in the evening to meet their papa and kiss him and dance around him and drag off his overcoat and look in the pockets for packages, or they were crowding about the nursery windows and looking out and pushing each other and laughing--in fact, they were always doing something enjoyable and suited to the tastes of a large family. Sara was quite fond of them, and had given them names out of books--quite romantic names. She called them the Montmorencys when she did not call them the Large Family. The fat, fair baby with the lace cap was Ethelberta Beauchamp Montmorency; the next baby was Violet Cholmondeley Montmorency; the little boy who could just stagger and who had such round legs was Sydney Cecil Vivian Montmorency; and then came Lilian Evangeline Maud Marion, Rosalind Gladys, Guy Clarence, Veronica Eustacia, and Claude Harold Hector.\n\nOne evening a very funny thing happened--though, perhaps, in one sense it was not a funny thing at all.\n\nSeveral of the Montmorencys were evidently going to a children's party, and just as Sara was about to pass the door they were crossing the pavement to get into the carriage which was waiting for them. Veronica Eustacia and Rosalind Gladys, in white-lace frocks and lovely sashes, had just got in, and Guy Clarence, aged five, was following them. He was such a pretty fellow and had such rosy cheeks and blue eyes, and such a darling little round head covered with curls, that Sara forgot her basket and shabby cloak altogether--in fact, forgot everything but that she wanted to look at him for a moment. So she paused and looked.\n\nIt was Christmas time, and the Large Family had been hearing many stories about children who were poor and had no mammas and papas to fill their stockings and take them to the pantomime-- children who were, in fact, cold and thinly clad and hungry. In the stories, kind people--sometimes little boys and girls with tender hearts--invariably saw the poor children and gave them money or rich gifts, or took them home to beautiful dinners. Guy Clarence had been affected to tears that very afternoon by the reading of such a story, and he had burned with a desire to find such a poor child and give her a certain sixpence he possessed, and thus provide for her for life. An entire sixpence, he was sure, would mean affluence for evermore. As he crossed the strip of red carpet laid across the pavement from the door to the carriage, he had this very sixpence in the pocket of his very short man-o-war trousers; And just as Rosalind Gladys got into the vehicle and jumped on the seat in order to feel the cushions spring under her, he saw Sara standing on the wet pavement in her shabby frock and hat, with her old basket on her arm, looking at him hungrily.\n\nHe thought that her eyes looked hungry because she had perhaps had nothing to eat for a long time. He did not know that they looked so because she was hungry for the warm, merry life his home held and his rosy face spoke of, and that she had a hungry wish to snatch him in her arms and kiss him. He only knew that she had big eyes and a thin face and thin legs and a common basket and poor clothes. So he put his hand in his pocket and found his sixpence and walked up to her benignly.\n\n\"Here, poor little girl,\" he said. \"Here is a sixpence. I will give it to you.\"\n\nSara started, and all at once realized that she looked exactly like poor children she had seen, in her better days, waiting on the pavement to watch her as she got out of her brougham. And she had given them pennies many a time. Her face went red and then it went pale, and for a second she felt as if she could not take the dear little sixpence.\n\n\"Oh, no!\" she said. \"Oh, no, thank you; I mustn't take it, indeed!\"\n\nHer voice was so unlike an ordinary street child's voice and her manner was so like the manner of a well-bred little person that Veronica Eustacia (whose real name was Janet) and Rosalind Gladys (who was really called Nora) leaned forward to listen.\n\nBut Guy Clarence was not to be thwarted in his benevolence. He thrust the sixpence into her hand.\n\n\"Yes, you must take it, poor little girl!\" he insisted stoutly. \"You can buy things to eat with it. It is a whole sixpence!\"\n\nThere was something so honest and kind in his face, and he looked so likely to be heartbrokenly disappointed if she did not take it, that Sara knew she must not refuse him. To be as proud as that would be a cruel thing. So she actually put her pride in her pocket, though it must be admitted her cheeks burned.\n\n\"Thank you,\" she said. \"You are a kind, kind little darling thing.\" And as he scrambled joyfully into the carriage she went away, trying to smile, though she caught her breath quickly and her eyes were shining through a mist. She had known that she looked odd and shabby, but until now she had not known that she might be taken for a beggar.\n\nAs the Large Family's carriage drove away, the children inside it were talking with interested excitement.\n\n\"Oh, Donald,\" (this was Guy Clarence's name), Janet exclaimed alarmedly, \"why did you offer that little girl your sixpence? I'm sure she is not a beggar!\"\n\n\"She didn't speak like a beggar!\" cried Nora. \"And her face didn't really look like a beggar's face!\"\n\n\"Besides, she didn't beg,\" said Janet. \"I was so afraid she might be angry with you. You know, it makes people angry to be taken for beggars when they are not beggars.\"\n\n\"She wasn't angry,\" said Donald, a trifle dismayed, but still firm. \"She laughed a little, and she said I was a kind, kind little darling thing. And I was!\"--stoutly. \"It was my whole sixpence.\"\n\nJanet and Nora exchanged glances.\n\n\"A beggar girl would never have said that,\" decided Janet. \"She would have said, `Thank yer kindly, little gentleman-- thank yer, sir;' and perhaps she would have bobbed a curtsy.\"\n\nSara knew nothing about the fact, but from that time the Large Family was as profoundly interested in her as she was in it. Faces used to appear at the nursery windows when she passed, and many discussions concerning her were held round the fire.\n\n\"She is a kind of servant at the seminary,\" Janet said. \"I don't believe she belongs to anybody. I believe she is an orphan. But she is not a beggar, however shabby she looks.\"\n\nAnd afterward she was called by all of them, \"The-little-girl- who-is-not-a-beggar,\" which was, of course, rather a long name, and sounded very funny sometimes when the youngest ones said it in a hurry.\n\nSara managed to bore a hole in the sixpence and hung it on an old bit of narrow ribbon round her neck. Her affection for the Large Family increased--as, indeed, her affection for everything she could love increased. She grew fonder and fonder of Becky, and she used to look forward to the two mornings a week when she went into the schoolroom to give the little ones their French lesson. Her small pupils loved her, and strove with each other for the privilege of standing close to her and insinuating their small hands into hers. It fed her hungry heart to feel them nestling up to her. She made such friends with the sparrows that when she stood upon the table, put her head and shoulders out of the attic window, and chirped, she heard almost immediately a flutter of wings and answering twitters, and a little flock of dingy town birds appeared and alighted on the slates to talk to her and make much of the crumbs she scattered. With Melchisedec she had become so intimate that he actually brought Mrs. Melchisedec with him sometimes, and now and then one or two of his children. She used to talk to him, and, somehow, he looked quite as if he understood.\n\nThere had grown in her mind rather a strange feeling about Emily, who always sat and looked on at everything. It arose in one of her moments of great desolateness. She would have liked to believe or pretend to believe that Emily understood and sympathized with her. She did not like to own to herself that her only companion could feel and hear nothing. She used to put her in a chair sometimes and sit opposite to her on the old red footstool, and stare and pretend about her until her own eyes would grow large with something which was almost like fear-- particularly at night when everything was so still, when the only sound in the attic was the occasional sudden scurry and squeak of Melchisedec's family in the wall. One of her \"pretends\" was that Emily was a kind of good witch who could protect her. Sometimes, after she had stared at her until she was wrought up to the highest pitch of fancifulness, she would ask her questions and find herself ALMOST feeling as if she would presently answer. But she never did.\n\n\"As to answering, though,\" said Sara, trying to console herself, \"I don't answer very often. I never answer when I can help it. When people are insulting you, there is nothing so good for them as not to say a word--just to look at them and THINK. Miss Minchin turns pale with rage when I do it, Miss Amelia looks frightened, and so do the girls. When you will not fly into a passion people know you are stronger than they are, because you are strong enough to hold in your rage, and they are not, and they say stupid things they wish they hadn't said afterward. There's nothing so strong as rage, except what makes you hold it in--that's stronger. It's a good thing not to answer your enemies. I scarcely ever do. Perhaps Emily is more like me than I am like myself. Perhaps she would rather not answer her friends, even. She keeps it all in her heart.\"\n\nBut though she tried to satisfy herself with these arguments, she did not find it easy. When, after a long, hard day, in which she had been sent here and there, sometimes on long errands through wind and cold and rain, she came in wet and hungry, and was sent out again because nobody chose to remember that she was only a child, and that her slim legs might be tired and her small body might be chilled; when she had been given only harsh words and cold, slighting looks for thanks; when the cook had been vulgar and insolent; when Miss Minchin had been in her worst mood, and when she had seen the girls sneering among themselves at her shabbiness--then she was not always able to comfort her sore, proud, desolate heart with fancies when Emily merely sat upright in her old chair and stared.\n\nOne of these nights, when she came up to the attic cold and hungry, with a tempest raging in her young breast, Emily's stare seemed so vacant, her sawdust legs and arms so inexpressive, that Sara lost all control over herself. There was nobody but Emily-- no one in the world. And there she sat.\n\n\"I shall die presently,\" she said at first.\n\nEmily simply stared.\n\n\"I can't bear this,\" said the poor child, trembling. \"I know I shall die. I'm cold; I'm wet; I'm starving to death. I've walked a thousand miles today, and they have done nothing but scold me from morning until night. And because I could not find that last thing the cook sent me for, they would not give me any supper. Some men laughed at me because my old shoes made me slip down in the mud. I'm covered with mud now. And they laughed. Do you hear?\"\n\nShe looked at the staring glass eyes and complacent face, and suddenly a sort of heartbroken rage seized her. She lifted her little savage hand and knocked Emily off the chair, bursting into a passion of sobbing--Sara who never cried.\n\n\"You are nothing but a DOLL!\" she cried. \"Nothing but a doll-- doll--doll! You care for nothing. You are stuffed with sawdust. You never had a heart. Nothing could ever make you feel. You are a DOLL!\" Emily lay on the floor, with her legs ignominiously doubled up over her head, and a new flat place on the end of her nose; but she was calm, even dignified. Sara hid her face in her arms. The rats in the wall began to fight and bite each other and squeak and scramble. Melchisedec was chastising some of his family.\n\nSara's sobs gradually quieted themselves. It was so unlike her to break down that she was surprised at herself. After a while she raised her face and looked at Emily, who seemed to be gazing at her round the side of one angle, and, somehow, by this time actually with a kind of glassy-eyed sympathy. Sara bent and picked her up. Remorse overtook her. She even smiled at herself a very little smile.\n\n\"You can't help being a doll,\" she said with a resigned sigh, \"any more than Lavinia and Jessie can help not having any sense. We are not all made alike. Perhaps you do your sawdust best.\" And she kissed her and shook her clothes straight, and put her back upon her chair.\n\nShe had wished very much that some one would take the empty house next door. She wished it because of the attic window which was so near hers. It seemed as if it would be so nice to see it propped open someday and a head and shoulders rising out of the square aperture.\n\n\"If it looked a nice head,\" she thought, \"I might begin by saying, `Good morning,' and all sorts of things might happen. But, of course, it's not really likely that anyone but under servants would sleep there.\"\n\nOne morning, on turning the corner of the square after a visit to the grocer's, the butcher's, and the baker's, she saw, to her great delight, that during her rather prolonged absence, a van full of furniture had stopped before the next house, the front doors were thrown open, and men in shirt sleeves were going in and out carrying heavy packages and pieces of furniture.\n\n\"It's taken!\" she said. \"It really IS taken! Oh, I do hope a nice head will look out of the attic window!\"\n\nShe would almost have liked to join the group of loiterers who had stopped on the pavement to watch the things carried in. She had an idea that if she could see some of the furniture she could guess something about the people it belonged to.\n\n\"Miss Minchin's tables and chairs are just like her,\" she thought; \"I remember thinking that the first minute I saw her, even though I was so little. I told papa afterward, and he laughed and said it was true. I am sure the Large Family have fat, comfortable armchairs and sofas, and I can see that their red-flowery wallpaper is exactly like them. It's warm and cheerful and kind-looking and happy.\"\n\nShe was sent out for parsley to the greengrocer's later in the day, and when she came up the area steps her heart gave quite a quick beat of recognition. Several pieces of furniture had been set out of the van upon the pavement. There was a beautiful table of elaborately wrought teakwood, and some chairs, and a screen covered with rich Oriental embroidery. The sight of them gave her a weird, homesick feeling. She had seen things so like them in India. One of the things Miss Minchin had taken from her was a carved teakwood desk her father had sent her.\n\n\"They are beautiful things,\" she said; \"they look as if they ought to belong to a nice person. All the things look rather grand. I suppose it is a rich family.\"\n\nThe vans of furniture came and were unloaded and gave place to others all the day. Several times it so happened that Sara had an opportunity of seeing things carried in. It became plain that she had been right in guessing that the newcomers were people of large means. All the furniture was rich and beautiful, and a great deal of it was Oriental. Wonderful rugs and draperies and ornaments were taken from the vans, many pictures, and books enough for a library. Among other things there was a superb god Buddha in a splendid shrine.\n\n\"Someone in the family MUST have been in India,\" Sara thought. \"They have got used to Indian things and like them. I AM glad. I shall feel as if they were friends, even if a head never looks out of the attic window.\"\n\nWhen she was taking in the evening's milk for the cook (there was really no odd job she was not called upon to do), she saw something occur which made the situation more interesting than ever. The handsome, rosy man who was the father of the Large Family walked across the square in the most matter-of-fact manner, and ran up the steps of the next-door house. He ran up them as if he felt quite at home and expected to run up and down them many a time in the future. He stayed inside quite a long time, and several times came out and gave directions to the workmen, as if he had a right to do so. It was quite certain that he was in some intimate way connected with the newcomers and was acting for them.\n\n\"If the new people have children,\" Sara speculated, \"the Large Family children will be sure to come and play with them, and they MIGHT come up into the attic just for fun.\"\n\nAt night, after her work was done, Becky came in to see her fellow prisoner and bring her news.\n\n\"It's a' Nindian gentleman that's comin' to live next door, miss,\" she said. \"I don't know whether he's a black gentleman or not, but he's a Nindian one. He's very rich, an' he's ill, an' the gentleman of the Large Family is his lawyer. He's had a lot of trouble, an' it's made him ill an' low in his mind. He worships idols, miss. He's an 'eathen an' bows down to wood an' stone. I seen a' idol bein' carried in for him to worship. Somebody had oughter send him a trac'. You can get a trac' for a penny.\"\n\nSara laughed a little.\n\n\"I don't believe he worships that idol,\" she said; \"some people like to keep them to look at because they are interesting. My papa had a beautiful one, and he did not worship it.\"\n\nBut Becky was rather inclined to prefer to believe that the new neighbor was \"an 'eathen.\" It sounded so much more romantic than that he should merely be the ordinary kind of gentleman who went to church with a prayer book. She sat and talked long that night of what he would be like, of what his wife would be like if he had one, and of what his children would be like if they had children. Sara saw that privately she could not help hoping very much that they would all be black, and would wear turbans, and, above all, that--like their parent--they would all be \"'eathens.\"\n\n\"I never lived next door to no 'eathens, miss,\" she said; \"I should like to see what sort o' ways they'd have.\"\n\nIt was several weeks before her curiosity was satisfied, and then it was revealed that the new occupant had neither wife nor children. He was a solitary man with no family at all, and it was evident that he was shattered in health and unhappy in mind.\n\nA carriage drove up one day and stopped before the house. When the footman dismounted from the box and opened the door the gentleman who was the father of the Large Family got out first. After him there descended a nurse in uniform, then came down the steps two men-servants. They came to assist their master, who, when he was helped out of the carriage, proved to be a man with a haggard, distressed face, and a skeleton body wrapped in furs. He was carried up the steps, and the head of the Large Family went with him, looking very anxious. Shortly afterward a doctor's carriage arrived, and the doctor went in--plainly to take care of him.\n\n\"There is such a yellow gentleman next door, Sara,\" Lottie whispered at the French class afterward. \"Do you think he is a Chinee? The geography says the Chinee men are yellow.\"\n\n\"No, he is not Chinese,\" Sara whispered back; \"he is very ill. Go on with your exercise, Lottie. `Non, monsieur. Je n'ai pas le canif de mon oncle.'\"\n\nThat was the beginning of the story of the Indian gentleman.\n\n11\n\nRam Dass\n\nThere were fine sunsets even in the square, sometimes. One could only see parts of them, however, between the chimneys and over the roofs. From the kitchen windows one could not see them at all, and could only guess that they were going on because the bricks looked warm and the air rosy or yellow for a while, or perhaps one saw a blazing glow strike a particular pane of glass somewhere. There was, however, one place from which one could see all the splendor of them: the piles of red or gold clouds in the west; or the purple ones edged with dazzling brightness; or the little fleecy, floating ones, tinged with rose-color and looking like flights of pink doves scurrying across the blue in a great hurry if there was a wind. The place where one could see all this, and seem at the same time to breathe a purer air, was, of course, the attic window. When the square suddenly seemed to begin to glow in an enchanted way and look wonderful in spite of its sooty trees and railings, Sara knew something was going on in the sky; and when it was at all possible to leave the kitchen without being missed or called back, she invariably stole away and crept up the flights of stairs, and, climbing on the old table, got her head and body as far out of the window as possible. When she had accomplished this, she always drew a long breath and looked all round her. It used to seem as if she had all the sky and the world to herself. No one else ever looked out of the other attics. Generally the skylights were closed; but even if they were propped open to admit air, no one seemed to come near them. And there Sara would stand, sometimes turning her face upward to the blue which seemed so friendly and near-- just like a lovely vaulted ceiling--sometimes watching the west and all the wonderful things that happened there: the clouds melting or drifting or waiting softly to be changed pink or crimson or snow-white or purple or pale dove-gray. Sometimes they made islands or great mountains enclosing lakes of deep turquoise- blue, or liquid amber, or chrysoprase-green; sometimes dark headlands jutted into strange, lost seas; sometimes slender strips of wonderful lands joined other wonderful lands together. There were places where it seemed that one could run or climb or stand and wait to see what next was coming--until, perhaps, as it all melted, one could float away. At least it seemed so to Sara, and nothing had ever been quite so beautiful to her as the things she saw as she stood on the table--her body half out of the skylight--the sparrows twittering with sunset softness on the slates. The sparrows always seemed to her to twitter with a sort of subdued softness just when these marvels were going on.\n\nThere was such a sunset as this a few days after the Indian gentleman was brought to his new home; and, as it fortunately happened that the afternoon's work was done in the kitchen and nobody had ordered her to go anywhere or perform any task, Sara found it easier than usual to slip away and go upstairs.\n\nShe mounted her table and stood looking out. It was a wonderful moment. There were floods of molten gold covering the west, as if a glorious tide was sweeping over the world. A deep, rich yellow light filled the air; the birds flying across the tops of the houses showed quite black against it.\n\n\"It's a Splendid one,\" said Sara, softly, to herself. \"It makes me feel almost afraid--as if something strange was just going to happen. The Splendid ones always make me feel like that.\"\n\nShe suddenly turned her head because she heard a sound a few yards away from her. It was an odd sound like a queer little squeaky chattering. It came from the window of the next attic. Someone had come to look at the sunset as she had. There was a head and a part of a body emerging from the skylight, but it was not the head or body of a little girl or a housemaid; it was the picturesque white-swathed form and dark-faced, gleaming-eyed, white-turbaned head of a native Indian man-servant--\"a Lascar,\" Sara said to herself quickly--and the sound she had heard came from a small monkey he held in his arms as if he were fond of it, and which was snuggling and chattering against his breast.\n\nAs Sara looked toward him he looked toward her. The first thing she thought was that his dark face looked sorrowful and homesick. She felt absolutely sure he had come up to look at the sun, because he had seen it so seldom in England that he longed for a sight of it. She looked at him interestedly for a second, and then smiled across the slates. She had learned to know how comforting a smile, even from a stranger, may be.\n\nHers was evidently a pleasure to him. His whole expression altered, and he showed such gleaming white teeth as he smiled back that it was as if a light had been illuminated in his dusky face. The friendly look in Sara's eyes was always very effective when people felt tired or dull.\n\nIt was perhaps in making his salute to her that he loosened his hold on the monkey. He was an impish monkey and always ready for adventure, and it is probable that the sight of a little girl excited him. He suddenly broke loose, jumped on to the slates, ran across them chattering, and actually leaped on to Sara's shoulder, and from there down into her attic room. It made her laugh and delighted her; but she knew he must be restored to his master--if the Lascar was his master--and she wondered how this was to be done. Would he let her catch him, or would he be naughty and refuse to be caught, and perhaps get away and run off over the roofs and be lost? That would not do at all. Perhaps he belonged to the Indian gentleman, and the poor man was fond of him.\n\nShe turned to the Lascar, feeling glad that she remembered still some of the Hindustani she had learned when she lived with her father. She could make the man understand. She spoke to him in the language he knew.\n\n\"Will he let me catch him?\" she asked.\n\nShe thought she had never seen more surprise and delight than the dark face expressed when she spoke in the familiar tongue. The truth was that the poor fellow felt as if his gods had intervened, and the kind little voice came from heaven itself. At once Sara saw that he had been accustomed to European children. He poured forth a flood of respectful thanks. He was the servant of Missee Sahib. The monkey was a good monkey and would not bite; but, unfortunately, he was difficult to catch. He would flee from one spot to another, like the lightning. He was disobedient, though not evil. Ram Dass knew him as if he were his child, and Ram Dass he would sometimes obey, but not always. If Missee Sahib would permit Ram Dass, he himself could cross the roof to her room, enter the windows, and regain the unworthy little animal. But he was evidently afraid Sara might think he was taking a great liberty and perhaps would not let him come.\n\nBut Sara gave him leave at once.\n\n\"Can you get across?\" she inquired.\n\n\"In a moment,\" he answered her.\n\n\"Then come,\" she said; \"he is flying from side to side of the room as if he was frightened.\"\n\nRam Dass slipped through his attic window and crossed to hers as steadily and lightly as if he had walked on roofs all his life. He slipped through the skylight and dropped upon his feet without a sound. Then he turned to Sara and salaamed again. The monkey saw him and uttered a little scream. Ram Dass hastily took the precaution of shutting the skylight, and then went in chase of him. It was not a very long chase. The monkey prolonged it a few minutes evidently for the mere fun of it, but presently he sprang chattering on to Ram Dass's shoulder and sat there chattering and clinging to his neck with a weird little skinny arm.\n\nRam Dass thanked Sara profoundly. She had seen that his quick native eyes had taken in at a glance all the bare shabbiness of the room, but he spoke to her as if he were speaking to the little daughter of a rajah, and pretended that he observed nothing. He did not presume to remain more than a few moments after he had caught the monkey, and those moments were given to further deep and grateful obeisance to her in return for her indulgence. This little evil one, he said, stroking the monkey, was, in truth, not so evil as he seemed, and his master, who was ill, was sometimes amused by him. He would have been made sad if his favorite had run away and been lost. Then he salaamed once more and got through the skylight and across the slates again with as much agility as the monkey himself had displayed.\n\nWhen he had gone Sara stood in the middle of her attic and thought of many things his face and his manner had brought back to her. The sight of his native costume and the profound reverence of his manner stirred all her past memories. It seemed a strange thing to remember that she--the drudge whom the cook had said insulting things to an hour ago--had only a few years ago been surrounded by people who all treated her as Ram Dass had treated her; who salaamed when she went by, whose foreheads almost touched the ground when she spoke to them, who were her servants and her slaves. It was like a sort of dream. It was all over, and it could never come back. It certainly seemed that there was no way in which any change could take place. She knew what Miss Minchin intended that her future should be. So long as she was too young to be used as a regular teacher, she would be used as an errand girl and servant and yet expected to remember what she had learned and in some mysterious way to learn more. The greater number of her evenings she was supposed to spend at study, and at various indefinite intervals she was examined and knew she would have been severely admonished if she had not advanced as was expected of her. The truth, indeed, was that Miss Minchin knew that she was too anxious to learn to require teachers. Give her books, and she would devour them and end by knowing them by heart. She might be trusted to be equal to teaching a good deal in the course of a few years. This was what would happen: when she was older she would be expected to drudge in the schoolroom as she drudged now in various parts of the house; they would be obliged to give her more respectable clothes, but they would be sure to be plain and ugly and to make her look somehow like a servant. That was all there seemed to be to look forward to, and Sara stood quite still for several minutes and thought it over.\n\nThen a thought came back to her which made the color rise in her cheek and a spark light itself in her eyes. She straightened her thin little body and lifted her head.\n\n\"Whatever comes,\" she said, \"cannot alter one thing. If I am a princess in rags and tatters, I can be a princess inside. It would be easy to be a princess if I were dressed in",
      "summary": "Sara struggles with her lonely life as a servant at Miss Minchin's seminary. She observes a wealthy Indian gentleman moving in next door and befriends his servant, Ram Dass. This encounter reminds Sara of her past life in India and gives her hope for the future, despite her current circumstances.",
      "prominence": 90,
      "key_characters": [
        {
          "name": "Sara Crewe",
          "description": "A young girl who has fallen from wealth to poverty, now working as a servant at Miss Minchin's seminary.",
          "summary": "Sara maintains her dignity and imagination despite her hardships, finding solace in observing the world around her and clinging to her identity as a \"princess\"."
        },
        {
          "name": "Ram Dass",
          "description": "An Indian servant working for the new neighbor.",
          "summary": "Ram Dass interacts kindly with Sara, reminding her of her past life in India and treating her with respect despite her current status."
        },
        {
          "name": "Indian Gentleman",
          "description": "A wealthy but ill man who moves in next door to the seminary.",
          "summary": "Though not directly involved, his presence and connection to India spark Sara's memories and imagination."
        }
      ],
      "chapter": "The Indian Gentleman",
      "conversation": [
        {
          "scenario": "Sara is standing at her attic window, observing the sunset, when she notices Ram Dass and his monkey at the neighboring window.",
          "topic": "The unexpected encounter between Sara and Ram Dass",
          "key_characters": [
            {
              "name": "Sara Crewe",
              "thought": "I'm surprised to see someone else enjoying the sunset. He looks homesick and sad. Perhaps I can offer a friendly gesture."
            },
            {
              "name": "Ram Dass",
              "thought": "What a beautiful sunset. It reminds me of home. Oh, there's a little girl at the window. She seems kind."
            }
          ],
          "dialogues": [
            {
              "character": "Environment",
              "message": "The attic windows of two neighboring houses, bathed in the golden light of a beautiful sunset. A small monkey chatters and fidgets in Ram Dass's arms."
            },
            {
              "character": "Sara Crewe",
              "message": "[I wonder if he speaks English. Maybe I should try Hindustani.] (smiles warmly at Ram Dass)"
            },
            {
              "character": "Ram Dass",
              "message": "[The little miss is smiling at me. How kind of her.] (smiles back, revealing gleaming white teeth)"
            },
            {
              "character": "Environment",
              "message": "The monkey suddenly breaks free from Ram Dass's arms, leaps across to Sara's window, and into her attic room."
            },
            {
              "character": "Sara Crewe",
              "message": "[Oh my! I need to help catch the monkey.] (speaks in Hindustani) \"Will he let me catch him?\""
            },
            {
              "character": "Ram Dass",
              "message": "[By the gods, she speaks Hindustani!] (face lighting up with surprise and delight) \"Missee Sahib, you are most kind. The monkey is good but difficult to catch. May this humble servant enter to retrieve him?\""
            },
            {
              "character": "Sara Crewe",
              "message": "[He's so polite and respectful, just like in India.] \"Yes, please come. He's flying around the room.\""
            },
            {
              "character": "Ram Dass",
              "message": "[She's allowing me to enter. Such a gracious child.] (carefully crosses from his window to Sara's) \"Thank you, Missee Sahib.\""
            },
            {
              "character": "Environment",
              "message": "Ram Dass enters Sara's attic room and begins to chase the monkey, who evades capture for a few moments before jumping onto Ram Dass's shoulder."
            },
            {
              "character": "Ram Dass",
              "message": "[I must not overstay my welcome, but I'm in awe of this child's kindness and dignity.] (bowing deeply) \"Missee Sahib, I am forever grateful for your assistance and understanding. My master would have been most distressed to lose his little friend.\""
            },
            {
              "character": "Sara Crewe",
              "message": "[His gratitude is so sincere. It reminds me of how people used to treat me.] \"I'm glad I could help. Please take care crossing back.\""
            },
            {
              "character": "Ram Dass",
              "message": "[Such a remarkable child. She carries herself like royalty despite these poor surroundings.] (bows once more) \"May blessings be upon you, Missee Sahib.\" (carefully exits through the window)"
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "When one lives in a row of houses, it is interesting to think of the things which are being done and said on the other side of the wall of the very rooms one is living in. Sara was fond of amusing herself by trying to imagine the things hidden by the wall which divided the Select Seminary from the Indian gentleman's house. She knew that the schoolroom was next to the Indian gentleman's study, and she hoped that the wall was thick so that the noise made sometimes after lesson hours would not disturb him.\n\n\"I am growing quite fond of him,\" she said to Ermengarde; \"I should not like him to be disturbed. I have adopted him for a friend. You can do that with people you never speak to at all. You can just watch them, and think about them and be sorry for them, until they seem almost like relations. I'm quite anxious sometimes when I see the doctor call twice a day.\"\n\n\"I have very few relations,\" said Ermengarde, reflectively, \"and I'm very glad of it. I don't like those I have. My two aunts are always saying, `Dear me, Ermengarde! You are very fat. You shouldn't eat sweets,' and my uncle is always asking me things like, `When did Edward the Third ascend the throne?' and, `Who died of a surfeit of lampreys?'\"\n\nSara laughed.\n\n\"People you never speak to can't ask you questions like that,\" she said; \"and I'm sure the Indian gentleman wouldn't even if he was quite intimate with you. I am fond of him.\"\n\nShe had become fond of the Large Family because they looked happy; but she had become fond of the Indian gentleman because he looked unhappy. He had evidently not fully recovered from some very severe illness. In the kitchen--where, of course, the servants, through some mysterious means, knew everything--there was much discussion of his case. He was not an Indian gentleman really, but an Englishman who had lived in India. He had met with great misfortunes which had for a time so imperilled his whole fortune that he had thought himself ruined and disgraced forever. The shock had been so great that he had almost died of brain fever; and ever since he had been shattered in health, though his fortunes had changed and all his possessions had been restored to him. His trouble and peril had been connected with mines.\n\n\"And mines with diamonds in 'em!\" said the cook. \"No savin's of mine never goes into no mines--particular diamond ones\"-- with a side glance at Sara. \"We all know somethin' of THEM.\" \"He felt as my papa felt,\" Sara thought. \"He was ill as my papa was; but he did not die.\"\n\nSo her heart was more drawn to him than before. When she was sent out at night she used sometimes to feel quite glad, because there was always a chance that the curtains of the house next door might not yet be closed and she could look into the warm room and see her adopted friend. When no one was about she used sometimes to stop, and, holding to the iron railings, wish him good night as if he could hear her.\n\n\"Perhaps you can FEEL if you can't hear,\" was her fancy. \"Perhaps kind thoughts reach people somehow, even through windows and doors and walls. Perhaps you feel a little warm and comforted, and don't know why, when I am standing here in the cold and hoping you will get well and happy again. I am so sorry for you,\" she would whisper in an intense little voice. \"I wish you had a `Little Missus' who could pet you as I used to pet papa when he had a headache. I should like to be your `Little Missus' myself, poor dear! Good night--good night. God bless you!\"\n\nShe would go away, feeling quite comforted and a little warmer herself. Her sympathy was so strong that it seemed as if it MUST reach him somehow as he sat alone in his armchair by the fire, nearly always in a great dressing gown, and nearly always with his forehead resting in his hand as he gazed hopelessly into the fire. He looked to Sara like a man who had a trouble on his mind still, not merely like one whose troubles lay all in the past.\n\n\"He always seems as if he were thinking of something that hurts him NOW\", she said to herself, \"but he has got his money back and he will get over his brain fever in time, so he ought not to look like that. I wonder if there is something else.\"\n\nIf there was something else--something even servants did not hear of--she could not help believing that the father of the Large Family knew it--the gentleman she called Mr. Montmorency. Mr. Montmorency went to see him often, and Mrs. Montmorency and all the little Montmorencys went, too, though less often. He seemed particularly fond of the two elder little girls--the Janet and Nora who had been so alarmed when their small brother Donald had given Sara his sixpence. He had, in fact, a very tender place in his heart for all children, and particularly for little girls. Janet and Nora were as fond of him as he was of them, and looked forward with the greatest pleasure to the afternoons when they were allowed to cross the square and make their well-behaved little visits to him. They were extremely decorous little visits because he was an invalid.\n\n\"He is a poor thing,\" said Janet, \"and he says we cheer him up. We try to cheer him up very quietly.\"\n\nJanet was the head of the family, and kept the rest of it in order. It was she who decided when it was discreet to ask the Indian gentleman to tell stories about India, and it was she who saw when he was tired and it was the time to steal quietly away and tell Ram Dass to go to him. They were very fond of Ram Dass. He could have told any number of stories if he had been able to speak anything but Hindustani. The Indian gentleman's real name was Mr. Carrisford, and Janet told Mr. Carrisford about the encounter with the little-girl-who-was-not-a-beggar. He was very much interested, and all the more so when he heard from Ram Dass of the adventure of the monkey on the roof. Ram Dass made for him a very clear picture of the attic and its desolateness--of the bare floor and broken plaster, the rusty, empty grate, and the hard, narrow bed.\n\n\"Carmichael,\" he said to the father of the Large Family, after he had heard this description, \"I wonder how many of the attics in this square are like that one, and how many wretched little servant girls sleep on such beds, while I toss on my down pillows, loaded and harassed by wealth that is, most of it--not mine.\"\n\n\"My dear fellow,\" Mr. Carmichael answered cheerily, \"the sooner you cease tormenting yourself the better it will be for you. If you possessed all the wealth of all the Indies, you could not set right all the discomforts in the world, and if you began to refurnish all the attics in this square, there would still remain all the attics in all the other squares and streets to put in order. And there you are!\"\n\nMr. Carrisford sat and bit his nails as he looked into the glowing bed of coals in the grate.\n\n\"Do you suppose,\" he said slowly, after a pause--\"do you think it is possible that the other child--the child I never cease thinking of, I believe--could be--could POSSIBLY be reduced to any such condition as the poor little soul next door?\"\n\nMr. Carmichael looked at him uneasily. He knew that the worst thing the man could do for himself, for his reason and his health, was to begin to think in the particular way of this particular subject.\n\n\"If the child at Madame Pascal's school in Paris was the one you are in search of,\" he answered soothingly, \"she would seem to be in the hands of people who can afford to take care of her. They adopted her because she had been the favorite companion of their little daughter who died. They had no other children, and Madame Pascal said that they were extremely well-to-do Russians.\"\n\n\"And the wretched woman actually did not know where they had taken her!\" exclaimed Mr. Carrisford.\n\nMr. Carmichael shrugged his shoulders.\n\n\"She was a shrewd, worldly Frenchwoman, and was evidently only too glad to get the child so comfortably off her hands when the father's death left her totally unprovided for. Women of her type do not trouble themselves about the futures of children who might prove burdens. The adopted parents apparently disappeared and left no trace.\"\n\n\"But you say `IF the child was the one I am in search of. You say 'if.' We are not sure. There was a difference in the name.\"\n\n\"Madame Pascal pronounced it as if it were Carew instead of Crewe--but that might be merely a matter of pronunciation. The circumstances were curiously similar. An English officer in India had placed his motherless little girl at the school. He had died suddenly after losing his fortune.\" Mr. Carmichael paused a moment, as if a new thought had occurred to him. \"Are you SURE the child was left at a school in Paris? Are you sure it was Paris?\"\n\n\"My dear fellow,\" broke forth Carrisford, with restless bitterness, \"I am SURE of nothing. I never saw either the child or her mother. Ralph Crewe and I loved each other as boys, but we had not met since our school days, until we met in India. I was absorbed in the magnificent promise of the mines. He became absorbed, too. The whole thing was so huge and glittering that we half lost our heads. When we met we scarcely spoke of anything else. I only knew that the child had been sent to school somewhere. I do not even remember, now, HOW I knew it.\"\n\nHe was beginning to be excited. He always became excited when his still weakened brain was stirred by memories of the catastrophes of the past.\n\nMr. Carmichael watched him anxiously. It was necessary to ask some questions, but they must be put quietly and with caution.\n\n\"But you had reason to think the school WAS in Paris?\"\n\n\"Yes,\" was the answer, \"because her mother was a Frenchwoman, and I had heard that she wished her child to be educated in Paris. It seemed only likely that she would be there.\"\n\n\"Yes,\" Mr. Carmichael said, \"it seems more than probable.\"\n\nThe Indian gentleman leaned forward and struck the table with a long, wasted hand.\n\n\"Carmichael,\" he said, \"I MUST find her. If she is alive, she is somewhere. If she is friendless and penniless, it is through my fault. How is a man to get back his nerve with a thing like that on his mind? This sudden change of luck at the mines has made realities of all our most fantastic dreams, and poor Crewe's child may be begging in the street!\"\n\n\"No, no,\" said Carmichael. \"Try to be calm. Console yourself with the fact that when she is found you have a fortune to hand over to her.\"\n\n\"Why was I not man enough to stand my ground when things looked black?\" Carrisford groaned in petulant misery. \"I believe I should have stood my ground if I had not been responsible for other people's money as well as my own. Poor Crewe had put into the scheme every penny that he owned. He trusted me--he LOVED me. And he died thinking I had ruined him--I--Tom Carrisford, who played cricket at Eton with him. What a villain he must have thought me!\"\n\n\"Don't reproach yourself so bitterly.\"\n\n\"I don't reproach myself because the speculation threatened to fail--I reproach myself for losing my courage. I ran away like a swindler and a thief, because I could not face my best friend and tell him I had ruined him and his child.\"\n\nThe good-hearted father of the Large Family put his hand on his shoulder comfortingly.\n\n\"You ran away because your brain had given way under the strain of mental torture,\" he said. \"You were half delirious already. If you had not been you would have stayed and fought it out. You were in a hospital, strapped down in bed, raving with brain fever, two days after you left the place. Remember that.\"\n\nCarrisford dropped his forehead in his hands.\n\n\"Good God! Yes,\" he said. \"I was driven mad with dread and horror. I had not slept for weeks. The night I staggered out of my house all the air seemed full of hideous things mocking and mouthing at me.\"\n\n\"That is explanation enough in itself,\" said Mr. Carmichael. \"How could a man on the verge of brain fever judge sanely!\"\n\nCarrisford shook his drooping head.\n\n\"And when I returned to consciousness poor Crewe was dead--and buried. And I seemed to remember nothing. I did not remember the child for months and months. Even when I began to recall her existence everything seemed in a sort of haze.\"\n\nHe stopped a moment and rubbed his forehead. \"It sometimes seems so now when I try to remember. Surely I must sometime have heard Crewe speak of the school she was sent to. Don't you think so?\"\n\n\"He might not have spoken of it definitely. You never seem even to have heard her real name.\"\n\n\"He used to call her by an odd pet name he had invented. He called her his `Little Missus.' But the wretched mines drove everything else out of our heads. We talked of nothing else. If he spoke of the school, I forgot--I forgot. And now I shall never remember.\"\n\n\"Come, come,\" said Carmichael. \"We shall find her yet. We will continue to search for Madame Pascal's good-natured Russians. She seemed to have a vague idea that they lived in Moscow. We will take that as a clue. I will go to Moscow.\"\n\n\"If I were able to travel, I would go with you,\" said Carrisford; \"but I can only sit here wrapped in furs and stare at the fire. And when I look into it I seem to see Crewe's gay young face gazing back at me. He looks as if he were asking me a question. Sometimes I dream of him at night, and he always stands before me and asks the same question in words. Can you guess what he says, Carmichael?\"\n\nMr. Carmichael answered him in a rather low voice.\n\n\"Not exactly,\" he said.\n\n\"He always says, `Tom, old man--Tom--where is the Little Missus?'\" He caught at Carmichael's hand and clung to it. \"I must be able to answer him--I must!\" he said. \"Help me to find her. Help me.\"\n\nOn the other side of the wall Sara was sitting in her garret talking to Melchisedec, who had come out for his evening meal.\n\n\"It has been hard to be a princess today, Melchisedec,\" she said. \"It has been harder than usual. It gets harder as the weather grows colder and the streets get more sloppy. When Lavinia laughed at my muddy skirt as I passed her in the hall, I thought of something to say all in a flash--and I only just stopped myself in time. You can't sneer back at people like that- -if you are a princess. But you have to bite your tongue to hold yourself in. I bit mine. It was a cold afternoon, Melchisedec. And it's a cold night.\"\n\nQuite suddenly she put her black head down in her arms, as she often did when she was alone.\n\n\"Oh, papa,\" she whispered, \"what a long time it seems since I was your `Little Missus'!\"\n\nThis was what happened that day on both sides of the wall.\n\n13\n\nOne of the Populace\n\nThe winter was a wretched one. There were days on which Sara tramped through snow when she went on her errands; there were worse days when the snow melted and combined itself with mud to form slush; there were others when the fog was so thick that the lamps in the street were lighted all day and London looked as it had looked the afternoon, several years ago, when the cab had driven through the thoroughfares with Sara tucked up on its seat, leaning against her father's shoulder. On such days the windows of the house of the Large Family always looked delightfully cozy and alluring, and the study in which the Indian gentleman sat glowed with warmth and rich color. But the attic was dismal beyond words. There were no longer sunsets or sunrises to look at, and scarcely ever any stars, it seemed to Sara. The clouds hung low over the skylight and were either gray or mud-color, or dropping heavy rain. At four o'clock in the afternoon, even when there was no special fog, the daylight was at an end. If it was necessary to go to her attic for anything, Sara was obliged to light a candle. The women in the kitchen were depressed, and that made them more ill-tempered than ever. Becky was driven like a little slave.\n\n\"'Twarn't for you, miss,\" she said hoarsely to Sara one night when she had crept into the attic--\"'twarn't for you, an' the Bastille, an' bein' the prisoner in the next cell, I should die. That there does seem real now, doesn't it? The missus is more like the head jailer every day she lives. I can jest see them big keys you say she carries. The cook she's like one of the under-jailers. Tell me some more, please, miss--tell me about the subt'ranean passage we've dug under the walls.\"\n\n\"I'll tell you something warmer,\" shivered Sara. \"Get your coverlet and wrap it round you, and I'll get mine, and we will huddle close together on the bed, and I'll tell you about the tropical forest where the Indian gentleman's monkey used to live. When I see him sitting on the table near the window and looking out into the street with that mournful expression, I always feel sure he is thinking about the tropical forest where he used to swing by his tail from coconut trees. I wonder who caught him, and if he left a family behind who had depended on him for coconuts.\"\n\n\"That is warmer, miss,\" said Becky, gratefully; \"but, someways, even the Bastille is sort of heatin' when you gets to tellin' about it.\"\n\n\"That is because it makes you think of something else,\" said Sara, wrapping the coverlet round her until only her small dark face was to be seen looking out of it. \"I've noticed this. What you have to do with your mind, when your body is miserable, is to make it think of something else.\"\n\n\"Can you do it, miss?\" faltered Becky, regarding her with admiring eyes.\n\nSara knitted her brows a moment.\n\n\"Sometimes I can and sometimes I can't,\" she said stoutly. \"But when I CAN I'm all right. And what I believe is that we always could--if we practiced enough. I've been practicing a good deal lately, and it's beginning to be easier than it used to be. When things are horrible--just horrible--I think as hard as ever I can of being a princess. I say to myself, `I am a princess, and I am a fairy one, and because I am a fairy nothing can hurt me or make me uncomfortable.' You don't know how it makes you forget\"-- with a laugh.\n\nShe had many opportunities of making her mind think of something else, and many opportunities of proving to herself whether or not she was a princess. But one of the strongest tests she was ever put to came on a certain dreadful day which, she often thought afterward, would never quite fade out of her memory even in the years to come.\n\nFor several days it had rained continuously; the streets were chilly and sloppy and full of dreary, cold mist; there was mud everywhere--sticky London mud--and over everything the pall of drizzle and fog. Of course there were several long and tiresome errands to be done--there always were on days like this--and Sara was sent out again and again, until her shabby clothes were damp through. The absurd old feathers on her forlorn hat were more draggled and absurd than ever, and her downtrodden shoes were so wet that they could not hold any more water. Added to this, she had been deprived of her dinner, because Miss Minchin had chosen to punish her. She was so cold and hungry and tired that her face began to have a pinched look, and now and then some kind-hearted person passing her in the street glanced at her with sudden sympathy. But she did not know that. She hurried on, trying to make her mind think of something else. It was really very necessary. Her way of doing it was to \"pretend\" and \"suppose\" with all the strength that was left in her. But really this time it was harder than she had ever found it, and once or twice she thought it almost made her more cold and hungry instead of less so. But she persevered obstinately, and as the muddy water squelched through her broken shoes and the wind seemed trying to drag her thin jacket from her, she talked to herself as she walked, though she did not speak aloud or even move her lips.\n\n\"Suppose I had dry clothes on,\" she thought. \"Suppose I had good shoes and a long, thick coat and merino stockings and a whole umbrella. And suppose--suppose--just when I was near a baker's where they sold hot buns, I should find sixpence--which belonged to nobody. SUPPOSE if I did, I should go into the shop and buy six of the hottest buns and eat them all without stopping.\"\n\nSome very odd things happen in this world sometimes.\n\nIt certainly was an odd thing that happened to Sara. She had to cross the street just when she was saying this to herself. The mud was dreadful--she almost had to wade. She picked her way as carefully as she could, but she could not save herself much; only, in picking her way, she had to look down at her feet and the mud, and in looking down--just as she reached the pavement-- she saw something shining in the gutter. It was actually a piece of silver--a tiny piece trodden upon by many feet, but still with spirit enough left to shine a little. Not quite a sixpence, but the next thing to it--a fourpenny piece.\n\nIn one second it was in her cold little red-and-blue hand.\n\n\"Oh,\" she gasped, \"it is true! It is true!\"\n\nAnd then, if you will believe me, she looked straight at the shop directly facing her. And it was a baker's shop, and a cheerful, stout, motherly woman with rosy cheeks was putting into the window a tray of delicious newly baked hot buns, fresh from the oven--large, plump, shiny buns, with currants in them.\n\nIt almost made Sara feel faint for a few seconds--the shock, and the sight of the buns, and the delightful odors of warm bread floating up through the baker's cellar window.\n\nShe knew she need not hesitate to use the little piece of money. It had evidently been lying in the mud for some time, and its owner was completely lost in the stream of passing people who crowded and jostled each other all day long.\n\n\"But I'll go and ask the baker woman if she has lost anything,\" she said to herself, rather faintly. So she crossed the pavement and put her wet foot on the step. As she did so she saw something that made her stop.\n\nIt was a little figure more forlorn even than herself--a little figure which was not much more than a bundle of rags, from which small, bare, red muddy feet peeped out, only because the rags with which their owner was trying to cover them were not long enough. Above the rags appeared a shock head of tangled hair, and a dirty face with big, hollow, hungry eyes.\n\nSara knew they were hungry eyes the moment she saw them, and she felt a sudden sympathy.\n\n\"This,\" she said to herself, with a little sigh, \"is one of the populace--and she is hungrier than I am.\"\n\nThe child--this \"one of the populace\"--stared up at Sara, and shuffled herself aside a little, so as to give her room to pass. She was used to being made to give room to everybody. She knew that if a policeman chanced to see her he would tell her to \"move on.\"\n\nSara clutched her little fourpenny piece and hesitated for a few seconds. Then she spoke to her.\n\n\"Are you hungry?\" she asked.\n\nThe child shuffled herself and her rags a little more.\n\n\"Ain't I jist?\" she said in a hoarse voice. \"Jist ain't I?\"\n\n\"Haven't you had any dinner?\" said Sara.\n\n\"No dinner,\" more hoarsely still and with more shuffling. \"Nor yet no bre'fast--nor yet no supper. No nothin'.\n\n\"Since when?\" asked Sara.\n\n\"Dunno. Never got nothin' today--nowhere. I've axed an' axed.\"\n\nJust to look at her made Sara more hungry and faint. But those queer little thoughts were at work in her brain, and she was talking to herself, though she was sick at heart.\n\n\"If I'm a princess,\" she was saying, \"if I'm a princess--when they were poor and driven from their thrones--they always shared-- with the populace--if they met one poorer and hungrier than themselves. They always shared. Buns are a penny each. If it had been sixpence I could have eaten six. It won't be enough for either of us. But it will be better than nothing.\"\n\n\"Wait a minute,\" she said to the beggar child.\n\nShe went into the shop. It was warm and smelled deliciously. The woman was just going to put some more hot buns into the window.\n\n\"If you please,\" said Sara, \"have you lost fourpence--a silver fourpence?\" And she held the forlorn little piece of money out to her.\n\nThe woman looked at it and then at her--at her intense little face and draggled, once fine clothes.\n\n\"Bless us, no,\" she answered. \"Did you find it?\"\n\n\"Yes,\" said Sara. \"In the gutter.\"\n\n\"Keep it, then,\" said the woman. \"It may have been there for a week, and goodness knows who lost it. YOU could never find out.\"\n\n\"I know that,\" said Sara, \"but I thought I would ask you.\"\n\n\"Not many would,\" said the woman, looking puzzled and interested and good-natured all at once.\n\n\"Do you want to buy something?\" she added, as she saw Sara glance at the buns.\n\n\"Four buns, if you please,\" said Sara. \"Those at a penny each.\"\n\nThe woman went to the window and put some in a paper bag.\n\nSara noticed that she put in six.\n\n\"I said four, if you please,\" she explained. \"I have only fourpence.\"\n\n\"I'll throw in two for makeweight,\" said the woman with her good- natured look. \"I dare say you can eat them sometime. Aren't you hungry?\"\n\nA mist rose before Sara's eyes.\n\n\"Yes,\" she answered. \"I am very hungry, and I am much obliged to you for your kindness; and\"--she was going to add--\"there is a child outside who is hungrier than I am.\" But just at that moment two or three customers came in at once, and each one seemed in a hurry, so she could only thank the woman again and go out.\n\nThe beggar girl was still huddled up in the corner of the step. She looked frightful in her wet and dirty rags. She was staring straight before her with a stupid look of suffering, and Sara saw her suddenly draw the back of her roughened black hand across her eyes to rub away the tears which seemed to have surprised her by forcing their way from under her lids. She was muttering to herself.\n\nSara opened the paper bag and took out one of the hot buns, which had already warmed her own cold hands a little.\n\n\"See,\" she said, putting the bun in the ragged lap, \"this is nice and hot. Eat it, and you will not feel so hungry.\"\n\nThe child started and stared up at her, as if such sudden, amazing good luck almost frightened her; then she snatched up the bun and began to cram it into her mouth with great wolfish bites.\n\n\"Oh, my! Oh, my!\" Sara heard her say hoarsely, in wild delight. \"OH my!\"\n\nSara took out three more buns and put them down.\n\nThe sound in the hoarse, ravenous voice was awful.\n\n\"She is hungrier than I am,\" she said to herself. \"She's starving.\" But her hand trembled when she put down the fourth bun. \"I'm not starving,\" she said--and she put down the fifth.\n\nThe little ravening London savage was still snatching and devouring when she turned away. She was too ravenous to give any thanks, even if she had ever been taught politeness--which she had not. She was only a poor little wild animal.\n\n\"Good-bye,\" said Sara.\n\nWhen she reached the other side of the street she looked back. The child had a bun in each hand and had stopped in the middle of a bite to watch her. Sara gave her a little nod, and the child, after another stare--a curious lingering stare--jerked her shaggy head in response, and until Sara was out of sight she did not take another bite or even finish the one she had begun.\n\nAt that moment the baker-woman looked out of her shop window.\n\n\"Well, I never!\" she exclaimed. \"If that young un hasn't given her buns to a beggar child! It wasn't because she didn't want them, either. Well, well, she looked hungry enough. I'd give something to know what she did it for.\"\n\nShe stood behind her window for a few moments and pondered. Then her curiosity got the better of her. She went to the door and spoke to the beggar child.\n\n\"Who gave you those buns?\" she asked her. The child nodded her head toward Sara's vanishing figure.\n\n\"What did she say?\" inquired the woman.\n\n\"Axed me if I was 'ungry,\" replied the hoarse voice.\n\n\"What did you say?\"\n\n\"Said I was jist.\"\n\n\"And then she came in and got the buns, and gave them to you, did she?\"\n\nThe child nodded.\n\n\"How many?\"\n\n\"Five.\"\n\nThe woman thought it over.\n\n\"Left just one for herself,\" she said in a low voice. \"And she could have eaten the whole six--I saw it in her eyes.\"\n\nShe looked after the little draggled far-away figure and felt more disturbed in her usually comfortable mind than she had felt for many a day.\n\n\"I wish she hadn't gone so quick,\" she said. \"I'm blest if she shouldn't have had a dozen.\" Then she turned to the child.\n\n\"Are you hungry yet?\" she said.\n\n\"I'm allus hungry,\" was the answer, \"but 't ain't as bad as it was.\"\n\n\"Come in here,\" said the woman, and she held open the shop door.\n\nThe child got up and shuffled in. To be invited into a warm place full of bread seemed an incredible thing. She did not know what was going to happen. She did not care, even.\n\n\"Get yourself warm,\" said the woman, pointing to a fire in the tiny back room. \"And look here; when you are hard up for a bit of bread, you can come in here and ask for it. I'm blest if I won't give it to you for that young one's sake.\" * * *\n\nSara found some comfort in her remaining bun. At all events, it was very hot, and it was better than nothing. As she walked along she broke off small pieces and ate them slowly to make them last longer.\n\n\"Suppose it was a magic bun,\" she said, \"and a bite was as much as a whole dinner",
      "summary": "Sara continues to endure hardships at Miss Minchin's seminary, finding solace in her imagination and kindness. She befriends the Large Family next door and the ill Indian gentleman, Mr. Carrisford. Despite her own hunger and poverty, Sara shares her last coins with a starving beggar girl, buying her hot buns. This act of kindness is observed by the baker, who is moved by Sara's selflessness.",
      "prominence": 95,
      "key_characters": [
        {
          "name": "Sara Crewe",
          "description": "A young girl who has fallen from wealth to poverty, now working as a servant at Miss Minchin's seminary.",
          "summary": "Sara maintains her dignity and kindness despite extreme hardship, using her imagination to cope and showing extraordinary compassion by sharing her meager resources with those even less fortunate."
        },
        {
          "name": "Mr. Carrisford",
          "description": "The ill Indian gentleman living next door to the seminary.",
          "summary": "Mr. Carrisford is searching for his late friend's daughter, unaware that Sara is the child he seeks. He is haunted by guilt and determined to find her."
        },
        {
          "name": "Beggar Girl",
          "description": "A starving child Sara encounters on the street.",
          "summary": "The beggar girl represents the extreme poverty in London. She receives unexpected kindness from Sara, who shares her buns despite her own hunger."
        }
      ],
      "chapter": "The Other Side of the Wall",
      "conversation": [
        {
          "scenario": "Sara encounters a starving beggar girl on the street after finding a fourpence coin.",
          "topic": "Sara's act of kindness towards the beggar girl",
          "key_characters": [
            {
              "name": "Sara Crewe",
              "thought": "I'm so hungry, but this child is suffering even more than I am. I must help her, even if it means going without food myself."
            },
            {
              "name": "Beggar Girl",
              "thought": "I'm so hungry. Will this well-dressed girl ignore me like everyone else?"
            }
          ],
          "dialogues": [
            {
              "character": "Environment",
              "message": "A cold, wet London street. Sara, in her shabby clothes, stands before a baker's shop window filled with warm, fresh buns. A few feet away, a ragged beggar girl huddles against a wall."
            },
            {
              "character": "Sara Crewe",
              "message": "[I must help her, even if it means going hungry myself.] (approaches the beggar girl) \"Are you hungry?\""
            },
            {
              "character": "Beggar Girl",
              "message": "[Is she really talking to me?] (looks up warily) \"Ain't I jist? Jist ain't I?\""
            },
            {
              "character": "Sara Crewe",
              "message": "[She's even hungrier than I am.] \"Haven't you had any dinner?\""
            },
            {
              "character": "Beggar Girl",
              "message": "[Why does she care?] \"No dinner. Nor yet no bre'fastnor yet no supper. No nothin'.\""
            },
            {
              "character": "Sara Crewe",
              "message": "[I must be strong. A princess would share, even if she had little herself.] \"Wait a minute.\" (enters the bakery)"
            },
            {
              "character": "Environment",
              "message": "Sara enters the warm bakery, filled with the aroma of fresh bread. The baker woman watches her curiously."
            },
            {
              "character": "Sara Crewe",
              "message": "[I must be honest, even if it means losing the coin.] \"If you please, have you lost fourpencea silver fourpence?\""
            },
            {
              "character": "Baker Woman",
              "message": "[What an odd child.] \"Bless us, no. Did you find it?\""
            },
            {
              "character": "Sara Crewe",
              "message": "[At least now I can buy the buns with a clear conscience.] \"Yes, in the gutter. May I have four buns, please?\""
            },
            {
              "character": "Baker Woman",
              "message": "[This child looks half-starved herself.] (puts six buns in a bag) \"I'll throw in two for makeweight. Aren't you hungry?\""
            },
            {
              "character": "Sara Crewe",
              "message": "[I mustn't cry. I must be strong.] \"Yes, I am very hungry, and I am much obliged to you for your kindness.\" (leaves the shop)"
            },
            {
              "character": "Environment",
              "message": "Sara returns to the beggar girl, who is still huddled on the step, tears now visible on her dirty face."
            },
            {
              "character": "Sara Crewe",
              "message": "[She needs these more than I do.] (places a bun in the girl's lap) \"See, this is nice and hot. Eat it, and you will not feel so hungry.\""
            },
            {
              "character": "Beggar Girl",
              "message": "[Is this real?] (stares in disbelief, then snatches the bun) \"Oh, my! Oh, my! OH my!\""
            },
            {
              "character": "Sara Crewe",
              "message": "[She's even hungrier than I thought. I can't keep any for myself.] (places down all the remaining buns) \"Good-bye.\" (walks away)"
            },
            {
              "character": "Environment",
              "message": "Sara walks away, leaving the beggar girl with all six buns. The baker woman watches from her shop window, amazed by Sara's selflessness."
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "On this very afternoon, while Sara was out, a strange thing happened in the attic. Only Melchisedec saw and heard it; and he was so much alarmed and mystified that he scuttled back to his hole and hid there, and really quaked and trembled as he peeped out furtively and with great caution to watch what was going on.\n\nThe attic had been very still all the day after Sara had left it in the early morning. The stillness had only been broken by the pattering of the rain upon the slates and the skylight. Melchisedec had, in fact, found it rather dull; and when the rain ceased to patter and perfect silence reigned, he decided to come out and reconnoiter, though experience taught him that Sara would not return for some time. He had been rambling and sniffing about, and had just found a totally unexpected and unexplained crumb left from his last meal, when his attention was attracted by a sound on the roof. He stopped to listen with a palpitating heart. The sound suggested that something was moving on the roof. It was approaching the skylight; it reached the skylight. The skylight was being mysteriously opened. A dark face peered into the attic; then another face appeared behind it, and both looked in with signs of caution and interest. Two men were outside on the roof, and were making silent preparations to enter through the skylight itself. One was Ram Dass and the other was a young man who was the Indian gentleman's secretary; but of course Melchisedec did not know this. He only knew that the men were invading the silence and privacy of the attic; and as the one with the dark face let himself down through the aperture with such lightness and dexterity that he did not make the slightest sound, Melchisedec turned tail and fled precipitately back to his hole. He was frightened to death. He had ceased to be timid with Sara, and knew she would never throw anything but crumbs, and would never make any sound other than the soft, low, coaxing whistling; but strange men were dangerous things to remain near. He lay close and flat near the entrance of his home, just managing to peep through the crack with a bright, alarmed eye. How much he understood of the talk he heard I am not in the least able to say; but, even if he had understood it all, he would probably have remained greatly mystified.\n\nThe secretary, who was light and young, slipped through the skylight as noiselessly as Ram Dass had done; and he caught a last glimpse of Melchisedec's vanishing tail.\n\n\"Was that a rat?\" he asked Ram Dass in a whisper.\n\n\"Yes; a rat, Sahib,\" answered Ram Dass, also whispering. \"There are many in the walls.\"\n\n\"Ugh!\" exclaimed the young man. \"It is a wonder the child is not terrified of them.\"\n\nRam Dass made a gesture with his hands. He also smiled respectfully. He was in this place as the intimate exponent of Sara, though she had only spoken to him once.\n\n\"The child is the little friend of all things, Sahib,\" he answered. \"She is not as other children. I see her when she does not see me. I slip across the slates and look at her many nights to see that she is safe. I watch her from my window when she does not know I am near. She stands on the table there and looks out at the sky as if it spoke to her. The sparrows come at her call. The rat she has fed and tamed in her loneliness. The poor slave of the house comes to her for comfort. There is a little child who comes to her in secret; there is one older who worships her and would listen to her forever if she might. This I have seen when I have crept across the roof. By the mistress of the house--who is an evil woman--she is treated like a pariah; but she has the bearing of a child who is of the blood of kings!\"\n\n\"You seem to know a great deal about her,\" the secretary said.\n\n\"All her life each day I know,\" answered Ram Dass. \"Her going out I know, and her coming in; her sadness and her poor joys; her coldness and her hunger. I know when she is alone until midnight, learning from her books; I know when her secret friends steal to her and she is happier--as children can be, even in the midst of poverty--because they come and she may laugh and talk with them in whispers. If she were ill I should know, and I would come and serve her if it might be done.",
      "summary": "Ram Dass and the Indian gentleman's secretary secretly enter Sara's attic room to assess its condition. They plan to improve Sara's living conditions without her knowledge, inspired by her imaginative stories. Ram Dass reveals his deep understanding and care for Sara, explaining how he has been watching over her.",
      "prominence": 80,
      "key_characters": [
        {
          "name": "Ram Dass",
          "description": "The Indian gentleman's servant, who has been secretly observing Sara.",
          "summary": "Ram Dass shows great compassion for Sara, secretly watching over her and planning to improve her living conditions. He understands her character deeply and admires her resilience."
        },
        {
          "name": "Secretary",
          "description": "The young man working for the Indian gentleman, assisting in the plan to help Sara.",
          "summary": "The secretary helps assess Sara's room and takes notes on improvements to be made. He is intrigued by the plan and Sara's situation."
        },
        {
          "name": "Melchisedec",
          "description": "Sara's pet rat who lives in the attic.",
          "summary": "Melchisedec witnesses the intrusion into the attic but doesn't understand what's happening. He represents Sara's lonely life in the attic."
        }
      ],
      "chapter": "What Melchisedec Heard and Saw",
      "conversation": [
        {
          "scenario": "Ram Dass and the secretary secretly enter Sara's attic room to assess its condition and plan improvements.",
          "topic": "Observing Sara's living conditions and planning to help her",
          "key_characters": [
            {
              "name": "Ram Dass",
              "thought": "I must help this child who has shown such kindness and strength. We can make her dreams come true without her knowing."
            },
            {
              "name": "Secretary",
              "thought": "This plan seems unusual, but it's fascinating. I wonder what kind of child this Sara is to inspire such devotion."
            }
          ],
          "dialogues": [
            {
              "character": "Environment",
              "message": "The attic room is dimly lit and sparsely furnished. Ram Dass and the secretary enter silently through the skylight, careful not to disturb anything."
            },
            {
              "character": "Secretary",
              "message": "[This room is even more desolate than I imagined.] (whispers) \"Was that a rat?\""
            },
            {
              "character": "Ram Dass",
              "message": "[The poor child lives among these creatures.] \"Yes; a rat, Sahib. There are many in the walls.\""
            },
            {
              "character": "Secretary",
              "message": "[How can a child live like this?] \"Ugh! It is a wonder the child is not terrified of them.\""
            },
            {
              "character": "Ram Dass",
              "message": "[Sara's gentle nature never ceases to amaze me.] \"The child is the little friend of all things, Sahib. She is not as other children.\""
            },
            {
              "character": "Secretary",
              "message": "[Ram Dass seems to know a lot about her.] \"You seem to know a great deal about her.\""
            },
            {
              "character": "Ram Dass",
              "message": "[I wish I could do more for her.] \"All her life each day I know. Her going out I know, and her coming in; her sadness and her poor joys; her coldness and her hunger.\""
            },
            {
              "character": "Secretary",
              "message": "[We must be careful not to be discovered.] \"You are sure no one comes near this place but herself, and that she will not return and surprise us.\""
            },
            {
              "character": "Ram Dass",
              "message": "[I will protect our secret mission.] \"None mount here but herself, Sahib. She has gone out with her basket and may be gone for hours. If I stand here I can hear any step before it reaches the last flight of the stairs.\""
            },
            {
              "character": "Secretary",
              "message": "[We must work efficiently.] (takes out a pencil and tablet) \"Keep your ears open. I will make notes on what needs to be done.\""
            },
            {
              "character": "Environment",
              "message": "The secretary begins to examine the room, making notes on the poor condition of the bed, lack of warmth, and general state of disrepair."
            },
            {
              "character": "Secretary",
              "message": "[This is worse than we thought.] \"It is a strange way of doing the thing. Who planned it?\""
            },
            {
              "character": "Ram Dass",
              "message": "[I hope the Sahib approves of my idea.] \"It is true that the first thought was mine, Sahib. I am fond of this child; we are both lonely.\""
            },
            {
              "character": "Secretary",
              "message": "[This plan is quite ingenious.] \"It will be like a story from the Arabian Nights. Only an Oriental could have planned it.\""
            },
            {
              "character": "Ram Dass",
              "message": "[We must finish before we are discovered.] \"Yesterday, when she was out, I entered, bringing with me small, sharp nails which can be pressed into the wall without blows from a hammer. I placed many in the plaster where I may need them.\""
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "When Sara had passed the house next door she had seen Ram Dass closing the shutters, and caught her glimpse of this room also.\n\n\"It is a long time since I saw a nice place from the inside,\" was the thought which crossed her mind.\n\nThere was the usual bright fire glowing in the grate, and the Indian gentleman was sitting before it. His head was resting in his hand, and he looked as lonely and unhappy as ever.\n\n\"Poor man!\" said Sara. \"I wonder what you are supposing.\"\n\nAnd this was what he was \"supposing\" at that very moment.\n\n\"Suppose,\" he was thinking, \"suppose--even if Carmichael traces the people to Moscow--the little girl they took from Madame Pascal's school in Paris is NOT the one we are in search of. Suppose she proves to be quite a different child. What steps shall I take next?\"\n\nWhen Sara went into the house she met Miss Minchin, who had come downstairs to scold the cook.\n\n\"Where have you wasted your time?\" she demanded. \"You have been out for hours.\"\n\n\"It was so wet and muddy,\" Sara answered, \"it was hard to walk, because my shoes were so bad and slipped about.\"\n\n\"Make no excuses,\" said Miss Minchin, \"and tell no falsehoods.\"\n\nSara went in to the cook. The cook had received a severe lecture and was in a fearful temper as a result. She was only too rejoiced to have someone to vent her rage on, and Sara was a convenience, as usual.\n\n\"Why didn't you stay all night?\" she snapped.\n\nSara laid her purchases on the table.\n\n\"Here are the things,\" she said.\n\nThe cook looked them over, grumbling. She was in a very savage humor indeed.\n\n\"May I have something to eat?\" Sara asked rather faintly.\n\n\"Tea's over and done with,\" was the answer. \"Did you expect me to keep it hot for you?\"\n\nSara stood silent for a second.\n\n\"I had no dinner,\" she said next, and her voice was quite low. She made it low because she was afraid it would tremble.\n\n\"There's some bread in the pantry,\" said the cook. \"That's all you'll get at this time of day.\"\n\nSara went and found the bread. It was old and hard and dry. The cook was in too vicious a humor to give her anything to eat with it. It was always safe and easy to vent her spite on Sara. Really, it was hard for the child to climb the three long flights of stairs leading to her attic. She often found them long and steep when she was tired; but tonight it seemed as if she would never reach the top. Several times she was obliged to stop to rest. When she reached the top landing she was glad to see the glimmer of a light coming from under her door. That meant that Ermengarde had managed to creep up to pay her a visit. There was some comfort in that. It was better than to go into the room alone and find it empty and desolate. The mere presence of plump, comfortable Ermengarde, wrapped in her red shawl, would warm it a little.\n\nYes; there Ermengarde was when she opened the door. She was sitting in the middle of the bed, with her feet tucked safely under her. She had never become intimate with Melchisedec and his family, though they rather fascinated her. When she found herself alone in the attic she always preferred to sit on the bed until Sara arrived. She had, in fact, on this occasion had time to become rather nervous, because Melchisedec had appeared and sniffed about a good deal, and once had made her utter a repressed squeal by sitting up on his hind legs and, while he looked at her, sniffing pointedly in her direction.\n\n\"Oh, Sara,\" she cried out, \"I am glad you have come. Melchy WOULD sniff about so. I tried to coax him to go back, but he wouldn't for such a long time. I like him, you know; but it does frighten me when he sniffs right at me. Do you think he ever WOULD jump?\"\n\n\"No,\" answered Sara.\n\nErmengarde crawled forward on the bed to look at her.\n\n\"You DO look tired, Sara,\" she said; \"you are quite pale.\"\n\n\"I AM tired,\" said Sara, dropping on to the lopsided footstool. \"Oh, there's Melchisedec, poor thing. He's come to ask for his supper.\"\n\nMelchisedec had come out of his hole as if he had been listening for her footstep. Sara was quite sure he knew it. He came forward with an affectionate, expectant expression as Sara put her hand in her pocket and turned it inside out, shaking her head.\n\n\"I'm very sorry,\" she said. \"I haven't one crumb left. Go home, Melchisedec, and tell your wife there was nothing in my pocket. I'm afraid I forgot because the cook and Miss Minchin were so cross.\"\n\nMelchisedec seemed to understand. He shuffled resignedly, if not contentedly, back to his home.\n\n\"I did not expect to see you tonight, Ermie,\" Sara said. Ermengarde hugged herself in the red shawl.\n\n\"Miss Amelia has gone out to spend the night with her old aunt,\" she explained. \"No one else ever comes and looks into the bedrooms after we are in bed. I could stay here until morning if I wanted to.\"\n\nShe pointed toward the table under the skylight. Sara had not looked toward it as she came in. A number of books were piled upon it. Ermengarde's gesture was a dejected one.\n\n\"Papa has sent me some more books, Sara,\" she said. \"There they are.\"\n\nSara looked round and got up at once. She ran to the table, and picking up the top volume, turned over its leaves quickly. For the moment she forgot her discomforts.\n\n\"Ah,\" she cried out, \"how beautiful! Carlyle's French Revolution. I have SO wanted to read that!\"\n\n\"I haven't,\" said Ermengarde. \"And papa will be so cross if I don't. He'll expect me to know all about it when I go home for the holidays. What SHALL I do?\"\n\nSara stopped turning over the leaves and looked at her with an excited flush on her cheeks.\n\n\"Look here,\" she cried, \"if you'll lend me these books, _I'll_ read them--and tell you everything that's in them afterward-- and I'll tell it so that you will remember it, too.\"\n\n\"Oh, goodness!\" exclaimed Ermengarde. \"Do you think you can?\"\n\n\"I know I can,\" Sara answered. \"The little ones always remember what I tell them.\"\n\n\"Sara,\" said Ermengarde, hope gleaming in her round face, \"if you'll do that, and make me remember, I'll--I'll give you anything.\"\n\n\"I don't want you to give me anything,\" said Sara. \"I want your books--I want them!\" And her eyes grew big, and her chest heaved.\n\n\"Take them, then,\" said Ermengarde. \"I wish I wanted them--but I don't. I'm not clever, and my father is, and he thinks I ought to be.\"\n\nSara was opening one book after the other. \"What are you going to tell your father?\" she asked, a slight doubt dawning in her mind.\n\n\"Oh, he needn't know,\" answered Ermengarde. \"He'll think I've read them.\"\n\nSara put down her book and shook her head slowly. \"That's almost like telling lies,\" she said. \"And lies--well, you see, they are not only wicked--they're VULGAR. Sometimes\"-- reflectively--\"I've thought perhaps I might do something wicked-- I might suddenly fly into a rage and kill Miss Minchin, you know, when she was ill-treating me--but I COULDN'T be vulgar. Why can't you tell your father I read them?\"\n\n\"He wants me to read them,\" said Ermengarde, a little discouraged by this unexpected turn of affairs.\n\n\"He wants you to know what is in them,\" said Sara. \"And if I can tell it to you in an easy way and make you remember it, I should think he would like that.\"\n\n\"He'll like it if I learn anything in ANY way,\" said rueful Ermengarde. \"You would if you were my father.\"\n\n\"It's not your fault that--\" began Sara. She pulled herself up and stopped rather suddenly. She had been going to say, \"It's not your fault that you are stupid.\"\n\n\"That what?\" Ermengarde asked.\n\n\"That you can't learn things quickly,\" amended Sara. \"If you can't, you can't. If I can--why, I can; that's all.\"\n\nShe always felt very tender of Ermengarde, and tried not to let her feel too strongly the difference between being able to learn anything at once, and not being able to learn anything at all. As she looked at her plump face, one of her wise, old-fashioned thoughts came to her.\n\n\"Perhaps,\" she said, \"to be able to learn things quickly isn't everything. To be kind is worth a great deal to other people. If Miss Minchin knew everything on earth and was like what she is now, she'd still be a detestable thing, and everybody would hate her. Lots of clever people have done harm and have been wicked. Look at Robespierre--\"\n\nShe stopped and examined Ermengarde's countenance, which was beginning to look bewildered. \"Don't you remember?\" she demanded. \"I told you about him not long ago. I believe you've forgotten.\"\n\n\"Well, I don't remember ALL of it,\" admitted Ermengarde.\n\n\"Well, you wait a minute,\" said Sara, \"and I'll take off my wet things and wrap myself in the coverlet and tell you over again.\"\n\nShe took off her hat and coat and hung them on a nail against the wall, and she changed her wet shoes for an old pair of slippers. Then she jumped on the bed, and drawing the coverlet about her shoulders, sat with her arms round her knees. \"Now, listen,\" she said.\n\nShe plunged into the gory records of the French Revolution, and told such stories of it that Ermengarde's eyes grew round with alarm and she held her breath. But though she was rather terrified, there was a delightful thrill in listening, and she was not likely to forget Robespierre again, or to have any doubts about the Princesse de Lamballe.\n\n\"You know they put her head on a pike and danced round it,\" Sara explained. \"And she had beautiful floating blonde hair; and when I think of her, I never see her head on her body, but always on a pike, with those furious people dancing and howling.\"\n\nIt was agreed that Mr. St. John was to be told the plan they had made, and for the present the books were to be left in the attic.\n\n\"Now let's tell each other things,\" said Sara. \"How are you getting on with your French lessons?\"\n\n\"Ever so much better since the last time I came up here and you explained the conjugations. Miss Minchin could not understand why I did my exercises so well that first morning.\"\n\nSara laughed a little and hugged her knees.\n\n\"She doesn't understand why Lottie is doing her sums so well,\" she said; \"but it is because she creeps up here, too, and I help her.\" She glanced round the room. \"The attic would be rather nice--if it wasn't so dreadful,\" she said, laughing again. \"It's a good place to pretend in.\"\n\nThe truth was that Ermengarde did not know anything of the sometimes almost unbearable side of life in the attic and she had not a sufficiently vivid imagination to depict it for herself. On the rare occasions that she could reach Sara's room she only saw the side of it which was made exciting by things which were \"pretended\" and stories which were told. Her visits partook of the character of adventures; and though sometimes Sara looked rather pale, and it was not to be denied that she had grown very thin, her proud little spirit would not admit of complaints. She had never confessed that at times she was almost ravenous with hunger, as she was tonight. She was growing rapidly, and her constant walking and running about would have given her a keen appetite even if she had had abundant and regular meals of a much more nourishing nature than the unappetizing, inferior food snatched at such odd times as suited the kitchen convenience. She was growing used to a certain gnawing feeling in her young stomach.\n\n\"I suppose soldiers feel like this when they are on a long and weary march,\" she often said to herself. She liked the sound of the phrase, \"long and weary march.\" It made her feel rather like a soldier. She had also a quaint sense of being a hostess in the attic.\n\n\"If I lived in a castle,\" she argued, \"and Ermengarde was the lady of another castle, and came to see me, with knights and squires and vassals riding with her, and pennons flying, when I heard the clarions sounding outside the drawbridge I should go down to receive her, and I should spread feasts in the banquet hall and call in minstrels to sing and play and relate romances. When she comes into the attic I can't spread feasts, but I can tell stories, and not let her know disagreeable things. I dare say poor chatelaines had to do that in time of famine, when their lands had been pillaged.\" She was a proud, brave little chatelaine, and dispensed generously the one hospitality she could offer--the dreams she dreamed--the visions she saw--the imaginings which were her joy and comfort.\n\nSo, as they sat together, Ermengarde did not know that she was faint as well as ravenous, and that while she talked she now and then wondered if her hunger would let her sleep when she was left alone. She felt as if she had never been quite so hungry before.\n\n\"I wish I was as thin as you, Sara,\" Ermengarde said suddenly. \"I believe you are thinner than you used to be. Your eyes look so big, and look at the sharp little bones sticking out of your elbow!\"\n\nSara pulled down her sleeve, which had pushed itself up.\n\n\"I always was a thin child,\" she said bravely, \"and I always had big green eyes.\"\n\n\"I love your queer eyes,\" said Ermengarde, looking into them with affectionate admiration. \"They always look as if they saw such a long way. I love them--and I love them to be green--though they look black generally.\"\n\n\"They are cat's eyes,\" laughed Sara; \"but I can't see in the dark with them--because I have tried, and I couldn't--I wish I could.\"\n\nIt was just at this minute that something happened at the skylight which neither of them saw. If either of them had chanced to turn and look, she would have been startled by the sight of a dark face which peered cautiously into the room and disappeared as quickly and almost as silently as it had appeared. Not QUITE as silently, however. Sara, who had keen ears, suddenly turned a little and looked up at the roof.\n\n\"That didn't sound like Melchisedec,\" she said. \"It wasn't scratchy enough.\"\n\n\"What?\" said Ermengarde, a little startled.\n\n\"Didn't you think you heard something?\" asked Sara.\n\n\"N-no,\" Ermengarde faltered. \"Did you?\" {another ed. has \"No- no,\"}\n\n\"Perhaps I didn't,\" said Sara; \"but I thought I did. It sounded as if something was on the slates--something that dragged softly.\"\n\n\"What could it be?\" said Ermengarde. \"Could it be--robbers?\"\n\n\"No,\" Sara began cheerfully. \"There is nothing to steal--\"\n\nShe broke off in the middle of her words. They both heard the sound that checked her. It was not on the slates, but on the stairs below, and it was Miss Minchin's angry voice. Sara sprang off the bed, and put out the candle.\n\n\"She is scolding Becky,\" she whispered, as she stood in the darkness. \"She is making her cry.\"\n\n\"Will she come in here?\" Ermengarde whispered back, panic- stricken.\n\n\"No. She will think I am in bed. Don't stir.\"\n\nIt was very seldom that Miss Minchin mounted the last flight of stairs. Sara could only remember that she had done it once before. But now she was angry enough to be coming at least part of the way up, and it sounded as if she was driving Becky before her.\n\n\"You impudent, dishonest child!\" they heard her say. \"Cook tells me she has missed things repeatedly.\"\n\n\"'T warn't me, mum,\" said Becky sobbing. \"I was 'ungry enough, but 't warn't me--never!\"\n\n\"You deserve to be sent to prison,\" said Miss Minchin's voice. \"Picking and stealing! Half a meat pie, indeed!\"\n\n\"'T warn't me,\" wept Becky. \"I could 'ave eat a whole un--but I never laid a finger on it.\"\n\nMiss Minchin was out of breath between temper and mounting the stairs. The meat pie had been intended for her special late supper. It became apparent that she boxed Becky's ears.\n\n\"Don't tell falsehoods,\" she said. \"Go to your room this instant.\"\n\nBoth Sara and Ermengarde heard the slap, and then heard Becky run in her slipshod shoes up the stairs and into her attic. They heard her door shut, and knew that she threw herself upon her bed.\n\n\"I could 'ave e't two of 'em,\" they heard her cry into her pillow. \"An' I never took a bite. 'Twas cook give it to her policeman.\"\n\nSara stood in the middle of the room in the darkness. She was clenching her little teeth and opening and shutting fiercely her outstretched hands. She could scarcely stand still, but she dared not move until Miss Minchin had gone down the stairs and all was still.\n\n\"The wicked, cruel thing!\" she burst forth. \"The cook takes things herself and then says Becky steals them. She DOESN'T! She DOESN'T! She's so hungry sometimes that she eats crusts out of the ash barrel!\" She pressed her hands hard against her face and burst into passionate little sobs, and Ermengarde, hearing this unusual thing, was overawed by it. Sara was crying! The unconquerable Sara! It seemed to denote something new--some mood she had never known. Suppose--suppose--a new dread possibility presented itself to her kind, slow, little mind all at once. She crept off the bed in the dark and found her way to the table where the candle stood. She struck a match and lit the candle. When she had lighted it, she bent forward and looked at Sara, with her new thought growing to definite fear in her eyes.\n\n\"Sara,\" she said in a timid, almost awe-stricken voice, are--are- -you never told me--I don't want to be rude, but--are YOU ever hungry?\"\n\nIt was too much just at that moment. The barrier broke down. Sara lifted her face from her hands.\n\n\"Yes,\" she said in a new passionate way. \"Yes, I am. I'm so hungry now that I could almost eat you. And it makes it worse to hear poor Becky. She's hungrier than I am.\"\n\nErmengarde gasped.\n\n\"Oh, oh!\" she cried woefully. \"And I never knew!\"\n\n\"I didn't want you to know,\" Sara said. \"It would have made me feel like a street beggar. I know I look like a street beggar.\"\n\n\"No, you don't--you don't!\" Ermengarde broke in. \"Your clothes are a little queer--but you couldn't look like a street beggar. You haven't a street-beggar face.\"\n\n\"A little boy once gave me a sixpence for charity,\" said Sara, with a short little laugh in spite of herself. \"Here it is.\" And she pulled out the thin ribbon from her neck. \"He wouldn't have given me his Christmas sixpence if I hadn't looked as if I needed it.\"\n\nSomehow the sight of the dear little sixpence was good for both of them. It made them laugh a little, though they both had tears in their eyes.\n\n\"Who was he?\" asked Ermengarde, looking at it quite as if it had not been a mere ordinary silver sixpence.\n\n\"He was a darling little thing going to a party,\" said Sara. \"He was one of the Large Family, the little one with the round legs-- the one I call Guy Clarence. I suppose his nursery was crammed with Christmas presents and hampers full of cakes and things, and he could see I had nothing.\"\n\nErmengarde gave a little jump backward. The last sentences had recalled something to her troubled mind and given her a sudden inspiration.\n\n\"Oh, Sara!\" she cried. \"What a silly thing I am not to have thought of it!\"\n\n\"Of what?\"\n\n\"Something splendid!\" said Ermengarde, in an excited hurry. \"This very afternoon my nicest aunt sent me a box. It is full of good things. I never touched it, I had so much pudding at dinner, and I was so bothered about papa's books.\" Her words began to tumble over each other. \"It's got cake in it, and little meat pies, and jam tarts and buns, and oranges and red- currant wine, and figs and chocolate. I'll creep back to my room and get it this minute, and we'll eat it now.\"\n\nSara almost reeled. When one is faint with hunger the mention of food has sometimes a curious effect. She clutched Ermengarde's arm.\n\n\"Do you think--you COULD?\" she ejaculated.\n\n\"I know I could,\" answered Ermengarde, and she ran to the door-- opened it softly--put her head out into the darkness, and listened. Then she went back to Sara. \"The lights are out. Everybody's in bed. I can creep--and creep--and no one will hear.\"\n\nIt was so delightful that they caught each other's hands and a sudden light sprang into Sara's eyes.\n\n\"Ermie!\" she said. \"Let us PRETEND! Let us pretend it's a party! And oh, won't you invite the prisoner in the next cell?\"\n\n\"Yes! Yes! Let us knock on the wall now. The jailer won't hear.\"\n\nSara went to the wall. Through it she could hear poor Becky crying more softly. She knocked four times.\n\n\"That means, `Come to me through the secret passage under the wall,' she explained. `I have something to communicate.'\"\n\nFive quick knocks answered her.\n\n\"She is coming,\" she said.\n\nAlmost immediately the door of the attic opened and Becky appeared. Her eyes were red and her cap was sliding off, and when she caught sight of Ermengarde she began to rub her face nervously with her apron.\n\n\"Don't mind me a bit, Becky!\" cried Ermengarde.\n\n\"Miss Ermengarde has asked you to come in,\" said Sara, \"because she is going to bring a box of good things up here to us.\"\n\nBecky's cap almost fell off entirely, she broke in with such excitement.\n\n\"To eat, miss?\" she said. \"Things that's good to eat?\"\n\n\"Yes,\" answered Sara, \"and we are going to pretend a party.\"\n\n\"And you shall have as much as you WANT to eat,\" put in Ermengarde. \"I'll go this minute!\"\n\nShe was in such haste that as she tiptoed out of the attic she dropped her red shawl and did not know it had fallen. No one saw it for a minute or so. Becky was too much overpowered by the good luck which had befallen her.\n\n\"Oh, miss! oh, miss!\" she gasped; \"I know it was you that asked her to let me come. It--it makes me cry to think of it.\" And she went to Sara's side and stood and looked at her worshipingly.\n\nBut in Sara's hungry eyes the old light had begun to glow and transform her world for her. Here in the attic--with the cold night outside-- with the afternoon in the sloppy streets barely passed--with the memory of the awful unfed look in the beggar child's eyes not yet faded--this simple, cheerful thing had happened like a thing of magic.\n\nShe caught her breath.\n\n\"Somehow, something always happens,\" she cried, \"just before things get to the very worst. It is as if the Magic did it. If I could only just remember that always. The worst thing never QUITE comes.\"\n\nShe gave Becky a little cheerful shake.\n\n\"No, no! You mustn't cry!\" she said. \"We must make haste and set the table.\"\n\n\"Set the table, miss?\" said Becky, gazing round the room. \"What'll we set it with?\"\n\nSara looked round the attic, too.\n\n\"There doesn't seem to be much,\" she answered, half laughing.\n\nThat moment she saw something and pounced upon it.",
      "summary": "Sara and Ermengarde have a secret meeting in the attic. Sara confesses her hunger, and Ermengarde decides to share a box of treats sent by her aunt. They invite Becky to join their impromptu party. This act of kindness brings joy to the starving girls and showcases Sara's resilience and generosity even in her own dire circumstances.",
      "prominence": 90,
      "key_characters": [
        {
          "name": "Sara Crewe",
          "description": "A once-wealthy student now working as a servant at Miss Minchin's seminary.",
          "summary": "Despite her own hunger and hardship, Sara maintains her dignity and kindness. She confides in Ermengarde about her hunger and organizes a secret 'party' to share food with Becky."
        },
        {
          "name": "Ermengarde",
          "description": "Sara's friend and a student at the seminary.",
          "summary": "Ermengarde learns of Sara's true situation and decides to share her box of treats. She shows genuine concern and friendship for Sara."
        },
        {
          "name": "Becky",
          "description": "The scullery maid at Miss Minchin's seminary.",
          "summary": "Becky is invited to join Sara and Ermengarde's secret party. She is deeply grateful for their kindness and inclusion."
        }
      ],
      "chapter": "The Magic",
      "conversation": [
        {
          "scenario": "Sara and Ermengarde are in the attic, and Sara reveals her hunger. Ermengarde decides to share her box of treats, and they invite Becky to join them.",
          "topic": "Sharing food and friendship in secret",
          "key_characters": [
            {
              "name": "Sara Crewe",
              "thought": "I'm so hungry, but I mustn't complain. I need to be strong for Ermengarde and Becky."
            },
            {
              "name": "Ermengarde",
              "thought": "I had no idea Sara was suffering so much. I must help her somehow."
            },
            {
              "name": "Becky",
              "thought": "I can't believe Miss Sara and Miss Ermengarde want to include me. I'm so grateful and excited."
            }
          ],
          "dialogues": [
            {
              "character": "Environment",
              "message": "The cold, dimly lit attic. Sara and Ermengarde are sitting on the bed, speaking in hushed tones to avoid detection."
            },
            {
              "character": "Ermengarde",
              "message": "[Sara looks so thin. I never noticed before.] \"Sara, are you... are you ever hungry?\""
            },
            {
              "character": "Sara Crewe",
              "message": "[I can't hide it anymore. I'm so tired of pretending.] (tears welling up) \"Yes, I am. I'm so hungry now that I could almost eat you.\""
            },
            {
              "character": "Ermengarde",
              "message": "[Oh, how terrible! I must do something!] \"Oh, oh! And I never knew!\""
            },
            {
              "character": "Sara Crewe",
              "message": "[I didn't want anyone to know. It's embarrassing.] \"I didn't want you to know. It would have made me feel like a street beggar.\""
            },
            {
              "character": "Ermengarde",
              "message": "[I have an idea!] (excitedly) \"Oh, Sara! What a silly thing I am not to have thought of it! This very afternoon my nicest aunt sent me a box. It is full of good things.\""
            },
            {
              "character": "Sara Crewe",
              "message": "[Food? Real food?] (clutching Ermengarde's arm) \"Do you think--you COULD?\""
            },
            {
              "character": "Ermengarde",
              "message": "[I'm so glad I can help!] \"I know I could. I'll creep back to my room and get it this minute, and we'll eat it now.\""
            },
            {
              "character": "Sara Crewe",
              "message": "[This feels like magic. We should share it.] \"Ermie! Let us PRETEND! Let us pretend it's a party! And oh, won't you invite the prisoner in the next cell?\""
            },
            {
              "character": "Ermengarde",
              "message": "[Sara's imagination is wonderful, even now.] \"Yes! Yes! Let us knock on the wall now. The jailer won't hear.\""
            },
            {
              "character": "Environment",
              "message": "Sara knocks on the wall four times, then five quick knocks answer her. Moments later, Becky appears at the attic door, her eyes red from crying."
            },
            {
              "character": "Becky",
              "message": "[What's happening? Why are they calling me?] (nervously rubbing her face with her apron) \"Miss?\""
            },
            {
              "character": "Sara Crewe",
              "message": "[I'm so happy we can include Becky.] \"Miss Ermengarde has asked you to come in because she is going to bring a box of good things up here to us.\""
            },
            {
              "character": "Becky",
              "message": "[I can't believe it! Real food!] (excitedly) \"To eat, miss? Things that's good to eat?\""
            },
            {
              "character": "Ermengarde",
              "message": "[I'm so glad I can help them both.] \"Yes, and you shall have as much as you WANT to eat. I'll go this minute!\""
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "She stood panting a moment longer, and then cried out again.\n\n\"Oh, it isn't true!\" she said. \"It CAN'T be true! But oh, how true it seems!\"\n\nThe blazing fire drew her to it, and she knelt down and held out her hands close to it--so close that the heat made her start back.\n\n\"A fire I only dreamed wouldn't be HOT,\" she cried.\n\nShe sprang up, touched the table, the dishes, the rug; she went to the bed and touched the blankets. She took up the soft wadded dressing-gown, and suddenly clutched it to her breast and held it to her cheek.\n\n\"It's warm. It's soft!\" she almost sobbed. \"It's real. It must be!\"\n\nShe threw it over her shoulders, and put her feet into the slippers.\n\n\"They are real, too. It's all real!\" she cried. \"I am NOT--I am NOT dreaming!\"\n\nShe almost staggered to the books and opened the one which lay upon the top. Something was written on the flyleaf--just a few words, and they were these:\n\n\"To the little girl in the attic. From a friend.\"\n\nWhen she saw that--wasn't it a strange thing for her to do-- she put her face down upon the page and burst into tears.\n\n\"I don't know who it is,\" she said; \"but somebody cares for me a little. I have a friend.\"\n\nShe took her candle and stole out of her own room and into Becky's, and stood by her bedside.\n\n\"Becky, Becky!\" she whispered as loudly as she dared. \"Wake up!\"\n\nWhen Becky wakened, and she sat upright staring aghast, her face still smudged with traces of tears, beside her stood a little figure in a luxurious wadded robe of crimson silk. The face she saw was a shining, wonderful thing. The Princess Sara--as she remembered her--stood at her very bedside, holding a candle in her hand.\n\n\"Come,\" she said. \"Oh, Becky, come!\"\n\nBecky was too frightened to speak. She simply got up and followed her, with her mouth and eyes open, and without a word.\n\nAnd when they crossed the threshold, Sara shut the door gently and drew her into the warm, glowing midst of things which made her brain reel and her hungry senses faint. \"It's true! It's true!\" she cried. \"I've touched them all. They are as real as we are. The Magic has come and done it, Becky, while we were asleep--the Magic that won't let those worst things EVER quite happen.\"\n\n16\n\nThe Visitor\n\nImagine, if you can, what the rest of the evening was like. How they crouched by the fire which blazed and leaped and made so much of itself in the little grate. How they removed the covers of the dishes, and found rich, hot, savory soup, which was a meal in itself, and sandwiches and toast and muffins enough for both of them. The mug from the washstand was used as Becky's tea cup, and the tea was so delicious that it was not necessary to pretend that it was anything but tea. They were warm and full-fed and happy, and it was just like Sara that, having found her strange good fortune real, she should give herself up to the enjoyment of it to the utmost. She had lived such a life of imaginings that she was quite equal to accepting any wonderful thing that happened, and almost to cease, in a short time, to find it bewildering.\n\n\"I don't know anyone in the world who could have done it,\" she said; \"but there has been someone. And here we are sitting by their fire--and--and--it's true! And whoever it is--wherever they are--I have a friend, Becky--someone is my friend.\"\n\nIt cannot be denied that as they sat before the blazing fire, and ate the nourishing, comfortable food, they felt a kind of rapturous awe, and looked into each other's eyes with something like doubt.\n\n\"Do you think,\" Becky faltered once, in a whisper, \"do you think it could melt away, miss? Hadn't we better be quick?\" And she hastily crammed her sandwich into her mouth. If it was only a dream, kitchen manners would be overlooked.\n\n\"No, it won't melt away,\" said Sara. \"I am EATING this muffin, and I can taste it. You never really eat things in dreams. You only think you are going to eat them. Besides, I keep giving myself pinches; and I touched a hot piece of coal just now, on purpose.\"\n\nThe sleepy comfort which at length almost overpowered them was a heavenly thing. It was the drowsiness of happy, well-fed childhood, and they sat in the fire glow and luxuriated in it until Sara found herself turning to look at her transformed bed.\n\nThere were even blankets enough to share with Becky. The narrow couch in the next attic was more comfortable that night than its occupant had ever dreamed that it could be.\n\nAs she went out of the room, Becky turned upon the threshold and looked about her with devouring eyes.\n\n\"If it ain't here in the mornin', miss,\" she said, \"it's been here tonight, anyways, an' I shan't never forget it.\" She looked at each particular thing, as if to commit it to memory. \"The fire was THERE\", pointing with her finger, \"an' the table was before it; an' the lamp was there, an' the light looked rosy red; an' there was a satin cover on your bed, an' a warm rug on the floor, an' everythin' looked beautiful; an'\"--she paused a second, and laid her hand on her stomach tenderly--\"there WAS soup an' sandwiches an' muffins--there WAS.\" And, with this conviction a reality at least, she went away.\n\nThrough the mysterious agency which works in schools and among servants, it was quite well known in the morning that Sara Crewe was in horrible disgrace, that Ermengarde was under punishment, and that Becky would have been packed out of the house before breakfast, but that a scullery maid could not be dispensed with at once. The servants knew that she was allowed to stay because Miss Minchin could not easily find another creature helpless and humble enough to work like a bounden slave for so few shillings a week. The elder girls in the schoolroom knew that if Miss Minchin did not send Sara away it was for practical reasons of her own.\n\n\"She's growing so fast and learning such a lot, somehow,\" said Jessie to Lavinia, \"that she will be given classes soon, and Miss Minchin knows she will have to work for nothing. It was rather nasty of you, Lavvy, to tell about her having fun in the garret. How did you find it out?\"\n\n\"I got it out of Lottie. She's such a baby she didn't know she was telling me. There was nothing nasty at all in speaking to Miss Minchin. I felt it my duty\"--priggishly. \"She was being deceitful. And it's ridiculous that she should look so grand, and be made so much of, in her rags and tatters!\"\n\n\"What were they doing when Miss Minchin caught them?\"\n\n\"Pretending some silly thing. Ermengarde had taken up her hamper to share with Sara and Becky. She never invites us to share things. Not that I care, but it's rather vulgar of her to share with servant girls in attics. I wonder Miss Minchin didn't turn Sara out--even if she does want her for a teacher.\"\n\n\"If she was turned out where would she go?\" inquired Jessie, a trifle anxiously.\n\n\"How do I know?\" snapped Lavinia. \"She'll look rather queer when she comes into the schoolroom this morning, I should think-- after what's happened. She had no dinner yesterday, and she's not to have any today.\"\n\nJessie was not as ill-natured as she was silly. She picked up her book with a little jerk.\n\n\"Well, I think it's horrid,\" she said. \"They've no right to starve her to death.\"\n\nWhen Sara went into the kitchen that morning the cook looked askance at her, and so did the housemaids; but she passed them hurriedly. She had, in fact, overslept herself a little, and as Becky had done the same, neither had had time to see the other, and each had come downstairs in haste.\n\nSara went into the scullery. Becky was violently scrubbing a kettle, and was actually gurgling a little song in her throat. She looked up with a wildly elated face.\n\n\"It was there when I wakened, miss--the blanket,\" she whispered excitedly. \"It was as real as it was last night.\"\n\n\"So was mine,\" said Sara. \"It is all there now--all of it. While I was dressing I ate some of the cold things we left.\"\n\n\"Oh, laws! Oh, laws!\" Becky uttered the exclamation in a sort of rapturous groan, and ducked her head over her kettle just in time, as the cook came in from the kitchen.\n\nMiss Minchin had expected to see in Sara, when she appeared in the schoolroom, very much what Lavinia had expected to see. Sara had always been an annoying puzzle to her, because severity never made her cry or look frightened. When she was scolded she stood still and listened politely with a grave face; when she was punished she performed her extra tasks or went without her meals, making no complaint or outward sign of rebellion. The very fact that she never made an impudent answer seemed to Miss Minchin a kind of impudence in itself. But after yesterday's deprivation of meals, the violent scene of last night, the prospect of hunger today, she must surely have broken down. It would be strange indeed if she did not come downstairs with pale cheeks and red eyes and an unhappy, humbled face.\n\nMiss Minchin saw her for the first time when she entered the schoolroom to hear the little French class recite its lessons and superintend its exercises. And she came in with a springing step, color in her cheeks, and a smile hovering about the corners of her mouth. It was the most astonishing thing Miss Minchin had ever known. It gave her quite a shock. What was the child made of? What could such a thing mean? She called her at once to her desk.\n\n\"You do not look as if you realize that you are in disgrace,\" she said. \"Are you absolutely hardened?\"\n\nThe truth is that when one is still a child--or even if one is grown up--and has been well fed, and has slept long and softly and warm; when one has gone to sleep in the midst of a fairy story, and has wakened to find it real, one cannot be unhappy or even look as if one were; and one could not, if one tried, keep a glow of joy out of one's eyes. Miss Minchin was almost struck dumb by the look of Sara's eyes when she made her perfectly respectful answer.\n\n\"I beg your pardon, Miss Minchin,\" she said; \"I know that I am in disgrace.\"\n\n\"Be good enough not to forget it and look as if you had come into a fortune. It is an impertinence. And remember you are to have no food today.\"\n\n\"Yes, Miss Minchin,\" Sara answered; but as she turned away her heart leaped with the memory of what yesterday had been. \"If the Magic had not saved me just in time,\" she thought, \"how horrible it would have been!\"\n\n\"She can't be very hungry,\" whispered Lavinia. \"Just look at her. Perhaps she is pretending she has had a good breakfast\"-- with a spiteful laugh.\n\n\"She's different from other people,\" said Jessie, watching Sara with her class. \"Sometimes I'm a bit frightened of her.\"\n\n\"Ridiculous thing!\" ejaculated Lavinia.\n\nAll through the day the light was in Sara's face, and the color in her cheek. The servants cast puzzled glances at her, and whispered to each other, and Miss Amelia's small blue eyes wore an expression of bewilderment. What such an audacious look of well-being, under august displeasure could mean she could not understand. It was, however, just like Sara's singular obstinate way. She was probably determined to brave the matter out.\n\nOne thing Sara had resolved upon, as she thought things over. The wonders which had happened must be kept a secret, if such a thing were possible. If Miss Minchin should choose to mount to the attic again, of course all would be discovered. But it did not seem likely that she would do so for some time at least, unless she was led by suspicion. Ermengarde and Lottie would be watched with such strictness that they would not dare to steal out of their beds again. Ermengarde could be told the story and trusted to keep it secret. If Lottie made any discoveries, she could be bound to secrecy also. Perhaps the Magic itself would help to hide its own marvels.\n\n\"But whatever happens,\" Sara kept saying to herself all day-- \"WHATEVER happens, somewhere in the world there is a heavenly kind person who is my friend--my friend. If I never know who it is--if I never can even thank him--I shall never feel quite so lonely. Oh, the Magic was GOOD to me!\"\n\nIf it was possible for weather to be worse than it had been the day before, it was worse this day--wetter, muddier, colder. There were more errands to be done, the cook was more irritable, and, knowing that Sara was in disgrace, she was more savage. But what does anything matter when one's Magic has just proved itself one's friend. Sara's supper of the night before had given her strength, she knew that she should sleep well and warmly, and, even though she had naturally begun to be hungry again before evening, she felt that she could bear it until breakfast- time on the following day, when her meals would surely be given to her again. It was quite late when she was at last allowed to go upstairs. She had been told to go into the schoolroom and study until ten o'clock, and she had become interested in her work, and remained over her books later.\n\nWhen she reached the top flight of stairs and stood before the attic door, it must be confessed that her heart beat rather fast.\n\n\"Of course it MIGHT all have been taken away,\" she whispered, trying to be brave. \"It might only have been lent to me for just that one awful night. But it WAS lent to me--I had it. It was real.\"\n\nShe pushed the door open and went in. Once inside, she gasped slightly, shut the door, and stood with her back against it looking from side to side.\n\nThe Magic had been there again. It actually had, and it had done even more than before. The fire was blazing, in lovely leaping flames, more merrily than ever. A number of new things had been brought into the attic which so altered the look of it that if she had not been past doubting she would have rubbed her eyes. Upon the low table another supper stood--this time with cups and plates for Becky as well as herself; a piece of bright, heavy, strange embroidery covered the battered mantel, and on it some ornaments had been placed. All the bare, ugly things which could be covered with draperies had been concealed and made to look quite pretty. Some odd materials of rich colors had been fastened against the wall with fine, sharp tacks--so sharp that they could be pressed into the wood and plaster without hammering. Some brilliant fans were pinned up, and there were several large cushions, big and substantial enough to use as seats. A wooden box was covered with a rug, and some cushions lay on it, so that it wore quite the air of a sofa.\n\nSara slowly moved away from the door and simply sat down and looked and looked again.\n\n\"It is exactly like something fairy come true,\" she said. \"There isn't the least difference. I feel as if I might wish for anything--diamonds or bags of gold--and they would appear! THAT wouldn't be any stranger than this. Is this my garret? Am I the same cold, ragged, damp Sara? And to think I used to pretend and pretend and wish there were fairies! The one thing I always wanted was to see a fairy story come true. I am LIVING in a fairy story. I feel as if I might be a fairy myself, and able to turn things into anything else.",
      "summary": "Sara discovers that her attic room has been magically transformed overnight, with a warm fire, comfortable furnishings, and delicious food. She shares this magical experience with Becky, and they both revel in the sudden comfort and warmth. Sara believes that she has a secret friend who has performed this magic for her, giving her hope and strength to endure her hardships.",
      "prominence": 95,
      "key_characters": [
        {
          "name": "Sara Crewe",
          "description": "A former wealthy student now working as a servant at Miss Minchin's seminary.",
          "summary": "Sara experiences a magical transformation of her attic room, which gives her renewed hope and strength. She shares this joy with Becky and maintains her resilience in the face of continued mistreatment."
        },
        {
          "name": "Becky",
          "description": "The scullery maid at Miss Minchin's seminary.",
          "summary": "Becky shares in Sara's magical experience, enjoying the comfort and warmth of the transformed attic. She is grateful and amazed by the sudden change in their circumstances."
        },
        {
          "name": "Miss Minchin",
          "description": "The strict headmistress of the seminary.",
          "summary": "Miss Minchin continues to treat Sara harshly, unaware of the magical transformations occurring in the attic. She is puzzled by Sara's continued resilience and positive demeanor despite the punishments."
        }
      ],
      "chapter": "The Magic",
      "conversation": [
        {
          "scenario": "Sara wakes up to find her attic room magically transformed and shares the discovery with Becky.",
          "topic": "The magical transformation of the attic",
          "key_characters": [
            {
              "name": "Sara Crewe",
              "thought": "Is this real? Have my dreams come true? I must share this with Becky!"
            },
            {
              "name": "Becky",
              "thought": "I can't believe what I'm seeing. Is this a dream or has Miss Sara's magic really happened?"
            }
          ],
          "dialogues": [
            {
              "character": "Environment",
              "message": "The once bare and cold attic is now warm and cozy, filled with comfortable furnishings, a blazing fire, and delicious food."
            },
            {
              "character": "Sara Crewe",
              "message": "[This can't be real, but I can feel and touch everything!] (touching the warm blankets and soft furnishings) \"It doesn't melt away. I'm not dreaming!\""
            },
            {
              "character": "Sara Crewe",
              "message": "[I must share this with Becky!] (rushing to Becky's room) \"Becky, Becky! Wake up!\""
            },
            {
              "character": "Becky",
              "message": "[What's happening? Is something wrong?] (sitting up groggily) \"Miss? What is it?\""
            },
            {
              "character": "Sara Crewe",
              "message": "[I can't contain my excitement!] \"Come! Oh, Becky, come!\""
            },
            {
              "character": "Environment",
              "message": "Sara leads Becky into the transformed attic. The room is bathed in warm light from the fire, and the scent of delicious food fills the air."
            },
            {
              "character": "Becky",
              "message": "[I can't believe my eyes!] (gasping) \"Oh, laws! Oh, laws, miss!\""
            },
            {
              "character": "Sara Crewe",
              "message": "[It's real for both of us!] \"You see, Becky? It's all real!\""
            },
            {
              "character": "Becky",
              "message": "[This is beyond anything I could have imagined.] \"Where does it all come from, miss? Laws, who does it?\""
            },
            {
              "character": "Sara Crewe",
              "message": "[It's better not to question the magic.] \"Don't let us even ask. If it were not that I want to say, 'Oh, thank you,' I would rather not know. It makes it more beautiful.\""
            },
            {
              "character": "Environment",
              "message": "The girls sit by the fire, enjoying the warmth and comfort, their faces glowing with happiness and wonder."
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "Imagine, if you can, what the rest of the evening was like. How they crouched by the fire which blazed and leaped and made so much of itself in the little grate. How they removed the covers of the dishes, and found rich, hot, savory soup, which was a meal in itself, and sandwiches and toast and muffins enough for both of them. The mug from the washstand was used as Becky's tea cup, and the tea was so delicious that it was not necessary to pretend that it was anything but tea. They were warm and full-fed and happy, and it was just like Sara that, having found her strange good fortune real, she should give herself up to the enjoyment of it to the utmost. She had lived such a life of imaginings that she was quite equal to accepting any wonderful thing that happened, and almost to cease, in a short time, to find it bewildering.\n\n\"I don't know anyone in the world who could have done it,\" she said; \"but there has been someone. And here we are sitting by their fire--and--and--it's true! And whoever it is--wherever they are--I have a friend, Becky--someone is my friend.\"\n\nIt cannot be denied that as they sat before the blazing fire, and ate the nourishing, comfortable food, they felt a kind of rapturous awe, and looked into each other's eyes with something like doubt.\n\n\"Do you think,\" Becky faltered once, in a whisper, \"do you think it could melt away, miss? Hadn't we better be quick?\" And she hastily crammed her sandwich into her mouth. If it was only a dream, kitchen manners would be overlooked.\n\n\"No, it won't melt away,\" said Sara. \"I am EATING this muffin, and I can taste it. You never really eat things in dreams. You only think you are going to eat them. Besides, I keep giving myself pinches; and I touched a hot piece of coal just now, on purpose.\"\n\nThe sleepy comfort which at length almost overpowered them was a heavenly thing. It was the drowsiness of happy, well-fed childhood, and they sat in the fire glow and luxuriated in it until Sara found herself turning to look at her transformed bed.\n\nThere were even blankets enough to share with Becky. The narrow couch in the next attic was more comfortable that night than its occupant had ever dreamed that it could be.\n\nAs she went out of the room, Becky turned upon the threshold and looked about her with devouring eyes.\n\n\"If it ain't here in the mornin', miss,\" she said, \"it's been here tonight, anyways, an' I shan't never forget it.\" She looked at each particular thing, as if to commit it to memory. \"The fire was THERE\", pointing with her finger, \"an' the table was before it; an' the lamp was there, an' the light looked rosy red; an' there was a satin cover on your bed, an' a warm rug on the floor, an' everythin' looked beautiful; an'\"--she paused a second, and laid her hand on her stomach tenderly--\"there WAS soup an' sandwiches an' muffins--there WAS.\" And, with this conviction a reality at least, she went away.\n\nThrough the mysterious agency which works in schools and among servants, it was quite well known in the morning that Sara Crewe was in horrible disgrace, that Ermengarde was under punishment, and that Becky would have been packed out of the house before breakfast, but that a scullery maid could not be dispensed with at once. The servants knew that she was allowed to stay because Miss Minchin could not easily find another creature helpless and humble enough to work like a bounden slave for so few shillings a week. The elder girls in the schoolroom knew that if Miss Minchin did not send Sara away it was for practical reasons of her own.\n\n\"She's growing so fast and learning such a lot, somehow,\" said Jessie to Lavinia, \"that she will be given classes soon, and Miss Minchin knows she will have to work for nothing. It was rather nasty of you, Lavvy, to tell about her having fun in the garret. How did you find it out?\"\n\n\"I got it out of Lottie. She's such a baby she didn't know she was telling me. There was nothing nasty at all in speaking to Miss Minchin. I felt it my duty\"--priggishly. \"She was being deceitful. And it's ridiculous that she should look so grand, and be made so much of, in her rags and tatters!\"\n\n\"What were they doing when Miss Minchin caught them?\"\n\n\"Pretending some silly thing. Ermengarde had taken up her hamper to share with Sara and Becky. She never invites us to share things. Not that I care, but it's rather vulgar of her to share with servant girls in attics. I wonder Miss Minchin didn't turn Sara out--even if she does want her for a teacher.\"\n\n\"If she was turned out where would she go?\" inquired Jessie, a trifle anxiously.\n\n\"How do I know?\" snapped Lavinia. \"She'll look rather queer when she comes into the schoolroom this morning, I should think-- after what's happened. She had no dinner yesterday, and she's not to have any today.\"\n\nJessie was not as ill-natured as she was silly. She picked up her book with a little jerk.\n\n\"Well, I think it's horrid,\" she said. \"They've no right to starve her to death.\"\n\nWhen Sara went into the kitchen that morning the cook looked askance at her, and so did the housemaids; but she passed them hurriedly. She had, in fact, overslept herself a little, and as Becky had done the same, neither had had time to see the other, and each had come downstairs in haste.\n\nSara went into the scullery. Becky was violently scrubbing a kettle, and was actually gurgling a little song in her throat. She looked up with a wildly elated face.\n\n\"It was there when I wakened, miss--the blanket,\" she whispered excitedly. \"It was as real as it was last night.\"\n\n\"So was mine,\" said Sara. \"It is all there now--all of it. While I was dressing I ate some of the cold things we left.\"\n\n\"Oh, laws! Oh, laws!\" Becky uttered the exclamation in a sort of rapturous groan, and ducked her head over her kettle just in time, as the cook came in from the kitchen.\n\nMiss Minchin had expected to see in Sara, when she appeared in the schoolroom, very much what Lavinia had expected to see. Sara had always been an annoying puzzle to her, because severity never made her cry or look frightened. When she was scolded she stood still and listened politely with a grave face; when she was punished she performed her extra tasks or went without her meals, making no complaint or outward sign of rebellion. The very fact that she never made an impudent answer seemed to Miss Minchin a kind of impudence in itself. But after yesterday's deprivation of meals, the violent scene of last night, the prospect of hunger today, she must surely have broken down. It would be strange indeed if she did not come downstairs with pale cheeks and red eyes and an unhappy, humbled face.\n\nMiss Minchin saw her for the first time when she entered the schoolroom to hear the little French class recite its lessons and superintend its exercises. And she came in with a springing step, color in her cheeks, and a smile hovering about the corners of her mouth. It was the most astonishing thing Miss Minchin had ever known. It gave her quite a shock. What was the child made of? What could such a thing mean? She called her at once to her desk.\n\n\"You do not look as if you realize that you are in disgrace,\" she said. \"Are you absolutely hardened?\"\n\nThe truth is that when one is still a child--or even if one is grown up--and has been well fed, and has slept long and softly and warm; when one has gone to sleep in the midst of a fairy story, and has wakened to find it real, one cannot be unhappy or even look as if one were; and one could not, if one tried, keep a glow of joy out of one's eyes. Miss Minchin was almost struck dumb by the look of Sara's eyes when she made her perfectly respectful answer.\n\n\"I beg your pardon, Miss Minchin,\" she said; \"I know that I am in disgrace.\"\n\n\"Be good enough not to forget it and look as if you had come into a fortune. It is an impertinence. And remember you are to have no food today.\"\n\n\"Yes, Miss Minchin,\" Sara answered; but as she turned away her heart leaped with the memory of what yesterday had been. \"If the Magic had not saved me just in time,\" she thought, \"how horrible it would have been!\"\n\n\"She can't be very hungry,\" whispered Lavinia. \"Just look at her. Perhaps she is pretending she has had a good breakfast\"-- with a spiteful laugh.\n\n\"She's different from other people,\" said Jessie, watching Sara with her class. \"Sometimes I'm a bit frightened of her.\"\n\n\"Ridiculous thing!\" ejaculated Lavinia.\n\nAll through the day the light was in Sara's face, and the color in her cheek. The servants cast puzzled glances at her, and whispered to each other, and Miss Amelia's small blue eyes wore an expression of bewilderment. What such an audacious look of well-being, under august displeasure could mean she could not understand. It was, however, just like Sara's singular obstinate way. She was probably determined to brave the matter out.\n\nOne thing Sara had resolved upon, as she thought things over. The wonders which had happened must be kept a secret, if such a thing were possible. If Miss Minchin should choose to mount to the attic again, of course all would be discovered. But it did not seem likely that she would do so for some time at least, unless she was led by suspicion. Ermengarde and Lottie would be watched with such strictness that they would not dare to steal out of their beds again. Ermengarde could be told the story and trusted to keep it secret. If Lottie made any discoveries, she could be bound to secrecy also. Perhaps the Magic itself would help to hide its own marvels.\n\n\"But whatever happens,\" Sara kept saying to herself all day-- \"WHATEVER happens, somewhere in the world there is a heavenly kind person who is my friend--my friend. If I never know who it is--if I never can even thank him--I shall never feel quite so lonely. Oh, the Magic was GOOD to me!\"\n\nIf it was possible for weather to be worse than it had been the day before, it was worse this day--wetter, muddier, colder. There were more errands to be done, the cook was more irritable, and, knowing that Sara was in disgrace, she was more savage. But what does anything matter when one's Magic has just proved itself one's friend. Sara's supper of the night before had given her strength, she knew that she should sleep well and warmly, and, even though she had naturally begun to be hungry again before evening, she felt that she could bear it until breakfast- time on the following day, when her meals would surely be given to her again. It was quite late when she was at last allowed to go upstairs. She had been told to go into the schoolroom and study until ten o'clock, and she had become interested in her work, and remained over her books later.\n\nWhen she reached the top flight of stairs and stood before the attic door, it must be confessed that her heart beat rather fast.\n\n\"Of course it MIGHT all have been taken away,\" she whispered, trying to be brave. \"It might only have been lent to me for just that one awful night. But it WAS lent to me--I had it. It was real.\"\n\nShe pushed the door open and went in. Once inside, she gasped slightly, shut the door, and stood with her back against it looking from side to side.\n\nThe Magic had been there again. It actually had, and it had done even more than before. The fire was blazing, in lovely leaping flames, more merrily than ever. A number of new things had been brought into the attic which so altered the look of it that if she had not been past doubting she would have rubbed her eyes. Upon the low table another supper stood--this time with cups and plates for Becky as well as herself; a piece of bright, heavy, strange embroidery covered the battered mantel, and on it some ornaments had been placed. All the bare, ugly things which could be covered with draperies had been concealed and made to look quite pretty. Some odd materials of rich colors had been fastened against the wall with fine, sharp tacks--so sharp that they could be pressed into the wood and plaster without hammering. Some brilliant fans were pinned up, and there were several large cushions, big and substantial enough to use as seats. A wooden box was covered with a rug, and some cushions lay on it, so that it wore quite the air of a sofa.\n\nSara slowly moved away from the door and simply sat down and looked and looked again.\n\n\"It is exactly like something fairy come true,\" she said. \"There isn't the least difference. I feel as if I might wish for anything--diamonds or bags of gold--and they would appear! THAT wouldn't be any stranger than this. Is this my garret? Am I the same cold, ragged, damp Sara? And to think I used to pretend and pretend and wish there were fairies! The one thing I always wanted was to see a fairy story come true. I am LIVING in a fairy story. I feel as if I might be a fairy myself, and able to turn things into anything else.\"\n\nShe rose and knocked upon the wall for the prisoner in the next cell, and the prisoner came.\n\nWhen she entered she almost dropped in a heap upon the floor. For a few seconds she quite lost her breath.\n\n\"Oh, laws!\" she gasped. \"Oh, laws, miss!\"\n\n\"You see,\" said Sara.\n\nOn this night Becky sat on a cushion upon the hearth rug and had a cup and saucer of her own.\n\nWhen Sara went to bed she found that she had a new thick mattress and big downy pillows. Her old mattress and pillow had been removed to Becky's bedstead, and, consequently, with these additions Becky had been supplied with unheard-of comfort.\n\n\"Where does it all come from?\" Becky broke forth once. \"Laws, who does it, miss?\"\n\n\"Don't let us even ASK,\" said Sara. \"If it were not that I want to say, `Oh, thank you,' I would rather not know. It makes it more beautiful.\"\n\nFrom that time life became more wonderful day by day. The fairy story continued. Almost every day something new was done. Some new comfort or ornament appeared each time Sara opened the door at night, until in a short time the attic was a beautiful little room full of all sorts of odd and luxurious things. The ugly walls were gradually entirely covered with pictures and draperies, ingenious pieces of folding furniture appeared, a bookshelf was hung up and filled with books, new comforts and conveniences appeared one by one, until there seemed nothing left to be desired. When Sara went downstairs in the morning, the remains of the supper were on the table; and when she returned to the attic in the evening, the magician had removed them and left another nice little meal. Miss Minchin was as harsh and insulting as ever, Miss Amelia as peevish, and the servants were as vulgar and rude. Sara was sent on errands in all weathers, and scolded and driven hither and thither; she was scarcely allowed to speak to Ermengarde and Lottie; Lavinia sneered at the increasing shabbiness of her clothes; and the other girls stared curiously at her when she appeared in the schoolroom. But what did it all matter while she was living in this wonderful mysterious story? It was more romantic and delightful than anything she had ever invented to comfort her starved young soul and save herself from despair. Sometimes, when she was scolded, she could scarcely keep from smiling.\n\n\"If you only knew!\" she was saying to herself. \"If you only knew!\"\n\nThe comfort and happiness she enjoyed were making her stronger, and she had them always to look forward to. If she came home from her errands wet and tired and hungry, she knew she would",
      "summary": "The chapter describes the continuation of the magical transformations in Sara's attic room. Each night, new comforts and luxuries appear, turning the once-bare attic into a beautiful and cozy space. Despite Miss Minchin's continued harsh treatment, Sara finds strength and happiness in her secret magical world. The mystery of who is behind these changes deepens, and Sara chooses to embrace the magic without questioning its source.",
      "prominence": 90,
      "key_characters": [
        {
          "name": "Sara Crewe",
          "description": "A former wealthy student now working as a servant at Miss Minchin's seminary.",
          "summary": "Sara continues to experience magical transformations in her attic room, finding strength and joy in her secret world. She maintains her resilience and positive attitude despite ongoing mistreatment from Miss Minchin and others."
        },
        {
          "name": "Miss Minchin",
          "description": "The strict headmistress of the seminary.",
          "summary": "Miss Minchin remains harsh and insulting towards Sara, unaware of the magical changes occurring in the attic. She is puzzled by Sara's continued positive demeanor despite the punishments and poor treatment."
        },
        {
          "name": "Becky",
          "description": "The scullery maid at Miss Minchin's seminary.",
          "summary": "Becky continues to share in Sara's magical experiences, enjoying the comforts of the transformed attic alongside her friend."
        }
      ],
      "chapter": "The Visitor",
      "conversation": [
        {
          "scenario": "Sara returns to her attic room each night to find new magical transformations and comforts.",
          "topic": "The ongoing magical changes in the attic",
          "key_characters": [
            {
              "name": "Sara Crewe",
              "thought": "What new wonders will I find tonight? This magic gives me strength to face each day."
            },
            {
              "name": "Becky",
              "thought": "I can't wait to see what Miss Sara's magic has brought us this time!"
            }
          ],
          "dialogues": [
            {
              "character": "Environment",
              "message": "Sara enters the attic room, her eyes widening as she takes in the new magical changes. The room is even more beautiful and comfortable than before."
            },
            {
              "character": "Sara Crewe",
              "message": "[This is beyond my wildest dreams!] (gasping in delight) \"Oh, it's happened again! Look, Becky!\""
            },
            {
              "character": "Becky",
              "message": "[It's like a fairy tale come true!] (eyes wide with wonder) \"Laws, miss! It gets more beautiful every night!\""
            },
            {
              "character": "Sara Crewe",
              "message": "[I wish I could thank our mysterious benefactor.] \"I wonder who could be behind all this. It feels like we're living in a fairy story.\""
            },
            {
              "character": "Becky",
              "message": "[I'm so grateful to be part of this magic.] \"Do you think we'll ever know who's doin' it, miss?\""
            },
            {
              "character": "Sara Crewe",
              "message": "[It's better to keep the mystery alive.] \"Perhaps it's better not to know, Becky. The magic is more beautiful when it's a mystery.\""
            },
            {
              "character": "Environment",
              "message": "The girls explore the room, discovering new comforts and luxuries that have appeared since the previous night."
            },
            {
              "character": "Sara Crewe",
              "message": "[This gives me strength to face Miss Minchin.] \"You know, Becky, no matter how hard things are downstairs, I can always look forward to coming back here.\""
            },
            {
              "character": "Becky",
              "message": "[Miss Sara is so strong and kind.] \"You're so brave, miss. I don't know how you do it.\""
            },
            {
              "character": "Sara Crewe",
              "message": "[I must keep this magic a secret to protect it.] \"We must be careful not to let anyone suspect anything. This is our secret world, Becky.\""
            },
            {
              "character": "Becky",
              "message": "[I'll guard this secret with my life.] \"I won't breathe a word, miss. Not even in me sleep!\""
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "The next afternoon three members of the Large Family sat in the Indian gentleman's library, doing their best to cheer him up. They had been allowed to come in to perform this office because he had specially invited them. He had been living in a state of suspense for some time, and today he was waiting for a certain event very anxiously. This event was the return of Mr. Carmichael from Moscow. His stay there had been prolonged from week to week. On his first arrival there, he had not been able satisfactorily to trace the family he had gone in search of. When he felt at last sure that he had found them and had gone to their house, he had been told that they were absent on a journey. His efforts to reach them had been unavailing, so he had decided to remain in Moscow until their return. Mr. Carrisford sat in his reclining chair, and Janet sat on the floor beside him. He was very fond of Janet. Nora had found a footstool, and Donald was astride the tiger's head which ornamented the rug made of the animal's skin. It must be owned that he was riding it rather violently.\n\n\"Don't chirrup so loud, Donald,\" Janet said. \"When you come to cheer an ill person up you don't cheer him up at the top of your voice. Perhaps cheering up is too loud, Mr. Carrisford?\" turning to the Indian gentleman.\n\nBut he only patted her shoulder.\n\n\"No, it isn't,\" he answered. \"And it keeps me from thinking too much.\"\n\n\"I'm going to be quiet,\" Donald shouted. \"We'll all be as quiet as mice.\"\n\n\"Mice don't make a noise like that,\" said Janet.\n\nDonald made a bridle of his handkerchief and bounced up and down on the tiger's head.\n\n\"A whole lot of mice might,\" he said cheerfully. \"A thousand mice might.\"\n\n\"I don't believe fifty thousand mice would,\" said Janet, severely; \"and we have to be as quiet as one mouse.\"\n\nMr. Carrisford laughed and patted her shoulder again.\n\n\"Papa won't be very long now,\" she said. \"May we talk about the lost little girl?\"\n\n\"I don't think I could talk much about anything else just now,\" the Indian gentleman answered, knitting his forehead with a tired look.\n\n\"We like her so much,\" said Nora. \"We call her the little un- fairy princess.\"\n\n\"Why?\" the Indian gentleman inquired, because the fancies of the Large Family always made him forget things a little.\n\nIt was Janet who answered.\n\n\"It is because, though she is not exactly a fairy, she will be so rich when she is found that she will be like a princess in a fairy tale. We called her the fairy princess at first, but it didn't quite suit.\"\n\n\"Is it true,\" said Nora, \"that her papa gave all his money to a friend to put in a mine that had diamonds in it, and then the friend thought he had lost it all and ran away because he felt as if he was a robber?\"\n\n\"But he wasn't really, you know,\" put in Janet, hastily.\n\nThe Indian gentleman took hold of her hand quickly.\n\n\"No, he wasn't really,\" he said.\n\n\"I am sorry for the friend,\" Janet said; \"I can't help it. He didn't mean to do it, and it would break his heart. I am sure it would break his heart.\"\n\n\"You are an understanding little woman, Janet,\" the Indian gentleman said, and he held her hand close.\n\n\"Did you tell Mr. Carrisford,\" Donald shouted again, \"about the little-girl-who-isn't-a-beggar? Did you tell him she has new nice clothes? P'r'aps she's been found by somebody when she was lost.\"\n\n\"There's a cab!\" exclaimed Janet. \"It's stopping before the door. It is papa!\"\n\nThey all ran to the windows to look out.\n\n\"Yes, it's papa,\" Donald proclaimed. \"But there is no little girl.\"\n\nAll three of them incontinently fled from the room and tumbled into the hall. It was in this way they always welcomed their father. They were to be heard jumping up and down, clapping their hands, and being caught up and kissed.\n\nMr. Carrisford made an effort to rise and sank back again.\n\n\"It is no use,\" he said. \"What a wreck I am!\"\n\nMr. Carmichael's voice approached the door.\n\n\"No, children,\" he was saying; \"you may come in after I have talked to Mr. Carrisford. Go and play with Ram Dass.\"\n\nThen the door opened and he came in. He looked rosier than ever, and brought an atmosphere of freshness and health with him; but his eyes were disappointed and anxious as they met the invalid's look of eager question even as they grasped each other's hands.\n\n\"What news?\" Mr. Carrisford asked. \"The child the Russian people adopted?\"\n\n\"She is not the child we are looking for,\" was Mr. Carmichael's answer. \"She is much younger than Captain Crewe's little girl. Her name is Emily Carew. I have seen and talked to her. The Russians were able to give me every detail.\"\n\nHow wearied and miserable the Indian gentleman looked! His hand dropped from Mr. Carmichael's.\n\n\"Then the search has to be begun over again,\" he said. \"That is all. Please sit down.\"\n\nMr. Carmichael took a seat. Somehow, he had gradually grown fond of this unhappy man. He was himself so well and happy, and so surrounded by cheerfulness and love, that desolation and broken health seemed pitifully unbearable things. If there had been the sound of just one gay little high-pitched voice in the house, it would have been so much less forlorn. And that a man should be compelled to carry about in his breast the thought that he had seemed to wrong and desert a child was not a thing one could face.\n\n\"Come, come,\" he said in his cheery voice; \"we'll find her yet.\"\n\n\"We must begin at once. No time must be lost,\" Mr. Carrisford fretted. \"Have you any new suggestion to make--any whatsoever?\"\n\nMr. Carmichael felt rather restless, and he rose and began to pace the room with a thoughtful, though uncertain face.\n\n\"Well, perhaps,\" he said. \"I don't know what it may be worth. The fact is, an idea occurred to me as I was thinking the thing over in the train on the journey from Dover.\"\n\n\"What was it? If she is alive, she is somewhere.\"\n\n\"Yes; she is SOMEWHERE. We have searched the schools in Paris. Let us give up Paris and begin in London. That was my idea--to search London.\"\n\n\"There are schools enough in London,\" said Mr. Carrisford. Then he slightly started, roused by a recollection. \"By the way, there is one next door.\"\n\n\"Then we will begin there. We cannot begin nearer than next door.\"\n\n\"No,\" said Carrisford. \"There is a child there who interests me; but she is not a pupil. And she is a little dark, forlorn creature, as unlike poor Crewe as a child could be.\"\n\nPerhaps the Magic was at work again at that very moment--the beautiful Magic. It really seemed as if it might be so. What was it that brought Ram Dass into the room--even as his master spoke--salaaming respectfully, but with a scarcely concealed touch of excitement in his dark, flashing eyes?\n\n\"Sahib,\" he said, \"the child herself has come--the child the sahib felt pity for. She brings back the monkey who had again run away to her attic under the roof. I have asked that she remain. It was my thought that it would please the sahib to see and speak with her.\"\n\n\"Who is she?\" inquired Mr. Carmichael.\n\n\"God knows,\" Mr. Carrrisford answered. \"She is the child I spoke of. A little drudge at the school.\" He waved his hand to Ram Dass, and addressed him. \"Yes, I should like to see her. Go and bring her in.\" Then he turned to Mr. Carmichael. \"While you have been away,\" he explained, \"I have been desperate. The days were so dark and long. Ram Dass told me of this child's miseries, and together we invented a romantic plan to help her. I suppose it was a childish thing to do; but it gave me something to plan and think of. Without the help of an agile, soft-footed Oriental like Ram Dass, however, it could not have been done.\"\n\nThen Sara came into the room. She carried the monkey in her arms, and he evidently did not intend to part from her, if it could be helped. He was clinging to her and chattering, and the interesting excitement of finding herself in the Indian gentleman's room had brought a flush to Sara's cheeks.\n\n\"Your monkey ran away again,\" she said, in her pretty voice. \"He came to my garret window last night, and I took him in because it was so cold. I would have brought him back if it had not been so late. I knew you were ill and might not like to be disturbed.\"\n\nThe Indian gentleman's hollow eyes dwelt on her with curious interest.\n\n\"That was very thoughtful of you,\" he said.\n\nSara looked toward Ram Dass, who stood near the door.\n\n\"Shall I give him to the Lascar?\" she asked.\n\n\"How do you know he is a Lascar?\" said the Indian gentleman, smiling a little.\n\n\"Oh, I know Lascars,\" Sara said, handing over the reluctant monkey. \"I was born in India.\"\n\nThe Indian gentleman sat upright so suddenly, and with such a change of expression, that she was for a moment quite startled.\n\n\"You were born in India,\" he exclaimed, \"were you? Come here.\" And he held out his hand.\n\nSara went to him and laid her hand in his, as he seemed to want to take it. She stood still, and her green-gray eyes met his wonderingly. Something seemed to be the matter with him.\n\n\"You live next door?\" he demanded.\n\n\"Yes; I live at Miss Minchin's seminary.\"\n\n\"But you are not one of her pupils?\"\n\nA strange little smile hovered about Sara's mouth. She hesitated a moment.\n\n\"I don't think I know exactly WHAT I am,\" she replied.\n\n\"Why not?\"\n\n\"At first I was a pupil, and a parlor boarder; but now--\"\n\n\"You were a pupil! What are you now?\"\n\nThe queer little sad smile was on Sara's lips again.\n\n\"I sleep in the attic, next to the scullery maid,\" she said. \"I run errands for the cook--I do anything she tells me; and I teach the little ones their lessons.\"\n\n\"Question her, Carmichael,\" said Mr. Carrisford, sinking back as if he had lost his strength. \"Question her; I cannot.\"\n\nThe big, kind father of the Large Family knew how to question little girls. Sara realized how much practice he had had when he spoke to her in his nice, encouraging voice.\n\n\"What do you mean by `At first,' my child?\" he inquired.\n\n\"When I was first taken there by my papa.\"\n\n\"Where is your papa?\"\n\n\"He died,\" said Sara, very quietly. \"He lost all his money and there was none left for me. There was no one to take care of me or to pay Miss Minchin.\"\n\n\"Carmichael!\" the Indian gentleman cried out loudly. \"Carmichael!\"\n\n\"We must not frighten her,\" Mr. Carmichael said aside to him in a quick, low voice. And he added aloud to Sara, \"So you were sent up into the attic, and made into a little drudge. That was about it, wasn't it?\"\n\n\"There was no one to take care of me,\" said Sara. \"There was no money; I belong to nobody.\"\n\n\"How did your father lose his money?\" the Indian gentleman broke in breathlessly.\n\n\"He did not lose it himself,\" Sara answered, wondering still more each moment. \"He had a friend he was very fond of--he was very fond of him. It was his friend who took his money. He trusted his friend too much.\"\n\nThe Indian gentleman's breath came more quickly.\n\n\"The friend might have MEANT to do no harm,\" he said. \"It might have happened through a mistake.\"\n\nSara did not know how unrelenting her quiet young voice sounded as she answered. If she had known, she would surely have tried to soften it for the Indian gentleman's sake.\n\n\"The suffering was just as bad for my papa,\" she said. It killed him.\"\n\n\"What was your father's name?\" the Indian gentleman said. \"Tell me.\"\n\n\"His name was Ralph Crewe,\" Sara answered, feeling startled. \"Captain Crewe. He died in India.\"\n\nThe haggard face contracted, and Ram Dass sprang to his master's side.\n\n\"Carmichael,\" the invalid gasped, \"it is the child--the child!\"\n\nFor a moment Sara thought he was going to die. Ram Dass poured out drops from a bottle, and held them to his lips. Sara stood near, trembling a little. She looked in a bewildered way at Mr. Carmichael.\n\n\"What child am I?\" she faltered.\n\n\"He was your father's friend,\" Mr. Carmichael answered her. \"Don't be frightened. We have been looking for you for two years.\"\n\nSara put her hand up to her forehead, and her mouth trembled. She spoke as if she were in a dream.\n\n\"And I was at Miss Minchin's all the while,\" she half whispered. \"Just on the other side of the wall.\"\n\n18\n\n\"I Tried Not to Be\"\n\nIt was pretty, comfortable Mrs. Carmichael who explained everything. She was sent for at once, and came across the square to take Sara into her warm arms and make clear to her all that had happened. The excitement of the totally unexpected discovery had been temporarily almost overpowering to Mr. Carrisford in his weak condition.\n\n\"Upon my word,\" he said faintly to Mr. Carmichael, when it was suggested that the little girl should go into another room. \"I feel as if I do not want to lose sight of her.\"\n\n\"I will take care of her,\" Janet said, \"and mamma will come in a few minutes.\" And it was Janet who led her away.\n\n\"We're so glad you are found,\" she said. \"You don't know how glad we are that you are found.\"\n\nDonald stood with his hands in his pockets, and gazed at Sara with reflecting and self-reproachful eyes.\n\n\"If I'd just asked what your name was when I gave you my sixpence,\" he said, \"you would have told me it was Sara Crewe, and then you would have been found in a minute.\" Then Mrs. Carmichael came in. She looked very much moved, and suddenly took Sara in her arms and kissed her.\n\n\"You look bewildered, poor child,\" she said. \"And it is not to be wondered at.\"\n\nSara could only think of one thing.\n\n\"Was he,\" she said, with a glance toward the closed door of the library--\"was HE the wicked friend? Oh, do tell me!\"\n\nMrs. Carmichael was crying as she kissed her again. She felt as if she ought to be kissed very often because she had not been kissed for so long.\n\n\"He was not wicked, my dear,\" she answered. \"He did not really lose your papa's money. He only thought he had lost it; and because he loved him so much his grief made him so ill that for a time he was not in his right mind. He almost died of brain fever, and long before he began to recover your poor papa was dead.\"\n\n\"And he did not know where to find me,\" murmured Sara. \"And I was so near.\" Somehow, she could not forget that she had been so near.\n\n\"He believed you were in school in France,\" Mrs. Carmichael explained. \"And he was continually misled by false clues. He has looked for you everywhere. When he saw you pass by, looking so sad and neglected, he did not dream that you were his friend's poor child; but because you were a little girl, too, he was sorry for you, and wanted to make you happier. And he told Ram Dass to climb into your attic window and try to make you comfortable.\"\n\nSara gave a start of joy; her whole look changed.\n\n\"Did Ram Dass bring the things?\" she cried out. \"Did he tell Ram Dass to do it? Did he make the dream that came true?\"\n\n\"Yes, my dear--yes! He is kind and good, and he was sorry for you, for little lost Sara Crewe's sake.\"\n\nThe library door opened and Mr. Carmichael appeared, calling Sara to him with a gesture.\n\n\"Mr. Carrisford is better already,\" he said. \"He wants you to come to him.\"\n\nSara did not wait. When the Indian gentleman looked at her as she entered, he saw that her face was all alight.\n\nShe went and stood before his chair, with her hands clasped together against her breast.\n\n\"You sent the things to me,\" she said, in a joyful emotional little voice, \"the beautiful, beautiful things? YOU sent them!\"\n\n\"Yes, poor, dear child, I did,\" he answered her. He was weak and broken with long illness and trouble, but he looked at her with the look she remembered in her father's eyes--that look of loving her and wanting to take her in his arms. It made her kneel down by him, just as she used to kneel by her father when they were the dearest friends and lovers in the world.\n\n\"Then it is you who are my friend,\" she said; \"it is you who are my friend!\" And she dropped her face on his thin hand and kissed it again and again.\n\n\"The man will be himself again in three weeks,\" Mr. Carmichael said aside to his wife. \"Look at his face already.\"\n\nIn fact, he did look changed. Here was the \"Little Missus,\" and he had new things to think of and plan for already. In the first place, there was Miss Minchin. She must be interviewed and told of the change which had taken place in the fortunes of her pupil.\n\nSara was not to return to the seminary at all. The Indian gentleman was very determined upon that point. She must remain where she was, and Mr. Carmichael should go and see Miss Minchin himself.\n\n\"I am glad I need not go back,\" said Sara. \"She will be very angry. She does not like me; though perhaps it is my fault, because I do not like her.\"\n\nBut, oddly enough, Miss Minchin made it unnecessary for Mr. Carmichael to go to her, by actually coming in search of her pupil herself. She had wanted Sara for something, and on inquiry had heard an astonishing thing. One of the housemaids had seen her steal out of the area with something hidden under her cloak, and had also seen her go up the steps of the next door and enter the house.\n\n\"What does she mean!\" cried Miss Minchin to Miss Amelia.\n\n\"I don't know, I'm sure, sister,\" answered Miss Amelia. \"Unless she has made friends with him because he has lived in India.\"\n\n\"It would be just like her to thrust herself upon him and try to gain his sympathies in some such impertinent fashion,\" said Miss Minchin. \"She must have been in the house for two hours. I will not allow such presumption. I shall go and inquire into the matter, and apologize for her intrusion.\"\n\nSara was sitting on a footstool close to Mr. Carrisford's knee, and listening to some of the many things he felt it necessary to try to explain to her, when Ram Dass announced the visitor's arrival.\n\nSara rose involuntarily, and became rather pale; but Mr. Carrisford saw that she stood quietly, and showed none of the ordinary signs of child terror.\n\nMiss Minchin entered the room with a sternly dignified manner. She was correctly and well dressed, and rigidly polite.\n\n\"I am sorry to disturb Mr. Carrisford,\" she said; \"but I have explanations to make. I am Miss Minchin, the proprietress of the Young Ladies' Seminary next door.\"\n\nThe Indian gentleman looked at her for a moment in silent scrutiny. He was a man who had naturally a rather hot temper, and he did not wish it to get too much the better of him.\n\n\"So you are Miss Minchin?\" he said.\n\n\"I am, sir.\"\n\n\"In that case,\" the Indian gentleman replied, \"you have arrived at the right time. My solicitor, Mr. Carmichael, was just on the point of going to see you.\"\n\nMr. Carmichael bowed slightly, and Miiss Minchin looked from him to Mr. Carrisford in amazement.\n\n\"Your solicitor!\" she said. \"I do not understand. I have come here as a matter of duty. I have just discovered that you have been intruded upon through the forwardness of one of my pupils--a charity pupil. I came to explain that she intruded without my knowledge.\" She turned upon Sara. \"Go home at once,\" she commanded indignantly. \"You shall be severely punished. Go home at once.\"\n\nThe Indian gentleman drew Sara to his side and patted her hand.\n\n\"She is not going.\"\n\nMiss Minchin felt rather as if she must be losing her senses.\n\n\"Not going!\" she repeated.\n\n\"No,\" said Mr. Carrisford. \"She is not going home--if you give your house that name. Her home for the future will be with me.\"\n\nMiss Minchin fell back in amazed indignation.\n\n\"With YOU! With YOU sir! What does this mean?\"\n\n\"Kindly explain the matter, Carmichael,\" said the Indian gentleman; \"and get it over as quickly as possible.\" And he made Sara sit down again, and held her hands in his--which was another trick of her papa's.\n\nThen Mr. Carmichael explained--in the quiet, level-toned, steady manner of a man who knew his subject, and all its legal significance, which was a thing Miss Minchin understood as a business woman, and did not enjoy.\n\n\"Mr. Carrisford, madam,\" he said, \"was an intimate friend of the late Captain Crewe. He was his partner in certain large investments. The fortune which Captain Crewe supposed he had lost has been recovered, and is now in Mr. Carrisford's hands.\"\n\n\"The fortune!\" cried Miss Minchin; and she really lost color as she uttered the exclamation. \"Sara's fortune!\"\n\n\"It WILL be Sara's fortune,\" replied Mr. Carmichael, rather coldly. \"It is Sara's fortune now, in fact. Certain events have increased it enormously. The diamond mines have retrieved themselves.\"\n\n\"The diamond mines!\" Miss Minchin gasped out. If this was true, nothing so horrible, she felt, had ever happened to her since she was born.\n\n\"The diamond mines,\" Mr. Carmichael repeated, and he could not help adding, with a rather sly, unlawyer-like smile, \"There are not many princesses, Miss Minchin, who are richer than your little charity pupil, Sara Crewe, will be. Mr. Carrisford has been searching for her for nearly two years; he has found her at last, and he will keep her.\"\n\nAfter which he asked Miss Minchin to sit down while he explained matters to her fully, and went into such detail as was necessary to make it quite clear to her that Sara's future was an assured one, and that what had seemed to be lost was to be restored to her tenfold; also, that she had in Mr. Carrisford a guardian as well as a friend.\n\nMiss Minchin was not a clever woman, and in her excitement she was silly enough to make one desperate effort to regain what she could not help seeing she had lost through her worldly folly.\n\n\"He found her under my care,\" she protested. \"I have done everything for her. But for me she should have starved in the streets.\"\n\nHere the Indian gentleman lost his temper.\n\n\"As to starving in the streets,\" he said, \"she might have starved more comfortably there than in your attic.\"\n\n\"Captain Crewe left her in my charge,\" Miss Minchin argued. \"She must return to it until she is of age. She can be a parlor boarder again. She must finish her education. The law will interfere in my behalf\"\n\n\"Come, come, Miss Minchin,\" Mr. Carmichael interposed, \"the law will do nothing of the sort. If Sara herself wishes to return to you, I dare say Mr. Carrisford might not refuse to allow it. But that rests with Sara.\"\n\n\"Then,\" said Miss Minchin, \"I appeal to Sara. I have not spoiled you, perhaps,\" she said awkwardly to the little girl; \"but you know that your papa was pleased with your progress. And--ahem--I have always been fond of you.\"\n\nSara's green-gray eyes fixed themselves on her with the quiet, clear look Miss Minchin particularly disliked.\n\n\"Have YOU, Miss Minchin?\" she said. \"I did not know that.\"\n\nMiss Minchin reddened and drew herself up.\n\n\"You ought to have known it,\" said she; \"but children, unfortunately, never know what is best for them. Amelia and I always said you were the cleverest child in the school. Will you not do your duty to your poor papa and come home with me?\"\n\nSara took a step toward her and stood still.",
      "summary": "In this pivotal chapter, Sara's true identity is revealed to Mr. Carrisford, who turns out to be her father's old friend. The search for Sara ends as she is discovered living next door at Miss Minchin's seminary. Mr. Carrisford and the Carmichaels explain the situation to Sara, revealing that her fortune has been recovered. Miss Minchin arrives to confront Sara but is informed of the dramatic change in circumstances. The chapter ends with Miss Minchin attempting to convince Sara to return to the seminary, while Sara considers her response.",
      "prominence": 95,
      "key_characters": [
        {
          "name": "Sara Crewe",
          "description": "A young girl who has been living in poverty at Miss Minchin's seminary.",
          "summary": "Sara is revealed to be the long-lost girl Mr. Carrisford has been searching for. She learns about her recovered fortune and finds a new home with her father's friend."
        },
        {
          "name": "Mr. Carrisford",
          "description": "The Indian gentleman who has been searching for Sara.",
          "summary": "Mr. Carrisford finally discovers that Sara is the child he's been looking for. He is overjoyed and immediately takes on the role of her guardian."
        },
        {
          "name": "Miss Minchin",
          "description": "The strict headmistress of the seminary where Sara has been living.",
          "summary": "Miss Minchin is shocked to learn of Sara's change in fortune. She attempts to maintain control over Sara but is ultimately powerless in the face of the legal and financial changes."
        },
        {
          "name": "Mr. Carmichael",
          "description": "Mr. Carrisford's solicitor and a member of the Large Family.",
          "summary": "Mr. Carmichael explains the legal and financial situation to Miss Minchin, firmly establishing Sara's new position and rights."
        }
      ],
      "chapter": "\"It Is the Child!\"",
      "conversation": [
        {
          "scenario": "Sara has just been revealed as the lost child Mr. Carrisford has been searching for, and Miss Minchin has arrived to confront the situation.",
          "topic": "Sara's true identity and future",
          "key_characters": [
            {
              "name": "Sara Crewe",
              "thought": "I can hardly believe this is happening. My life has changed so suddenly, but I must remain calm and consider my response carefully."
            },
            {
              "name": "Mr. Carrisford",
              "thought": "At last, I've found my dear friend's daughter. I must protect her and ensure her future is secure."
            },
            {
              "name": "Miss Minchin",
              "thought": "This is a disaster. I must find a way to maintain some control over the situation and not lose face completely."
            }
          ],
          "dialogues": [
            {
              "character": "Environment",
              "message": "The tension in the room is palpable as Miss Minchin stands before Mr. Carrisford, Sara, and Mr. Carmichael. The revelation of Sara's true identity and fortune hangs in the air."
            },
            {
              "character": "Miss Minchin",
              "message": "[I must assert my authority here.] (speaking sternly) \"I have come here as a matter of duty. I have just discovered that you have been intruded upon through the forwardness of one of my pupilsa charity pupil.\""
            },
            {
              "character": "Mr. Carrisford",
              "message": "[I won't let this woman intimidate Sara any longer.] (firmly) \"She is not going. Her home for the future will be with me.\""
            },
            {
              "character": "Miss Minchin",
              "message": "[This can't be happening!] (incredulously) \"With YOU! With YOU sir! What does this mean?\""
            },
            {
              "character": "Mr. Carmichael",
              "message": "[It's time to set the record straight.] \"Mr. Carrisford was an intimate friend of the late Captain Crewe. The fortune which Captain Crewe supposed he had lost has been recovered, and is now in Mr. Carrisford's hands.\""
            },
            {
              "character": "Miss Minchin",
              "message": "[I'm losing control of everything.] (desperately) \"Captain Crewe left her in my charge. She must return to it until she is of age. She can be a parlor boarder again. She must finish her education. The law will interfere in my behalf.\""
            },
            {
              "character": "Mr. Carmichael",
              "message": "[This woman is grasping at straws.] (calmly) \"The law will do nothing of the sort. If Sara herself wishes to return to you, I dare say Mr. Carrisford might not refuse to allow it. But that rests with Sara.\""
            },
            {
              "character": "Miss Minchin",
              "message": "[I must appeal to the girl directly.] (awkwardly) \"Then I appeal to Sara. I have not spoiled you, perhaps, but you know that your papa was pleased with your progress. AndahemI have always been fond of you.\""
            },
            {
              "character": "Sara Crewe",
              "message": "[She's never shown me fondness before.] (calmly) \"Have YOU, Miss Minchin? I did not know that.\""
            },
            {
              "character": "Miss Minchin",
              "message": "[How dare she question me!] (flustered) \"You ought to have known it. Will you not do your duty to your poor papa and come home with me?\""
            },
            {
              "character": "Sara Crewe",
              "message": "[I need to think carefully about my response.] (taking a step forward and pausing)"
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "When Sara entered the schoolroom the next morning everybody looked at her with wide, interested eyes. By that time every pupil-- from Lavinia Herbert, who was nearly thirteen and felt quite grown up, to Lottie Legh, who was only just four and the baby of the school-- had heard a great deal about her. They knew very certainly that she was Miss Minchin's show pupil and was considered a credit to the establishment. One or two of them had even caught a glimpse of her French maid, Mariette, who had arrived the evening before. Lavinia had managed to pass Sara's room when the door was open, and had seen Mariette opening a box which had arrived late from some shop.\n\n\"It was full of petticoats with lace frills on them--frills and frills,\" she whispered to her friend Jessie as she bent over her geography. \"I saw her shaking them out. I heard Miss Minchin say to Miss Amelia that her clothes were so grand that they were ridiculous for a child. My mamma says that children should be dressed simply. She has got one of those petticoats on now. I saw it when she sat down.\"\n\n\"She has silk stockings on!\" whispered Jessie, bending over her geography also. \"And what little feet! I never saw such little feet.\"\n\n\"Oh,\" sniffed Lavinia, spitefully, \"that is the way her slippers are made. My mamma says that even big feet can be made to look small if you have a clever shoemaker. I don't think she is pretty at all. Her eyes are such a queer color.\"\n\n\"She isn't pretty as other pretty people are,\" said Jessie, stealing a glance across the room; \"but she makes you want to look at her again. She has tremendously long eyelashes, but her eyes are almost green.\"\n\nSara was sitting quietly in her seat, waiting to be told what to do. She had been placed near Miss Minchin's desk. She was not abashed at all by the many pairs of eyes watching her. She was interested and looked back quietly at the children who looked at her. She wondered what they were thinking of, and if they liked Miss Minchin, and if they cared for their lessons, and if any of them had a papa at all like her own. She had had a long talk with Emily about her papa that morning.\n\n\"He is on the sea now, Emily,\" she had said. \"We must be very great friends to each other and tell each other things. Emily, look at me. You have the nicest eyes I ever saw--but I wish you could speak.\"\n\nShe was a child full of imaginings and whimsical thoughts, and one of her fancies was that there would be a great deal of comfort in even pretending that Emily was alive and really heard and understood. After Mariette had dressed her in her dark-blue schoolroom frock and tied her hair with a dark-blue ribbon, she went to Emily, who sat in a chair of her own, and gave her a book.\n\n\"You can read that while I am downstairs,\" she said; and, seeing Mariette looking at her curiously, she spoke to her with a serious little face.\n\n\"What I believe about dolls,\" she said, \"is that they can do things they will not let us know about. Perhaps, really, Emily can read and talk and walk, but she will only do it when people are out of the room. That is her secret. You see, if people knew that dolls could do things, they would make them work. So, perhaps, they have promised each other to keep it a secret. If you stay in the room, Emily will just sit there and stare; but if you go out, she will begin to read, perhaps, or go and look out of the window. Then if she heard either of us coming, she would just run back and jump into her chair and pretend she had been there all the time.\"\n\n\"Comme elle est drole!\" Mariette said to herself, and when she went downstairs she told the head housemaid about it. But she had already begun to like this odd little girl who had such an intelligent small face and such perfect manners. She had taken care of children before who were not so polite. Sara was a very fine little person, and had a gentle, appreciative way of saying, \"If you please, Mariette,\" \"Thank you, Mariette,\" which was very charming. Mariette told the head housemaid that she thanked her as if she was thanking a lady.\n\n\"Elle a l'air d'une princesse, cette petite,\" she said. Indeed, she was very much pleased with her new little mistress and liked her place greatly.\n\nAfter Sara had sat in her seat in the schoolroom for a few minutes, being looked at by the pupils, Miss Minchin rapped in a dignified manner upon her desk.\n\n\"Young ladies,\" she said, \"I wish to introduce you to your new companion.\" All the little girls rose in their places, and Sara rose also. \"I shall expect you all to be very agreeable to Miss Crewe; she has just come to us from a great distance--in fact, from India. As soon as lessons are over you must make each other's acquaintance.\"\n\nThe pupils bowed ceremoniously, and Sara made a little curtsy, and then they sat down and looked at each other again.\n\n\"Sara,\" said Miss Minchin in her schoolroom manner, \"come here to me.\"\n\nShe had taken a book from the desk and was turning over its leaves. Sara went to her politely.\n\n\"As your papa has engaged a French maid for you,\" she began, \"I conclude that he wishes you to make a special study of the French language.\"\n\nSara felt a little awkward.\n\n\"I think he engaged her,\" she said, \"because he--he thought I would like her, Miss Minchin.\"\n\n\"I am afraid,\" said Miss Minchin, with a slightly sour smile, \"that you have been a very spoiled little girl and always imagine that things are done because you like them. My impression is that your papa wished you to learn French.\"\n\nIf Sara had been older or less punctilious about being quite polite to people, she could have explained herself in a very few words. But, as it was, she felt a flush rising on her cheeks. Miss Minchin was a very severe and imposing person, and she seemed so absolutely sure that Sara knew nothing whatever of French that she felt as if it would be almost rude to correct her. The truth was that Sara could not remember the time when she had not seemed to know French. Her father had often spoken it to her when she had been a baby. Her mother had been a French woman, and Captain Crewe had loved her language, so it happened that Sara had always heard and been familiar with it.\n\n\"I--I have never really learned French, but--but--\" she began, trying shyly to make herself clear.\n\nOne of Miss Minchin's chief secret annoyances was that she did not speak French herself, and was desirous of concealing the irritating fact. She, therefore, had no intention of discussing the matter and laying herself open to innocent questioning by a new little pupil.\n\n\"That is enough,\" she said with polite tartness. \"If you have not learned, you must begin at once. The French master, Monsieur Dufarge, will be here in a few minutes. Take this book and look at it until he arrives.\"\n\nSara's cheeks felt warm. She went back to her seat and opened the book. She looked at the first page with a grave face. She knew it would be rude to smile, and she was very determined not to be rude. But it was very odd to find herself expected to study a page which told her that \"le pere\" meant \"the father,\" and \"la mere\" meant \"the mother.\"\n\nMiss Minchin glanced toward her scrutinizingly.\n\n\"You look rather cross, Sara,\" she said. \"I am sorry you do not like the idea of learning French.\"\n\n\"I am very fond of it,\" answered Sara, thinking she would try again; \"but--\"\n\n\"You must not say `but' when you are told to do things,\" said Miss Minchin. \"Look at your book again.\"\n\nAnd Sara did so, and did not smile, even when she found that \"le fils\" meant \"the son,\" and \"le frere\" meant \"the brother.\"\n\n\"When Monsieur Dufarge comes,\" she thought, \"I can make him understand.\"\n\nMonsieur Dufarge arrived very shortly afterward. He was a very nice, intelligent, middle-aged Frenchman, and he looked interested when his eyes fell upon Sara trying politely to seem absorbed in her little book of phrases.\n\n\"Is this a new pupil for me, madame?\" he said to Miss Minchin. \"I hope that is my good fortune.\"\n\n\"Her papa--Captain Crewe--is very anxious that she should begin the language. But I am afraid she has a childish prejudice against it. She does not seem to wish to learn,\" said Miss Minchin.\n\n\"I am sorry of that, mademoiselle,\" he said kindly to Sara. \"Perhaps, when we begin to study together, I may show you that it is a charming tongue.\"\n\nLittle Sara rose in her seat. She was beginning to feel rather desperate, as if she were almost in disgrace. She looked up into Monsieur Dufarge's face with her big, green-gray eyes, and they were quite innocently appealing. She knew that he would understand as soon as she spoke. She began to explain quite simply in pretty and fluent French. Madame had not understood. She had not learned French exactly--not out of books--but her papa and other people had always spoken it to her, and she had read it and written it as she had read and written English. Her papa loved it, and she loved it because he did. Her dear mamma, who had died when she was born, had been French. She would be glad to learn anything monsieur would teach her, but what she had tried to explain to madame was that she already knew the words in this book-- and she held out the little book of phrases.\n\nWhen she began to speak Miss Minchin started quite violently and sat staring at her over her eyeglasses, almost indignantly, until she had finished. Monsieur Dufarge began to smile, and his smile was one of great pleasure. To hear this pretty childish voice speaking his own language so simply and charmingly made him feel almost as if he were in his native land--which in dark, foggy days in London sometimes seemed worlds away. When she had finished, he took the phrase book from her, with a look almost affectionate. But he spoke to Miss Minchin.\n\n\"Ah, madame,\" he said, \"there is not much I can teach her. She has not LEARNED French; she is French. Her accent is exquisite.\"\n\n\"You ought to have told me,\" exclaimed Miss Minchin, much mortified, turning to Sara.\n\n\"I--I tried,\" said Sara. \"I--I suppose I did not begin right.\"\n\nMiss Minchin knew she had tried, and that it had not been her fault that she was not allowed to explain. And when she saw that the pupils had been listening and that Lavinia and Jessie were giggling behind their French grammars, she felt infuriated.\n\n\"Silence, young ladies!\" she said severely, rapping upon the desk. \"Silence at once!\"\n\nAnd she began from that minute to feel rather a grudge against her show pupil.",
      "summary": "Sara attends her first French lesson at Miss Minchin's seminary. Despite Miss Minchin's assumption that Sara doesn't know French, Sara demonstrates her fluency, impressing Monsieur Dufarge but irritating Miss Minchin. This incident sets the tone for Sara's relationship with Miss Minchin and her position in the school.",
      "prominence": 80,
      "key_characters": [
        {
          "name": "Sara Crewe",
          "description": "A new student at Miss Minchin's seminary, recently arrived from India.",
          "summary": "Sara demonstrates her fluency in French, surprising her teachers and classmates. She remains polite and composed despite the awkward situation."
        },
        {
          "name": "Miss Minchin",
          "description": "The stern headmistress of the seminary.",
          "summary": "Miss Minchin is embarrassed by Sara's unexpected French skills and begins to feel resentment towards her new pupil."
        },
        {
          "name": "Monsieur Dufarge",
          "description": "The French teacher at the seminary.",
          "summary": "Monsieur Dufarge is pleasantly surprised by Sara's French abilities and praises her accent and fluency."
        }
      ],
      "chapter": "A French Lesson",
      "conversation": [
        {
          "scenario": "Sara's first French lesson at Miss Minchin's seminary",
          "topic": "Sara's unexpected fluency in French",
          "key_characters": [
            {
              "name": "Sara Crewe",
              "thought": "I hope I can explain that I already know French without seeming impolite or boastful."
            },
            {
              "name": "Miss Minchin",
              "thought": "This child seems rather stubborn. I'll have to be firm with her."
            },
            {
              "name": "Monsieur Dufarge",
              "thought": "I wonder how much French this new student actually knows."
            }
          ],
          "dialogues": [
            {
              "character": "Miss Minchin",
              "message": "[I must establish my authority over this new pupil.] Sara, come here to me."
            },
            {
              "character": "Sara Crewe",
              "message": "[I should be polite and obedient.] (walks to Miss Minchin's desk) Yes, Miss Minchin?"
            },
            {
              "character": "Miss Minchin",
              "message": "[I'll make it clear that she's here to learn, not to be pampered.] As your papa has engaged a French maid for you, I conclude that he wishes you to make a special study of the French language."
            },
            {
              "character": "Sara Crewe",
              "message": "[I should try to explain without contradicting her.] I think he engaged her because he thought I would like her, Miss Minchin."
            },
            {
              "character": "Miss Minchin",
              "message": "[This child is too used to getting her way.] I am afraid that you have been a very spoiled little girl and always imagine that things are done because you like them. My impression is that your papa wished you to learn French."
            },
            {
              "character": "Sara Crewe",
              "message": "[I feel embarrassed, but I should try to explain.] II have never really learned French, butbut"
            },
            {
              "character": "Miss Minchin",
              "message": "[I won't tolerate any excuses.] That is enough. If you have not learned, you must begin at once. Take this book and look at it until Monsieur Dufarge arrives."
            },
            {
              "character": "Monsieur Dufarge",
              "message": "[A new student, how interesting.] Is this a new pupil for me, madame? I hope that is my good fortune."
            },
            {
              "character": "Miss Minchin",
              "message": "[I'll inform him of the situation as I see it.] Her papaCaptain Creweis very anxious that she should begin the language. But I am afraid she has a childish prejudice against it. She does not seem to wish to learn."
            },
            {
              "character": "Monsieur Dufarge",
              "message": "[I should be encouraging to the child.] I am sorry of that, mademoiselle. Perhaps, when we begin to study together, I may show you that it is a charming tongue."
            },
            {
              "character": "Sara Crewe",
              "message": "[I must explain properly now.] (begins speaking in fluent French) Madame had not understood. I had not learned French exactlynot out of booksbut my papa and other people had always spoken it to me, and I had read it and written it as I had read and written English."
            },
            {
              "character": "Monsieur Dufarge",
              "message": "[I'm pleasantly surprised and impressed.] (smiling) Ah, madame, there is not much I can teach her. She has not LEARNED French; she is French. Her accent is exquisite."
            },
            {
              "character": "Miss Minchin",
              "message": "[I feel embarrassed and annoyed.] You ought to have told me!"
            },
            {
              "character": "Sara Crewe",
              "message": "[I feel bad for causing trouble.] II tried. II suppose I did not begin right."
            },
            {
              "character": "Environment",
              "message": "The other students in the classroom giggle and whisper, creating a tense atmosphere."
            },
            {
              "character": "Miss Minchin",
              "message": "[I must regain control of the situation.] (rapping on her desk) Silence, young ladies! Silence at once!"
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "On that first morning, when Sara sat at Miss Minchin's side, aware that the whole schoolroom was devoting itself to observing her, she had noticed very soon one little girl, about her own age, who looked at her very hard with a pair of light, rather dull, blue eyes. She was a fat child who did not look as if she were in the least clever, but she had a good-naturedly pouting mouth. Her flaxen hair was braided in a tight pigtail, tied with a ribbon, and she had pulled this pigtail around her neck, and was biting the end of the ribbon, resting her elbows on the desk, as she stared wonderingly at the new pupil. When Monsieur Dufarge began to speak to Sara, she looked a little frightened; and when Sara stepped forward and, looking at him with the innocent, appealing eyes, answered him, without any warning, in French, the fat little girl gave a startled jump, and grew quite red in her awed amazement. Having wept hopeless tears for weeks in her efforts to remember that \"la mere\" meant \"the mother,\" and \"le pere,\" \"the father,\"-- when one spoke sensible English--it was almost too much for her suddenly to find herself listening to a child her own age who seemed not only quite familiar with these words, but apparently knew any number of others, and could mix them up with verbs as if they were mere trifles.\n\nShe stared so hard and bit the ribbon on her pigtail so fast that she attracted the attention of Miss Minchin, who, feeling extremely cross at the moment, immediately pounced upon her.\n\n\"Miss St. John!\" she exclaimed severely. \"What do you mean by such conduct? Remove your elbows! Take your ribbon out of your mouth! Sit up at once!\"\n\nUpon which Miss St. John gave another jump, and when Lavinia and Jessie tittered she became redder than ever--so red, indeed, that she almost looked as if tears were coming into her poor, dull, childish eyes; and Sara saw her and was so sorry for her that she began rather to like her and want to be her friend. It was a way of hers always to want to spring into any fray in which someone was made uncomfortable or unhappy.\n\n\"If Sara had been a boy and lived a few centuries ago,\" her father used to say, \"she would have gone about the country with her sword drawn, rescuing and defending everyone in distress. She always wants to fight when she sees people in trouble.\"\n\nSo she took rather a fancy to fat, slow, little Miss St. John, and kept glancing toward her through the morning. She saw that lessons were no easy matter to her, and that there was no danger of her ever being spoiled by being treated as a show pupil. Her French lesson was a pathetic thing. Her pronunciation made even Monsieur Dufarge smile in spite of himself, and Lavinia and Jessie and the more fortunate girls either giggled or looked at her in wondering disdain. But Sara did not laugh. She tried to look as if she did not hear when Miss St. John called \"le bon pain,\" \"lee bong pang.\" She had a fine, hot little temper of her own, and it made her feel rather savage when she heard the titters and saw the poor, stupid, distressed child's face.\n\n\"It isn't funny, really,\" she said between her teeth, as she bent over her book. \"They ought not to laugh.\"\n\nWhen lessons were over and the pupils gathered together in groups to talk, Sara looked for Miss St. John, and finding her bundled rather disconsolately in a window-seat, she walked over to her and spoke. She only said the kind of thing little girls always say to each other by way of beginning an acquaintance, but there was something friendly about Sara, and people always felt it.\n\n\"What is your name?\" she said.\n\nTo explain Miss St. John's amazement one must recall that a new pupil is, for a short time, a somewhat uncertain thing; and of this new pupil the entire school had talked the night before until it fell asleep quite exhausted by excitement and contradictory stories. A new pupil with a carriage and a pony and a maid, and a voyage from India to discuss, was not an ordinary acquaintance.\n\n\"My name's Ermengarde St. John,\" she answered.\n\n\"Mine is Sara Crewe,\" said Sara. \"Yours is very pretty. It sounds like a story book.\"\n\n\"Do you like it?\" fluttered Ermengarde. \"I--I like yours.\"\n\nMiss St. John's chief trouble in life was that she had a clever father. Sometimes this seemed to her a dreadful calamity. If you have a father who knows everything, who speaks seven or eight languages, and has thousands of volumes which he has apparently learned by heart, he frequently expects you to be familiar with the contents of your lesson books at least; and it is not improbable that he will feel you ought to be able to remember a few incidents of history and to write a French exercise. Ermengarde was a severe trial to Mr. St. John. He could not understand how a child of his could be a notably and unmistakably dull creature who never shone in anything.\n\n\"Good heavens!\" he had said more than once, as he stared at her, \"there are times when I think she is as stupid as her Aunt Eliza!\"\n\nIf her Aunt Eliza had been slow to learn and quick to forget a thing entirely when she had learned it, Ermengarde was strikingly like her. She was the monumental dunce of the school, and it could not be denied.\n\n\"She must be MADE to learn,\" her father said to Miss Minchin.\n\nConsequently Ermengarde spent the greater part of her life in disgrace or in tears. She learned things and forgot them; or, if she remembered them, she did not understand them. So it was natural that, having made Sara's acquaintance, she should sit and stare at her with profound admiration.\n\n\"You can speak French, can't you?\" she said respectfully.\n\nSara got on to the window-seat, which was a big, deep one, and, tucking up her feet, sat with her hands clasped round her knees.\n\n\"I can speak it because I have heard it all my life,\" she answered. \"You could speak it if you had always heard it.\"\n\n\"Oh, no, I couldn't,\" said Ermengarde. \"I NEVER could speak it!\"\n\n\"Why?\" inquired Sara, curiously.\n\nErmengarde shook her head so that the pigtail wobbled.\n\n\"You heard me just now,\" she said. \"I'm always like that. I can't SAY the words. They're so queer.\"\n\nShe paused a moment, and then added with a touch of awe in her voice, \"You are CLEVER, aren't you?\"\n\nSara looked out of the window into the dingy square, where the sparrows were hopping and twittering on the wet, iron railings and the sooty branches of the trees. She reflected a few moments. She had heard it said very often that she was \"clever,\" and she wondered if she was--and IF she was, how it had happened.\n\n\"I don't know,\" she said. \"I can't tell.\" Then, seeing a mournful look on the round, chubby face, she gave a little laugh and changed the subject.\n\n\"Would you like to see Emily?\" she inquired.\n\n\"Who is Emily?\" Ermengarde asked, just as Miss Minchin had done.\n\n\"Come up to my room and see,\" said Sara, holding out her hand.\n\nThey jumped down from the window-seat together, and went upstairs.\n\n\"Is it true,\" Ermengarde whispered, as they went through the hall- -\"is it true that you have a playroom all to yourself?\"\n\n\"Yes,\" Sara answered. \"Papa asked Miss Minchin to let me have one, because--well, it was because when I play I make up stories and tell them to myself, and I don't like people to hear me. It spoils it if I think people listen.\"\n\nThey had reached the passage leading to Sara's room by this time, and Ermengarde stopped short, staring, and quite losing her breath.\n\n\"You MAKE up stories!\" she gasped. \"Can you do that--as well as speak French? CAN you?\"\n\nSara looked at her in simple surprise.\n\n\"Why, anyone can make up things,\" she said. \"Have you never tried?\"\n\nShe put her hand warningly on Ermengarde's.\n\n\"Let us go very quietly to the door,\" she whispered, \"and then I will open it quite suddenly; perhaps we may catch her.\"\n\nShe was half laughing, but there was a touch of mysterious hope in her eyes which fascinated Ermengarde, though she had not the remotest idea what it meant, or whom it was she wanted to \"catch,\" or why she wanted to catch her. Whatsoever she meant, Ermengarde was sure it was something delightfully exciting. So, quite thrilled with expectation, she followed her on tiptoe along the passage. They made not the least noise until they reached the door. Then Sara suddenly turned the handle, and threw it wide open. Its opening revealed the room quite neat and quiet, a fire gently burning in the grate, and a wonderful doll sitting in a chair by it, apparently reading a book.\n\n\"Oh, she got back to her seat before we could see her!\" Sara explained. \"Of course they always do. They are as quick as lightning.\"\n\nErmengarde looked from her to the doll and back again.\n\n\"Can she--walk?\" she asked breathlessly.\n\n\"Yes,\" answered Sara. \"At least I believe she can. At least I PRETEND I believe she can. And that makes it seem as if it were true. Have you never pretended things?\"\n\n\"No,\" said Ermengarde. \"Never. I--tell me about it.\"\n\nShe was so bewitched by this odd, new companion that she actually stared at Sara instead of at Emily--notwithstanding that Emily was the most attractive doll person she had ever seen.\n\n\"Let us sit down,\" said Sara, \"and I will tell you. It's so easy that when you begin you can't stop. You just go on and on doing it always. And it's beautiful. Emily, you must listen. This is Ermengarde St. John, Emily. Ermengarde, this is Emily. Would you like to hold her?\"\n\n\"Oh, may I?\" said Ermengarde. \"May I, really? She is beautiful!\" And Emily was put into her arms.\n\nNever in her dull, short life had Miss St. John dreamed of such an hour as the one she spent with the queer new pupil before they heard the lunch-bell ring and were obliged to go downstairs.\n\nSara sat upon the hearth-rug and told her strange things. She sat rather huddled up, and her green eyes shone and her cheeks flushed. She told stories of the voyage, and stories of India; but what fascinated Ermengarde the most was her fancy about the dolls who walked and talked, and who could do anything they chose when the human beings were out of the room, but who must keep their powers a secret and so flew back to their places \"like lightning\" when people returned to the room.\n\n\"WE couldn't do it,\" said Sara, seriously. \"You see, it's a kind of magic.\"\n\nOnce, when she was relating the story of the search for Emily, Ermengarde saw her face suddenly change. A cloud seemed to pass over it and put out the light in her shining eyes. She drew her breath in so sharply that it made a funny, sad little sound, and then she shut her lips and held them tightly closed, as if she was determined either to do or NOT to do something. Ermengarde had an idea that if she had been like any other little girl, she might have suddenly burst out sobbing and crying. But she did not.\n\n\"Have you a--a pain?\" Ermengarde ventured.\n\n\"Yes,\" Sara answered, after a moment's silence. \"But it is not in my body.\" Then she added something in a low voice which she tried to keep quite steady, and it was this: \"Do you love your father more than anything else in all the whole world?\"\n\nErmengarde's mouth fell open a little. She knew that it would be far from behaving like a respectable child at a select seminary to say that it had never occurred to you that you COULD love your father, that you would do anything desperate to avoid being left alone in his society for ten minutes. She was, indeed, greatly embarrassed.\n\n\"I--I scarcely ever see him,\" she stammered. \"He is always in the library--reading things.\"\n\n\"I love mine more than all the world ten times over,\" Sara said. \"That is what my pain is. He has gone away.\"\n\nShe put her head quietly down on her little, huddled-up knees, and sat very still for a few minutes.\n\n\"She's going to cry out loud,\" thought Ermengarde, fearfully.\n\nBut she did not. Her short, black locks tumbled about her ears, and she sat still. Then she spoke without lifting her head.\n\n\"I promised him I would bear it,\" she said. \"And I will. You have to bear things. Think what soldiers bear! Papa is a soldier. If there was a war he would have to bear marching and thirstiness and, perhaps, deep wounds. And he would never say a word--not one word.\"\n\nErmengarde could only gaze at her, but she felt that she was beginning to adore her. She was so wonderful and different from anyone else.\n\nPresently, she lifted her face and shook back her black locks, with a queer little smile.\n\n\"If I go on talking and talking,\" she said, \"and telling you things about pretending, I shall bear it better. You don't forget, but you bear it better.\"\n\nErmengarde did not know why a lump came into her throat and her eyes felt as if tears were in them.\n\n\"Lavinia and Jessie are `best friends,'\" she said rather huskily. \"I wish we could be `best friends.' Would you have me for yours? You're clever, and I'm the stupidest child in the school, but I-- oh, I do so like you!\"\n\n\"I'm glad of that,\" said Sara. \"It makes you thankful when you",
      "summary": "Sara befriends Ermengarde St. John, a struggling student at the seminary. Sara shows kindness to Ermengarde, shares her imagination and stories, and they form a friendship. Sara also reveals her deep love for her father and her determination to be brave in his absence.",
      "prominence": 85,
      "key_characters": [
        {
          "name": "Sara Crewe",
          "description": "A kind and imaginative new student at the seminary.",
          "summary": "Sara befriends Ermengarde, sharing her stories and imagination. She also reveals her strong love for her father and her resolve to be brave in his absence."
        },
        {
          "name": "Ermengarde St. John",
          "description": "A struggling student at the seminary, daughter of a clever father.",
          "summary": "Ermengarde is fascinated by Sara's intelligence and kindness. She forms a friendship with Sara and is in awe of her imagination and ability to tell stories."
        }
      ],
      "chapter": "Ermengarde",
      "conversation": [
        {
          "scenario": "Sara and Ermengarde's first private conversation in Sara's room",
          "topic": "Sara's imagination and her relationship with her father",
          "key_characters": [
            {
              "name": "Sara Crewe",
              "thought": "I hope I can help Ermengarde feel more comfortable and maybe even inspire her a little."
            },
            {
              "name": "Ermengarde St. John",
              "thought": "Sara is so different from anyone I've ever met. I wonder if she'll really want to be friends with someone like me."
            }
          ],
          "dialogues": [
            {
              "character": "Ermengarde St. John",
              "message": "[I'm so curious about Sara's abilities.] You can speak French, can't you?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I should explain without sounding boastful.] I can speak it because I have heard it all my life. You could speak it if you had always heard it."
            },
            {
              "character": "Ermengarde St. John",
              "message": "[I feel discouraged about my own abilities.] Oh, no, I couldn't. I NEVER could speak it!"
            },
            {
              "character": "Sara Crewe",
              "message": "[I'm curious about her struggles.] Why?"
            },
            {
              "character": "Ermengarde St. John",
              "message": "[I feel embarrassed about my difficulties.] You heard me just now. I'm always like that. I can't SAY the words. They're so queer."
            },
            {
              "character": "Ermengarde St. John",
              "message": "[I'm in awe of Sara's abilities.] You are CLEVER, aren't you?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I'm not sure how to respond to that.] (looking out the window) I don't know. I can't tell."
            },
            {
              "character": "Sara Crewe",
              "message": "[I should change the subject to something more fun.] Would you like to see Emily?"
            },
            {
              "character": "Ermengarde St. John",
              "message": "[I'm curious but confused.] Who is Emily?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I'm excited to share my imagination with her.] Come up to my room and see. (holds out her hand)"
            },
            {
              "character": "Environment",
              "message": "The girls walk through the hall and up the stairs to Sara's room."
            },
            {
              "character": "Ermengarde St. John",
              "message": "[I'm amazed by everything about Sara.] Is it true that you have a playroom all to yourself?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I should explain without sounding boastful.] Yes. Papa asked Miss Minchin to let me have one, because when I play I make up stories and tell them to myself, and I don't like people to hear me. It spoils it if I think people listen."
            },
            {
              "character": "Ermengarde St. John",
              "message": "[I'm amazed by Sara's abilities.] You MAKE up stories! Can you do thatas well as speak French? CAN you?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I'm surprised by her reaction.] Why, anyone can make up things. Have you never tried?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I want to share my imagination with her.] Let us go very quietly to the door. Then I will open it quite suddenly; perhaps we may catch her."
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "Not very long after this a very exciting thing happened. Not only Sara, but the entire school, found it exciting, and made it the chief subject of conversation for weeks after it occurred. In one of his letters Captain Crewe told a most interesting story. A friend who had been at school with him when he was a boy had unexpectedly come to see him in India. He was the owner of a large tract of land upon which diamonds had been found, and he was engaged in developing the mines. If all went as was confidently expected, he would become possessed of such wealth as it made one dizzy to think of; and because he was fond of the friend of his school days, he had given him an opportunity to share in this enormous fortune by becoming a partner in his scheme. This, at least, was what Sara gathered from his letters. It is true that any other business scheme, however magnificent, would have had but small attraction for her or for the schoolroom; but \"diamond mines\" sounded so like the Arabian Nights that no one could be indifferent. Sara thought them enchanting, and painted pictures, for Ermengarde and Lottie, of labyrinthine passages in the bowels of the earth, where sparkling stones studded the walls and roofs and ceilings, and strange, dark men dug them out with heavy picks. Ermengarde delighted in the story, and Lottie insisted on its being ret",
      "summary": "Captain Crewe informs Sara about a potentially lucrative diamond mining opportunity with an old school friend. This news excites the entire school, especially Sara, who uses her imagination to paint vivid pictures of the diamond mines for her friends Ermengarde and Lottie.",
      "prominence": 90,
      "key_characters": [
        {
          "name": "Sara Crewe",
          "description": "The imaginative and kind-hearted protagonist of the story.",
          "summary": "Sara receives exciting news from her father about diamond mines and uses her imagination to share enchanting stories about them with her friends."
        },
        {
          "name": "Captain Crewe",
          "description": "Sara's father, currently in India.",
          "summary": "Captain Crewe writes to Sara about a potentially lucrative diamond mining opportunity with an old school friend."
        },
        {
          "name": "Ermengarde",
          "description": "One of Sara's friends at the school.",
          "summary": "Ermengarde delights in Sara's stories about the diamond mines."
        },
        {
          "name": "Lottie",
          "description": "Another of Sara's friends at the school.",
          "summary": "Lottie is fascinated by Sara's stories about the diamond mines and insists on hearing them repeatedly."
        }
      ],
      "chapter": "The Diamond Mines",
      "conversation": [
        {
          "scenario": "Sara sharing the news about the diamond mines with her friends at the school",
          "topic": "Captain Crewe's letter about the diamond mining opportunity",
          "key_characters": [
            {
              "name": "Sara Crewe",
              "thought": "I'm so excited about Papa's news. I can't wait to share these wonderful stories with my friends!"
            },
            {
              "name": "Ermengarde",
              "thought": "Sara always has the most interesting stories. I wonder what she'll tell us about the diamond mines."
            },
            {
              "name": "Lottie",
              "thought": "I love Sara's stories! I hope this one is as magical as the others."
            }
          ],
          "dialogues": [
            {
              "character": "Sara Crewe",
              "message": "[I can barely contain my excitement!] Oh, girls! You won't believe the news I've received from my papa!"
            },
            {
              "character": "Ermengarde",
              "message": "[I'm always eager to hear Sara's news.] What is it, Sara? Tell us!"
            },
            {
              "character": "Sara Crewe",
              "message": "[I take a deep breath, preparing to share the exciting tale.] Papa has written to me about a most extraordinary opportunity. His old school friend has discovered diamond mines!"
            },
            {
              "character": "Lottie",
              "message": "[My eyes widen with wonder.] Diamond mines? Like in fairy tales?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I nod enthusiastically.] Yes, just like in fairy tales! Can you imagine vast tunnels underground, filled with sparkling gems?"
            },
            {
              "character": "Ermengarde",
              "message": "[I'm fascinated but a bit confused.] But how does your papa's friend finding diamond mines affect him?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I explain, trying to remember all the details from Papa's letter.] Papa's friend has invited him to be a partner in the diamond mining venture. If all goes well, they could become incredibly wealthy!"
            },
            {
              "character": "Lottie",
              "message": "[I clap my hands excitedly.] Oh, Sara! You'll be even richer than you are now!"
            },
            {
              "character": "Sara Crewe",
              "message": "[I pause, considering this.] I suppose so, but that's not what excites me most. I keep imagining the mines themselves. Shall I tell you what I picture?"
            },
            {
              "character": "Ermengarde",
              "message": "[I lean forward eagerly.] Oh, yes please! Your stories are always so vivid."
            },
            {
              "character": "Sara Crewe",
              "message": "[I close my eyes, letting my imagination take over.] Picture dark, winding tunnels deep beneath the earth. The walls glitter with tiny points of light - diamonds embedded in the rock. Strange, dark men with picks chip away at the stone, revealing more and more sparkling treasures..."
            },
            {
              "character": "Environment",
              "message": "As Sara speaks, her voice takes on a dreamy quality. Ermengarde and Lottie listen, spellbound, their eyes wide with wonder."
            },
            {
              "character": "Lottie",
              "message": "[I'm completely captivated.] Oh, Sara! It sounds magical. Tell us more!"
            },
            {
              "character": "Sara Crewe",
              "message": "[I smile, pleased by their reaction.] Well, imagine caverns as big as this entire school, with ceilings so high you can barely see them. And everywhere you look, diamonds sparkle like stars..."
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "When Sara entered the holly-hung schoolroom in the afternoon, she did so as the head of a sort of procession. Miss Minchin, in her grandest silk dress, led her by the hand. A manservant followed, carrying the box containing the Last Doll, a housemaid carried a second box, and Becky brought up the rear, carrying a third and wearing a clean apron and a new cap. Sara would have much preferred to enter in the usual way, but Miss Minchin had sent for her, and, after an interview in her private sitting room, had expressed her wishes.\n\n\"This is not an ordinary occasion,\" she said. \"I do not desire that it should be treated as one.\"\n\nSo Sara was led grandly in and felt shy when, on her entry, the big girls stared at her and touched each other's elbows, and the little ones began to squirm joyously in their seats.\n\n\"Silence, young ladies!\" said Miss Minchin, at the murmur which arose. \"James, place the box on the table and remove the lid. Emma, put yours upon a chair. Becky!\" suddenly and severely.\n\nBecky had quite forgotten herself in her excitement, and was grinning at Lottie, who was wriggling with rapturous expectation. She almost dropped her box, the disapproving voice so startled her, and her frightened, bobbing curtsy of apology was so funny that Lavinia and Jessie tittered.\n\n\"It is not your place to look at the young ladies,\" said Miss Minchin. \"You forget yourself. Put your box down.\"\n\nBecky obeyed with alarmed haste and hastily backed toward the door.\n\n\"You may leave us,\" Miss Minchin announced to the servants with a wave of her hand.\n\nBecky stepped aside respectfully to allow the superior servants to pass out first. She could not help casting a longing glance at the box on the table. Something made of blue satin was peeping from between the folds of tissue paper.\n\n\"If you please, Miss Minchin,\" said Sara, suddenly, \"mayn't Becky stay?\"\n\nIt was a bold thing to do. Miss Minchin was betrayed into something like a slight jump. Then she put her eyeglass up, and gazed at her show pupil disturbedly.\n\n\"Becky!\" she exclaimed. \"My dearest Sara!\"\n\nSara advanced a step toward her.\n\n\"I want her because I know she will like to see the presents,\" she explained. \"She is a little girl, too, you know.\"\n\nMiss Minchin was scandalized. She glanced from one figure to the other.\n\n\"My dear Sara,\" she said, \"Becky is the scullery maid. Scullery maids--er--are not little girls.\"\n\nIt really had not occurred to her to think of them in that light. Scullery maids were machines who carried coal scuttles and made fires.\n\n\"But Becky is,\" said Sara. \"And I know she would enjoy herself. Please let her stay--because it is my birthday.\"\n\nMiss Minchin replied with much dignity:\n\n\"As you ask it as a birthday favor--she may stay. Rebecca, thank Miss Sara for her great kindness.\"\n\nBecky had been backing into the corner, twisting the hem of her apron in delighted suspense. She came forward, bobbing curtsies, but between Sara's eyes and her own there passed a gleam of friendly understanding, while her words tumbled over each other.\n\n\"Oh, if you please, miss! I'm that grateful, miss! I did want to see the doll, miss, that I did. Thank you, miss. And thank you, ma'am,\"--turning and making an alarmed bob to Miss Minchin-- \"for letting me take the liberty.\"\n\nMiss Minchin waved her hand again--this time it was in the direction of the corner near the door.\n\n\"Go and stand there,\" she commanded. \"Not too near the young ladies.\"\n\nBecky went to her place, grinning. She did not care where she was sent, so that she might have the luck of being inside the room, instead of being downstairs in the scullery, while these delights were going on. She did not even mind when Miss Minchin cleared her throat ominously and spoke again.\n\n\"Now, young ladies, I have a few words to say to you,\" she announced.\n\n\"She's going to make a speech,\" whispered one of the girls. \"I wish it was over.\"\n\nSara felt rather uncomfortable. As this was her party, it was probable that the speech was about her. It is not agreeable to stand in a schoolroom and have a speech made about you.\n\n\"You are aware, young ladies,\" the speech began--for it was a speech--\"that dear Sara is eleven years old today.\"\n\n\"DEAR Sara!\" murmured Lavinia.\n\n\"Several of you here have also been eleven years old, but Sara's birthdays are rather different from other little girls' birthdays. When she is older she will be heiress to a large fortune, which it will be her duty to spend in a meritorious manner.\"\n\n\"The diamond mines,\" giggled Jessie, in a whisper.\n\nSara did not hear her; but as she stood with her green-gray eyes fixed steadily on Miss Minchin, she felt herself growing rather hot. When Miss Minchin talked about money, she felt somehow that she always hated her--and, of course, it was disrespectful to hate grown-up people.\n\n\"When her dear papa, Captain Crewe, brought her from India and gave her into my care,\" the speech proceeded, \"he said to me, in a jesting way, `I am afraid she will be very rich, Miss Minchin.' My reply was, `Her education at my seminary, Captain Crewe, shall be such as will adorn the largest fortune.' Sara has become my most accomplished pupil. Her French and her dancing are a credit to the seminary. Her manners--which have caused you to call her Princess Sara--are perfect. Her amiability she exhibits by giving you this afternoon's party. I hope you appreciate her generosity. I wish you to express your appreciation of it by saying aloud all together, `Thank you, Sara!'\"\n\nThe entire schoolroom rose to its feet as it had done the morning Sara remembered so well.\n\n\"Thank you, Sara!\" it said, and it must be confessed that Lottie jumped up and down. Sara looked rather shy for a moment. She made a curtsy--and it was a very nice one.\n\n\"Thank you,\" she said, \"for coming to my party.\"\n\n\"Very pretty, indeed, Sara,\" approved Miss Minchin. \"That is what a real princess does when the populace applauds her. Lavinia\"--scathingly--\"the sound you just made was extremely like a snort. If you are jealous of your fellow-pupil, I beg you will express your feelings in some more lady-like manner. Now I will leave you to enjoy yourselves.\"\n\nThe instant she had swept out of the room the spell her presence always had upon them was broken. The door had scarcely closed before every seat was empty. The little girls jumped or tumbled out of theirs; the older ones wasted no time in deserting theirs. There was a rush toward the boxes. Sara had bent over one of them with a delighted face.\n\n\"These are books, I know,\" she said.\n\nThe little children broke into a rueful murmur, and Ermengarde looked aghast.\n\n\"Does your papa send you books for a birthday present?\" she exclaimed. \"Why, he's as bad as mine. Don't open them, Sara.\"\n\n\"I like them,\" Sara laughed, but she turned to the biggest box. When she took out the Last Doll it was so magnificent that the children uttered delighted groans of joy, and actually drew back to gaze at it in breathless rapture.\n\n\"She is almost as big as Lottie,\" someone gasped.\n\nLottie clapped her hands and danced about, giggling.\n\n\"She's dressed for the theater,\" said Lavinia. \"Her cloak is lined with ermine.\"\n\n\"Oh,\" cried Ermengarde, darting forward, \"she has an opera-glass in her hand--a blue-and-gold one!\"\n\n\"Here is her trunk,\" said Sara. \"Let us open it and look at her things.\"\n\nShe sat down upon the floor and turned the key. The children crowded clamoring around her, as she lifted tray after tray and revealed their contents. Never had the schoolroom been in such an uproar. There were lace collars and silk stockings and handkerchiefs; there was a jewel case containing a necklace and a tiara which looked quite as if they were made of real diamonds; there was a long sealskin and muff, there were ball dresses and walking dresses and visiting dresses; there were hats and tea gowns and fans. Even Lavinia and Jessie forgot that they were too elderly to care for dolls, and uttered exclamations of delight and caught up things to look at them.\n\n\"Suppose,\" Sara said, as she stood by the table, putting a large, black-velvet hat on the impassively smiling owner of all these splendors--\"suppose she understands human talk and feels proud of being admired.\"\n\n\"You are always supposing things,\" said Lavinia, and her air was very superior.\n\n\"I know I am,\" answered Sara, undisturbedly. \"I like it. There is nothing so nice as supposing. It's almost like being a fairy. If you suppose anything hard enough it seems as if it were real.\"\n\n\"It's all very well to suppose things if you have everything,\" said Lavinia. \"Could you suppose and pretend if you were a beggar and lived in a garret?\"\n\nSara stopped arranging the Last Doll's ostrich plumes, and looked thoughtful.\n\n\"I BELIEVE I could,\" she said. \"If one was a beggar, one would have to suppose and pretend all the time. But it mightn't be easy.\"\n\nShe often thought afterward how strange it was that just as she had finished saying this--just at that very moment--Miss Amelia came into the room.\n\n\"Sara,\" she said, \"your papa's solicitor, Mr. Barrow, has called to see Miss Minchin, and, as she must talk to him alone and the refreshments are laid in her parlor, you had all better come and have your feast now, so that my sister can have her interview here in the schoolroom.\"\n\nRefreshments were not likely to be disdained at any hour, and many pairs of eyes gleamed. Miss Amelia arranged the procession into decorum, and then, with Sara at her side heading it, she led it away, leaving the Last Doll sitting upon a chair with the glories of her wardrobe scattered about her; dresses and coats hung upon chair backs, piles of lace-frilled petticoats lying upon their seats.\n\nBecky, who was not expected to partake of refreshments, had the indiscretion to linger a moment to look at these beauties--it really was an indiscretion.\n\n\"Go back to your work, Becky,\" Miss Amelia had said; but she had stopped to pick up reverently first a muff and then a coat, and while she stood looking at them adoringly, she heard Miss Minchin upon the threshold, and, being smitten with terror at the thought of being accused of taking liberties, she rashly darted under the table, which hid her by its tablecloth.\n\nMiss Minchin came into the room, accompanied by a sharp- featured, dry little gentleman, who looked rather disturbed. Miss Minchin herself also looked rather disturbed, it must be admitted, and she gazed at the dry little gentleman with an irritated and puzzled expression.\n\nShe sat down with stiff dignity, and waved him to a chair.\n\n\"Pray, be seated, Mr. Barrow,\" she said.\n\nMr. Barrow did not sit down at once. His attention seemed attracted by the Last Doll and the things which surrounded her. He settled his eyeglasses and looked at them in nervous disapproval. The Last Doll herself did not seem to mind this in the least. She merely sat upright and returned his gaze indifferently.\n\n\"A hundred pounds,\" Mr. Barrow remarked succinctly. \"All expensive material, and made at a Parisian modiste's. He spent money lavishly enough, that young man.\"\n\nMiss Minchin felt offended. This seemed to be a disparagement of her best patron and was a liberty.\n\nEven solicitors had no right to take liberties.\n\n\"I beg your pardon, Mr. Barrow,\" she said stiffly. \"I do not understand.\"\n\n\"Birthday presents,\" said Mr. Barrow in the same critical manner, \"to a child eleven years old! Mad extravagance, I call it.\"\n\nMiss Minchin drew herself up still more rigidly.\n\n\"Captain Crewe is a man of fortune,\" she said. \"The diamond mines alone--\"\n\nMr. Barrow wheeled round upon her. \"Diamond mines!\" he broke out. \"There are none! Never were!\"\n\nMiss Minchin actually got up from her chair.\n\n\"What!\" she cried. \"What do you mean?\"\n\n\"At any rate,\" answered Mr. Barrow, quite snappishly, \"it would have been much better if there never had been any.\"\n\n\"Any diamond mines?\" ejaculated Miss Minchin, catching at the back of a chair and feeling as if a splendid dream was fading away from her.\n\n\"Diamond mines spell ruin oftener than they spell wealth,\" said Mr. Barrow. \"When a man is in the hands of a very dear friend and is not a businessman himself, he had better steer clear of the dear friend's diamond mines, or gold mines, or any other kind of mines dear friends want his money to put into. The late Captain Crewe--\"\n\nHere Miss Minchin stopped him with a gasp.\n\n\"The LATE Captain Crewe!\" she cried out. \"The LATE! You don't come to tell me that Captain Crewe is--\"\n\n\"He's dead, ma'am,\" Mr. Barrow answered with jerky brusqueness. \"Died of jungle fever and business troubles combined. The jungle fever might not have killed him if he had not been driven mad by the business troubles, and the business troubles might not have put an end to him if the jungle fever had not assisted. Captain Crewe is dead!\"\n\nMiss Minchin dropped into her chair again. The words he had spoken filled her with alarm.\n\n\"What WERE his business troubles?\" she said. \"What WERE they?\"\n\n\"Diamond mines,\" answered Mr. Barrow, \"and dear friends--and ruin.\"\n\nMiss Minchin lost her breath.\n\n\"Ruin!\" she gasped out.\n\n\"Lost every penny. That young man had too much money. The dear friend was mad on the subject of the diamond mine. He put all his own money into it, and all Captain Crewe's. Then the dear friend ran away--Captain Crewe was already stricken with fever when the news came. The shock was too much for him. He died delirious, raving about his little girl--and didn't leave a penny.\"\n\nNow Miss Minchin understood, and never had she received such a blow in her life. Her show pupil, her show patron, swept away from the Select Seminary at one blow. She felt as if she had been outraged and robbed, and that Captain Crewe and Sara and Mr. Barrow were equally to blame.\n\n\"Do you mean to tell me,\" she cried out, \"that he left NOTHING! That Sara will have no fortune! That the child is a beggar! That she is left on my hands a little pauper instead of an heiress?\"\n\nMr. Barrow was a shrewd businessman, and felt it as well to make his own freedom from responsibility quite clear without any delay.\n\n\"She is certainly left a beggar,\" he replied. \"And she is certainly left on your hands, ma'am--as she hasn't a relation in the world that we know of.\"\n\nMiss Minchin started forward. She looked as if she was going to open the door and rush out of the room to stop the festivities going on joyfully and rather noisily that moment over the refreshments.\n\n\"It is monstrous!\" she said. \"She's in my sitting room at this moment, dressed in silk gauze and lace petticoats, giving a party at my expense.\"\n\n\"She's giving it at your expense, madam, if she's giving it,\" said Mr. Barrow, calmly. \"Barrow & Skipworth are not responsible for anything. There never was a cleaner sweep made of a man's fortune. Captain Crewe died without paying OUR last bill--and it was a big one.\"\n\nMiss Minchin turned back from the door in increased indignation. This was worse than anyone could have dreamed of its being.\n\n\"That is what has happened to me!\" she cried. \"I was always so sure of his payments that I went to all sorts of ridiculous expenses for the child. I paid the bills for that ridiculous doll and her ridiculous fantastic wardrobe. The child was to have anything she wanted. She has a carriage and a pony and a maid, and I've paid for all of them since the last cheque came.\"\n\nMr. Barrow evidently did not intend to remain to listen to the story of Miss Minchin's grievances after he had made the position of his firm clear and related the mere dry facts. He did not feel any particular sympathy for irate keepers of boarding schools.\n\n\"You had better not pay for anything more, ma'am,\" he remarked, \"unless you want to make presents to the young lady. No one will remember you. She hasn't a brass farthing to call her own.\"\n\n\"But what am I to do?\" demanded Miss Minchin, as if she felt it entirely his duty to make the matter right. \"What am I to do?\"\n\n\"There isn't anything to do,\" said Mr. Barrow, folding up his eyeglasses and slipping them into his pocket. \"Captain Crewe is dead. The child is left a pauper. Nobody is responsible for her but you.\"\n\n\"I am not responsible for her, and I refuse to be made responsible!\"\n\nMiss Minchin became quite white with rage.\n\nMr. Barrow turned to go.\n\n\"I have nothing to do with that, madam,\" he said un- interestedly. \"Barrow & Skipworth are not responsible. Very sorry the thing has happened, of course.\"\n\n\"If you think she is to be foisted off on me, you are greatly mistaken,\" Miss Minchin gasped. \"I have been robbed and cheated; I will turn her into the street!\"\n\nIf she had not been so furious, she would have been too discreet to say quite so much. She saw herself burdened with an extravagantly brought-up child whom she had always resented, and she lost all self-control.\n\nMr. Barrow undisturbedly moved toward the door.\n\n\"I wouldn't do that, madam,\" he commented; \"it wouldn't look well. Unpleasant story to get about in connection with the establishment. Pupil bundled out penniless and without friends.\"\n\nHe was a clever business man, and he knew what he was saying. He also knew that Miss Minchin was a business woman, and would be shrewd enough to see the truth. She could not afford to do a thing which would make people speak of her as cruel and hard- hearted.\n\n\"Better keep her and make use of her,\" he added. \"She's a clever child, I believe. You can get a good deal out of her as she grows older.\"\n\n\"I will get a good deal out of her before she grows older!",
      "summary": "On Sara's eleventh birthday, a grand party is held at the school. However, during the celebrations, Miss Minchin learns from Mr. Barrow that Captain Crewe has died penniless due to failed diamond mine investments. Sara is left a pauper, and Miss Minchin must decide how to handle the situation.",
      "prominence": 95,
      "key_characters": [
        {
          "name": "Sara Crewe",
          "description": "The protagonist, celebrating her eleventh birthday.",
          "summary": "Sara enjoys her birthday party, unaware of the tragic news about her father's death and her newfound poverty."
        },
        {
          "name": "Miss Minchin",
          "description": "The headmistress of the school.",
          "summary": "Miss Minchin learns of Captain Crewe's death and Sara's loss of fortune, becoming angry and considering how to handle the situation."
        },
        {
          "name": "Mr. Barrow",
          "description": "Captain Crewe's solicitor.",
          "summary": "Mr. Barrow delivers the news of Captain Crewe's death and financial ruin to Miss Minchin."
        }
      ],
      "chapter": "The Diamond Mines Again",
      "conversation": [
        {
          "scenario": "Miss Minchin's office, where Mr. Barrow delivers the news of Captain Crewe's death and Sara's new circumstances",
          "topic": "Captain Crewe's death and Sara's loss of fortune",
          "key_characters": [
            {
              "name": "Miss Minchin",
              "thought": "This news is devastating. How will this affect my school and my reputation? What am I to do with Sara now?"
            },
            {
              "name": "Mr. Barrow",
              "thought": "I must deliver this news professionally and clearly, despite its unpleasant nature. I need to ensure Barrow & Skipworth are not held responsible for any of this."
            }
          ],
          "dialogues": [
            {
              "character": "Mr. Barrow",
              "message": "[I must be direct and clear.] Miss Minchin, I'm afraid I have some very unfortunate news regarding Captain Crewe."
            },
            {
              "character": "Miss Minchin",
              "message": "[I feel a sense of unease.] What is it, Mr. Barrow? Has something happened?"
            },
            {
              "character": "Mr. Barrow",
              "message": "[I take a deep breath, preparing to deliver the shocking news.] I regret to inform you that Captain Crewe has passed away. He died of jungle fever, exacerbated by severe business troubles."
            },
            {
              "character": "Miss Minchin",
              "message": "[I'm stunned, my mind racing with implications.] Passed away? But... but what about his fortune? The diamond mines?"
            },
            {
              "character": "Mr. Barrow",
              "message": "[I shake my head gravely.] I'm afraid there is no fortune, Miss Minchin. The diamond mines were a sham. Captain Crewe lost everything."
            },
            {
              "character": "Miss Minchin",
              "message": "[I feel faint, grasping the back of a chair for support.] Lost everything? But that's impossible! What about Sara? What's to become of her?"
            },
            {
              "character": "Mr. Barrow",
              "message": "[I state the facts plainly.] Sara is now penniless, Miss Minchin. She has no relatives that we know of. She's left entirely in your care."
            },
            {
              "character": "Miss Minchin",
              "message": "[Anger begins to replace my shock.] In my care? But I've spent a fortune on that child! Her clothes, her parties, her pony!"
            },
            {
              "character": "Mr. Barrow",
              "message": "[I remain calm and detached.] I'm afraid those expenses are your responsibility now, Miss Minchin. Barrow & Skipworth are not liable for any of this."
            },
            {
              "character": "Miss Minchin",
              "message": "[My voice rises in indignation.] This is outrageous! I've been robbed! Cheated! I'll turn her out into the street!"
            },
            {
              "character": "Mr. Barrow",
              "message": "[I warn her, thinking of potential scandal.] I wouldn't advise that, Miss Minchin. It wouldn't look good for your establishment. A pupil turned out, penniless and without friends?"
            },
            {
              "character": "Miss Minchin",
              "message": "[I pause, considering the implications.] Then what do you suggest I do with her, Mr. Barrow?"
            },
            {
              "character": "Mr. Barrow",
              "message": "[I offer a pragmatic suggestion.] Keep her, Miss Minchin. Make use of her. She's a clever child, I believe. You can get a good deal out of her as she grows older."
            },
            {
              "character": "Miss Minchin",
              "message": "[My eyes narrow as I consider this.] Yes... yes, I suppose I can. [I will get a good deal out of her before she grows older!]"
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "The first night she spent in her attic was a thing Sara never forgot. During its passing she lived through a wild, unchildlike woe of which she never spoke to anyone about her. There was no one who would have understood. It was, indeed, well for her that as she lay awake in the darkness her mind was forcibly distracted, now and then, by the strangeness of her surroundings. It was, perhaps, well for her that she was reminded by her small body of material things. If this had not been so, the anguish of her young mind might have been too great for a child to bear. But, really, while the night was passing she scarcely knew that she had a body at all or remembered any other thing than one.\n\n\"My papa is dead!\" she kept whispering to herself. \"My papa is dead!\"\n\nIt was not until long afterward that she realized that her bed had been so hard that she turned over and over in it to find a place to rest, that the darkness seemed more intense than any she had ever known, and that the wind howled over the roof among the chimneys like something which wailed aloud. Then there was something worse. This was certain scufflings and scratchings and squeakings in the walls and behind the skirting boards. She knew what they meant, because Becky had described them. They meant rats and mice who were either fighting with each other or playing together. Once or twice she even heard sharp-toed feet scurrying across the floor, and she remembered in those after days, when she recalled things, that when first she heard them she started up in bed and sat trembling, and when she lay down again covered her head with the bedclothes.\n\nThe change in her life did not come about gradually, but was made all at once.\n\n\"She must begin as she is to go on,\" Miss Minchin said to Miss Amelia. \"She must be taught at once what she is to expect.\"\n\nMariette had left the house the next morning. The glimpse Sara caught of her sitting room, as she passed its open door, showed her that everything had been changed. Her ornaments and luxuries had been removed, and a bed had been placed in a corner to transform it into a new pupil's bedroom.\n\nWhen she went down to breakfast she saw that her seat at Miss Minchin's side was occupied by Lavinia, and Miss Minchin spoke to her coldly.\n\n\"You will begin your new duties, Sara,\" she said, \"by taking your seat with the younger children at a smaller table. You must keep them quiet, and see that they behave well and do not waste their food. You ought to have been down earlier. Lottie has already upset her tea.\"\n\nThat was the beginning, and from day to day the duties given to her were added to. She taught the younger children French and heard their other lessons, and these were the least of her labors. It was found that she could be made use of in numberless directions. She could be sent on errands at any time and in all weathers. She could be told to do things other people neglected. The cook and the housemaids took their tone from Miss Minchin, and rather enjoyed ordering about the \"young one\" who had been made so much fuss over for so long. They were not servants of the best class, and had neither good manners nor good tempers, and it was frequently convenient to have at hand someone on whom blame could be laid.\n\nDuring the first month or two, Sara thought that her willingness to do things as well as she could, and her silence under reproof, might soften those who drove her so hard. In her proud little heart she wanted them to see that she was trying to earn her living and not accepting charity. But the time came when she saw that no one was softened at all; and the more willing she was to do as she was told, the more domineering and exacting careless housemaids became, and the more ready a scolding cook was to blame her.\n\nIf she had been older, Miss Minchin would have given her the bigger girls to teach and saved money by dismissing an instructress; but while she remained and looked like a child, she could be made more useful as a sort of little superior errand girl and maid of all work. An ordinary errand boy would not have been so clever and reliable. Sara could be trusted with difficult commissions and complicated messages. She could even go and pay bills, and she combined with this the ability to dust a room well and to set things in order.\n\nHer own lessons became things of the past. She was taught nothing, and only after long and busy days spent in running here and there at everybody's orders was she grudgingly allowed to go into the deserted schoolroom, with a pile of old books, and study alone at night.\n\n\"If I do not remind myself of the things I have learned, perhaps I may forget them,\" she said to herself. \"I am almost a scullery maid, and if I am a scullery maid who knows nothing, I shall be like poor Becky. I wonder if I could QUITE forget and begin to drop my H'S and not remember that Henry the Eighth had six wives.\"\n\nOne of the most curious things in her new existence was her changed position among the pupils. Instead of being a sort of small royal personage among them, she no longer seemed to be one of their number at all. She was kept so constantly at work that she scarcely ever had an opportunity of speaking to any of them, and she could not avoid seeing that Miss Minchin preferred that she should live a life apart from that of the occupants of the schoolroom.\n\n\"I will not have her forming intimacies and talking to the other children,\" that lady said. \"Girls like a grievance, and if she begins to tell romantic stories about herself, she will become an ill-used heroine, and parents will be given a wrong impression. It is better that she should live a separate life--one suited to her circumstances. I am giving her a home, and that is more than she has any right to expect from me.\"\n\nSara did not expect much, and was far too proud to try to continue to be intimate with girls who evidently felt rather awkward and uncertain about her. The fact was that Miss Minchin's pupils were a set of dull, matter-of-fact young people. They were accustomed to being rich and comfortable, and as Sara's frocks grew shorter and shabbier and queerer-looking, and it became an established fact that she wore shoes with holes in them and was sent out to buy groceries and carry them through the streets in a basket on her arm when the cook wanted them in a hurry, they felt rather as if, when they spoke to her, they were addressing an under servant.\n\n\"To think that she was the girl with the diamond mines, Lavinia commented. \"She does look an object. And she's queerer than ever. I never liked her much, but I can't bear that way she has now of looking at people without speaking--just as if she was finding them out.\"\n\n\"I am,\" said Sara, promptly, when she heard of this. \"That's what I look at some people for. I like to know about them. I think them over afterward.\"\n\nThe truth was that she had saved herself annoyance several times by keeping her eye on Lavinia, who was quite ready to make mischief, and would have been rather pleased to have made it for the ex-show pupil.\n\nSara never made any mischief herself, or interfered with anyone. She worked like a drudge; she tramped through the wet streets, carrying parcels and baskets; she labored with the childish inattention of the little ones' French lessons; as she became shabbier and more forlorn-looking, she was told that she had better take her meals downstairs; she was treated as if she was nobody's concern, and her heart grew proud and sore, but she never told anyone what she felt.\n\n\"Soldiers don't complain,\" she would say between her small, shut teeth, \"I am not going to do it; I will pretend this is part of a war.\"\n\nBut there were hours when her child heart might almost have broken with loneliness but for three people.\n\nThe first, it must be owned, was Becky--just Becky. Throughout all that first night spent in the garret, she had felt a vague comfort in knowing that on the other side of the wall in which the rats scuffled and squeaked there was another young human creature. And during the nights that followed the sense of comfort grew. They had little chance to speak to each other during the day. Each had her own tasks to perform, and any attempt at conversation would have been regarded as a tendency to loiter and lose time. \"Don't mind me, miss,\" Becky whispered during the first morning, \"if I don't say nothin' polite. Some un'd be down on us if I did. I MEANS `please' an' `thank you' an' `beg pardon,' but I dassn't to take time to say it.\"\n\nBut before daybreak she used to slip into Sara's attic and button her dress and give her such help as she required before she went downstairs to light the kitchen fire. And when night came Sara always heard the humble knock at her door which meant that her handmaid was ready to help her again if she was needed. During the first weeks of her grief Sara felt as if she were too stupefied to talk, so it happened that some time passed before they saw each other much or exchanged visits. Becky's heart told her that it was best that people in trouble should be left alone.\n\nThe second of the trio of comforters was Ermengarde, but odd things happened before Ermengarde found her place.\n\nWhen Sara's mind seemed to awaken again to the life about her, she realized that she had forgotten that an Ermengarde lived in the world. The two had always been friends, but Sara had felt as if she were years the older. It could not be contested that Ermengarde was as dull as she was affectionate. She clung to Sara in a simple, helpless way; she brought her lessons to her that she might be helped; she listened to her every word and besieged her with requests for stories. But she had nothing interesting to say herself, and she loathed books of every description. She was, in fact, not a person one would remember when one was caught in the storm of a great trouble, and Sara forgot her.\n\nIt had been all the easier to forget her because she had been suddenly called home for a few weeks. When she came back she did not see Sara for a day or two, and when she met her for the first time she encountered her coming down a corridor with her arms full of garments which were to be taken downstairs to be mended. Sara herself had already been taught to mend them. She looked pale and unlike herself, and she was attired in the queer, outgrown frock whose shortness showed so much thin black leg.\n\nErmengarde was too slow a girl to be equal to such a situation. She could not think of anything to say. She knew what had happened, but, somehow, she had never imagined Sara could look like this--so odd and poor and almost like a servant. It made her quite miserable, and she could do nothing but break into a short hysterical laugh and exclaim--aimlessly and as if without any meaning, \"Oh, Sara, is that you?\"\n\n\"Yes,\" answered Sara, and suddenly a strange thought passed through her mind and made her face flush. She held the pile of garments in her arms, and her chin rested upon the top of it to keep it steady. Something in the look of her straight-gazing eyes made Ermengarde lose her wits still more. She felt as if Sara had changed into a new kind of girl, and she had never known her before. Perhaps it was because she had suddenly grown poor and had to mend things and work like Becky.\n\n\"Oh,\" she stammered. \"How--how are you?\"\n\n\"I don't know,\" Sara replied. \"How are you?\"\n\n\"I'm--I'm quite well,\" said Ermengarde, overwhelmed with shyness. Then spasmodically she thought of something to say which seemed more intimate. \"Are you--are you very unhappy?\" she said in a rush.\n\nThen Sara was guilty of an injustice. Just at that moment her torn heart swelled within her, and she felt that if anyone was as stupid as that, one had better get away from her.\n\n\"What do you think?\" she said. \"Do you think I am very happy?\" And she marched past her without another word.\n\nIn course of time she realized that if her wretchedness had not made her forget things, she would have known that poor, dull Ermengarde was not to be blamed for her unready, awkward ways. She was always awkward, and the more she felt, the more stupid she was given to being.\n\nBut the sudden thought which had flashed upon her had made her over-sensitive.\n\n\"She is like the others,\" she had thought. \"She does not really want to talk to me. She knows no one does.\"\n\nSo for several weeks a barrier stood between them. When they met by chance Sara looked the other way, and Ermengarde felt too stiff and embarrassed to speak. Sometimes they nodded to each other in passing, but there were times when they did not even exchange a greeting.\n\n\"If she would rather not talk to me,\" Sara thought, \"I will keep out of her way. Miss Minchin makes that easy enough.\"\n\nMiss Minchin made it so easy that at last they scarcely saw each other at all. At that time it was noticed that Ermengarde was more stupid than ever, and that she looked listless and unhappy. She used to sit in the window-seat, huddled in a heap, and stare out of the window without speaking. Once Jessie, who was passing, stopped to look at her curiously.\n\n\"What are you crying for, Ermengarde?\" she asked.\n\n\"I'm not crying,\" answered Ermengarde, in a muffled, unsteady voice.\n\n\"You are,\" said Jessie. \"A great big tear just rolled down the bridge of your nose and dropped off at the end of it. And there goes another.\"\n\n\"Well,\" said Ermengarde, \"I'm miserable--and no one need interfere.\" And she turned her plump back and took out her handkerchief and boldly hid her face in it.\n\nThat night, when Sara went to her attic, she was later than usual. She had been kept at work until after the hour at which the pupils went to bed, and after that she had gone to her lessons in the lonely schoolroom. When she reached the top of the stairs, she was surprised to see a glimmer of light coming from under the attic door.\n\n\"Nobody goes there but myself,\" she thought quickly, \"but someone has lighted a candle.\"\n\nSomeone had, indeed, lighted a candle, and it was not burning in the kitchen candlestick she was expected to use, but in one of those belonging to the pupils' bedrooms. The someone was sitting upon the battered footstool, and was dressed in her nightgown and wrapped up in a red shawl. It was Ermengarde.\n\n\"Ermengarde!\" cried Sara. She was so startled that she was almost frightened. \"You will get into trouble.\"\n\nErmengarde stumbled up from her footstool. She shuffled across the attic in her bedroom slippers, which were too large for her. Her eyes and nose were pink with crying.\n\n\"I know I shall--if I'm found out.\" she said. \"But I don't care--I don't care a bit. Oh, Sara, please tell me. What is the matter? Why don't you like me any more?\"\n\nSomething in her voice made the familiar lump rise in Sara's throat. It was so affectionate and simple--so like the old Ermengarde who had asked her to be \"best friends.\" It sounded as if she had not meant what she had seemed to mean during these past weeks.\n\n\"I do like you,\" Sara answered. \"I thought--you see, everything is different now. I thought you--were different.\n\nErmengarde opened her wet eyes wide.\n\n\"Why, it was you who were different!\" she cried. \"You didn't want to talk to me. I didn't know what to do. It was you who were different after I came back.\"\n\nSara thought a moment. She saw she had made a mistake.\n\n\"I AM different,\" she explained, \"though not in the way you think. Miss Minchin does not want me to talk to the girls. Most of them don't want to talk to me. I thought--perhaps--you didn't. So I tried to keep out of your way.\"\n\n\"Oh, Sara,\" Ermengarde almost wailed in her reproachful dismay. And then after one more look they rushed into each other's arms. It must be confessed that Sara's small black head lay for some minutes on the shoulder covered by the red shawl. When Ermengarde had seemed to desert her, she had felt horribly lonely.\n\nAfterward they sat down upon the floor together, Sara clasping her knees with her arms, and Ermengarde rolled up in her shawl. Ermengarde looked at the odd, big-eyed little face adoringly.\n\n\"I couldn't bear it any more,\" she said. \"I dare say you could live without me, Sara; but I couldn't live without you. I was nearly DEAD. So tonight, when I was crying under the bedclothes, I thought all at once of creeping up here and just begging you to let us be friends again.\"\n\n\"You are nicer than I am,\" said Sara. \"I was too proud to try and make friends. You see, now that trials have come, they have shown that I am NOT a nice child. I was afraid they would. Perhaps\"--wrinkling her forehead wisely--\"that is what they were sent for.\"\n\n\"I don't see any good in them,\" said Ermengarde stoutly.\n\n\"Neither do I--to speak the truth,\" admitted Sara, frankly. \"But I suppose there MIGHT be good in things, even if we don't see it. There MIGHT\"--DOUBTFULLY--\"Be good in Miss Minchin.\"\n\nErmengarde looked round the attic with a rather fearsome curiosity.\n\n\"Sara,\" she said, \"do you think you can bear living here?\"\n\nSara looked round also.\n\n\"If I pretend it's quite different, I can,\" she answered; \"or if I pretend it is a place in a story.\"\n\nShe spoke slowly. Her imagination was beginning to work for her. It had not worked for her at all since her troubles had come upon her. She had felt as if it had been stunned.\n\n\"Other people have lived in worse places. Think of the Count of Monte Cristo in the dungeons of the Chateau d'If. And think of the people in the Bastille!\"\n\n\"The Bastille,\" half whispered Ermengarde, watching her and beginning to be fascinated. She remembered stories of the French Revolution which Sara had been able to fix in her mind by her dramatic relation of them. No one but Sara could have done it.\n\nA well-known glow came into Sara's eyes.\n\n\"Yes,\" she said, hugging her knees, \"that will be a good place to pretend about. I am a prisoner in the Bastille. I have been here for years and years--and years; and everybody has forgotten about me. Miss Minchin is the jailer--and Becky\"--a sudden light adding itself to the glow in her eyes--\"Becky is the prisoner in the next cell.\"\n\nShe turned to Ermengarde, looking quite like the old Sara.\n\n\"I shall pretend that,\" she said; \"and it will be a great comfort.\"\n\nErmengarde was at once enraptured and awed.\n\n\"And will you tell me all about it?",
      "summary": "Sara's life changes drastically as she is moved to the attic and forced to work as a servant at the school. She struggles with her new circumstances but finds comfort in her friendship with Becky and a renewed connection with Ermengarde. Sara uses her imagination to cope with her harsh reality, pretending she is a prisoner in the Bastille.",
      "prominence": 90,
      "key_characters": [
        {
          "name": "Sara Crewe",
          "description": "The former star pupil, now reduced to a servant's position after her father's death.",
          "summary": "Sara adapts to her new life with resilience and dignity, using her imagination to cope with hardships. She rebuilds her friendship with Ermengarde and finds solace in her connection with Becky."
        },
        {
          "name": "Miss Minchin",
          "description": "The strict and cruel headmistress of the school.",
          "summary": "Miss Minchin demotes Sara to a servant's position, treating her harshly and isolating her from the other students."
        },
        {
          "name": "Becky",
          "description": "The scullery maid who becomes Sara's friend and confidante.",
          "summary": "Becky offers comfort and support to Sara, helping her adjust to her new life in the attic."
        },
        {
          "name": "Ermengarde",
          "description": "Sara's friend who initially struggles to connect with her after the change in circumstances.",
          "summary": "Ermengarde overcomes her awkwardness and renews her friendship with Sara, seeking her out in the attic."
        }
      ],
      "chapter": "In the Attic",
      "conversation": [
        {
          "scenario": "Sara and Ermengarde reunite in the attic after weeks of misunderstanding and distance.",
          "topic": "Rekindling their friendship and coping with Sara's new circumstances",
          "key_characters": [
            {
              "name": "Sara Crewe",
              "thought": "I've been so lonely, but I can't let my guard down completely. I need to be strong."
            },
            {
              "name": "Ermengarde",
              "thought": "I'm so nervous and afraid Sara won't forgive me, but I miss her terribly."
            }
          ],
          "dialogues": [
            {
              "character": "Sara Crewe",
              "message": "[I'm shocked to see her here. Is this a trick?] Ermengarde! (She exclaims in surprise) You will get into trouble."
            },
            {
              "character": "Ermengarde",
              "message": "[Oh no, she doesn't look happy to see me. But I have to try.] (Shuffles across the attic, eyes pink from crying) I know I shall--if I'm found out. But I don't care--I don't care a bit. Oh, Sara, please tell me. What is the matter? Why don't you like me any more?"
            },
            {
              "character": "Sara Crewe",
              "message": "[Her voice sounds so sincere. Maybe I was wrong about her.] (Feeling a lump in her throat) I do like you. I thought--you see, everything is different now. I thought you--were different."
            },
            {
              "character": "Ermengarde",
              "message": "[I'm so confused. I thought she was the one who changed.] (Opens her eyes wide) Why, it was you who were different! You didn't want to talk to me. I didn't know what to do. It was you who were different after I came back."
            },
            {
              "character": "Sara Crewe",
              "message": "[I see now. We both misunderstood each other.] (Pauses to think) I AM different, though not in the way you think. Miss Minchin does not want me to talk to the girls. Most of them don't want to talk to me. I thought--perhaps--you didn't. So I tried to keep out of your way."
            },
            {
              "character": "Ermengarde",
              "message": "[I feel so terrible for not reaching out sooner.] (Almost wailing) Oh, Sara! (She rushes forward to embrace Sara)"
            },
            {
              "character": "Environment",
              "message": "The two girls embrace, with Sara's small black head resting on Ermengarde's shoulder covered by the red shawl. The attic feels less cold and lonely in this moment of reconnection."
            },
            {
              "character": "Ermengarde",
              "message": "[I need to explain how much she means to me.] (Speaking adoringly) I couldn't bear it any more. I dare say you could live without me, Sara; but I couldn't live without you. I was nearly DEAD. So tonight, when I was crying under the bedclothes, I thought all at once of creeping up here and just begging you to let us be friends again."
            },
            {
              "character": "Sara Crewe",
              "message": "[Her words touch me deeply, but I feel guilty for my own behavior.] You are nicer than I am. I was too proud to try and make friends. You see, now that trials have come, they have shown that I am NOT a nice child. I was afraid they would. Perhaps--that is what they were sent for."
            },
            {
              "character": "Ermengarde",
              "message": "[I can't stand to hear her blame herself.] (Speaking stoutly) I don't see any good in them."
            },
            {
              "character": "Sara Crewe",
              "message": "[I appreciate her loyalty, but I must be honest.] (Speaking frankly) Neither do I--to speak the truth. But I suppose there MIGHT be good in things, even if we don't see it. There MIGHT--be good in Miss Minchin."
            },
            {
              "character": "Ermengarde",
              "message": "[I'm worried about how Sara is living now.] (Looking around the attic fearfully) Sara, do you think you can bear living here?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I feel my imagination starting to work again, giving me hope.] (Speaking slowly, her eyes beginning to glow) If I pretend it's quite different, I can, or if I pretend it is a place in a story. Other people have lived in worse places. Think of the Count of Monte Cristo in the dungeons of the Chateau d'If. And think of the people in the Bastille!"
            },
            {
              "character": "Ermengarde",
              "message": "[I'm in awe of Sara's ability to transform her circumstances through imagination.] (Half-whispering) The Bastille..."
            },
            {
              "character": "Sara Crewe",
              "message": "[I feel the familiar excitement of storytelling coming back to me.] (Hugging her knees, eyes glowing) Yes, that will be a good place to pretend about. I am a prisoner in the Bastille. I have been here for years and years--and years; and everybody has forgotten about me. Miss Minchin is the jailer--and Becky is the prisoner in the next cell."
            },
            {
              "character": "Ermengarde",
              "message": "[I'm captivated by Sara's story and eager to be part of it.] And will you tell me all about it? May I?"
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "The third person in the trio was Lottie. She was a small thing and did not know what adversity meant, and was much bewildered by the alteration she saw in her young adopted mother. She had heard it rumored that strange things had happened to Sara, but she could not understand why she looked different--why she wore an old black frock and came into the schoolroom only to teach instead of to sit in her place of honor and learn lessons herself. There had been much whispering among the little ones when it had been discovered that Sara no longer lived in the rooms in which Emily had so long sat in state. Lottie's chief difficulty was that Sara said so little when one asked her questions. At seven mysteries must be made very clear if one is to understand them.\n\n\"Are you very poor now, Sara?\" she had asked confidentially the first morning her friend took charge of the small French class. \"Are you as poor as a beggar?\" She thrust a fat hand into the slim one and opened round, tearful eyes. \"I don't want you to be as poor as a beggar.\"\n\nShe looked as if she was going to cry. And Sara hurriedly consoled her.\n\n\"Beggars have nowhere to live,\" she said courageously. \"I have a place to live in.\"\n\n\"Where do you live?\" persisted Lottle. \"The new girl sleeps in your room, and it isn't pretty any more.\"\n\n\"I live in another room,\" said Sara.\n\n\"Is it a nice one?\" inquired Lottie. \"I want to go and see it.\"\n\n\"You must not talk,\" said Sara. \"Miss Minchin is looking at us. She will be angry with me for letting you whisper.\"\n\nShe had found out already that she was to be held accountable for everything which was objected to. If the children were not attentive, if they talked, if they were restless, it was she who would be reproved.\n\nBut Lottie was a determined little person. If Sara would not tell her where she lived, she would find out in some other way. She talked to her small companions and hung about the elder girls and listened when they were gossiping; and acting upon certain information they had unconsciously let drop, she started late one afternoon on a voyage of discovery, climbing stairs she had never known the existence of, until she reached the attic floor. There she found two doors near each other, and opening one, she saw her beloved Sara standing upon an old table and looking out of a window.\n\n\"Sara!\" she cried, aghast. \"Mamma Sara!\" She was aghast because the attic was so bare and ugly and seemed so far away from all the world. Her short legs had seemed to have been mounting hundreds of stairs.\n\nSara turned round at the sound of her voice. It was her turn to be aghast. What would happen now? If Lottie began to cry and any one chanced to hear, they were both lost. She jumped down from her table and ran to the child.\n\n\"Don't cry and make a noise,\" she implored. \"I shall be scolded if you do, and I have been scolded all day. It's--it's not such a bad room, Lottie.\"\n\n\"Isn't it?\" gasped Lottie, and as she looked round it she bit her lip. She was a spoiled child yet, but she was fond enough of her adopted parent to make an effort to control herself for her sake. Then, somehow, it was quite possible that any place in which Sara lived might turn out to be nice. \"Why isn't it, Sara?\" she almost whispered.\n\nSara hugged her close and tried to laugh. There was a sort of comfort in the warmth of the plump, childish body. She had had a hard day and had been staring out of the windows with hot eyes.\n\n\"You can see all sorts of things you can't see downstairs,\" she said.\n\n\"What sort of things?\" demanded Lottie, with that curiosity Sara could always awaken even in bigger girls.\n\n\"Chimneys--quite close to us--with smoke curling up in wreaths and clouds and going up into the sky--and sparrows hopping about and talking to each other just as if they were people--and other attic windows where heads may pop out any minute and you can wonder who they belong to. And it all feels as high up--as if it was another world.\"\n\n\"Oh, let me see it!\" cried Lottie. \"Lift me up!\"\n\nSara lifted her up, and they stood on the old table together and leaned on the edge of the flat window in the roof, and looked out.\n\nAnyone who has not done this does not know what a different world they saw. The slates spread out on either side of them and slanted down into the rain gutter-pipes. The sparrows, being at home there, twittered and hopped about quite without fear. Two of them perched on the chimney top nearest and quarrelled with each other fiercely until one pecked the other and drove him away. The garret window next to theirs was shut because the house next door was empty.\n\n\"I wish someone lived there,\" Sara said. \"It is so close that if there was a little girl in the attic, we could talk to each other through the windows and climb over to see each other, if we were not afraid of falling.\"\n\nThe sky seemed so much nearer than when one saw it from the street, that Lottie was enchanted. From the attic window, among the chimney pots, the things which were happening in the world below seemed almost unreal. One scarcely believed in the existence of Miss Minchin and Miss Amelia and the schoolroom, and the roll of wheels in the square seemed a sound belonging to another existence.\n\n\"Oh, Sara!\" cried Lottie, cuddling in her guarding arm. \"I like this attic--I like it! It is nicer than downstairs!\"\n\n\"Look at that sparrow,\" whispered Sara. \"I wish I had some crumbs to throw to him.\"\n\n\"I have some!\" came in a little shriek from Lottie. \"I have part of a bun in my pocket; I bought it with my penny yesterday, and I saved a bit.\"\n\nWhen they threw out a few crumbs the sparrow jumped and flew away to an adjacent chimney top. He was evidently not accustomed to intimates in attics, and unexpected crumbs startled him. But when Lottie remained quite still and Sara chirped very softly-- almost as if she were a sparrow herself--he saw that the thing which had alarmed him represented hospitality, after all. He put his head on one side, and from his perch on the chimney looked down at the crumbs with twinkling eyes. Lottie could scarcely keep still.\n\n\"Will he come? Will he come?\" she whispered.\n\n\"His eyes look as if he would,\" Sara whispered back. \"He is thinking and thinking whether he dare. Yes, he will! Yes, he is coming!\"\n\nHe flew down and hopped toward the crumbs, but stopped a few inches away from them, putting his head on one side again, as if reflecting on the chances that Sara and Lottie might turn out to be big cats and jump on him. At last his heart told him they were really nicer than they looked, and he hopped nearer and nearer, darted at the biggest crumb with a lightning peck, seized it, and carried it away to the other side of his chimney.\n\n\"Now he KNOWS\", said Sara. \"And he will come back for the others.\"\n\nHe did come back, and even brought a friend, and the friend went away and brought a relative, and among them they made a hearty meal over which they twittered and chattered and exclaimed, stopping every now and then to put their heads on one side and examine Lottie and Sara. Lottie was so delighted that she quite forgot her first shocked impression of the attic. In fact, when she was lifted down from the table and returned to earthly things, as it were, Sara was able to point out to her many beauties in the room which she herself would not have suspected the existence of.\n\n\"It is so little and so high above everything,\" she said, \"that it is almost like a nest in a tree. The slanting ceiling is so funny. See, you can scarcely stand up at this end of the room; and when the morning begins to come I can lie in bed and look right up into the sky through that flat window in the roof. It is like a square patch of light. If the sun is going to shine, little pink clouds float about, and I feel as if I could touch them. And if it rains, the drops patter and patter as if they were saying something nice. Then if there are stars, you can lie and try to count how many go into the patch. It takes such a lot. And just look at that tiny, rusty grate in the corner. If it was polished and there was a fire in it, just think how nice it would be. You see, it's really a beautiful little room.\"\n\nShe was walking round the small place, holding Lottie's hand and making gestures which described all the beauties she was making herself see. She quite made Lottie see them, too. Lottie could always believe in the things Sara made pictures of.\n\n\"You see,\" she said, \"there could be a thick, soft blue Indian rug on the floor; and in that corner there could be a soft little sofa, with cushions to curl up on; and just over it could be a shelf full of books so that one could reach them easily; and there could be a fur rug before the fire, and hangings on the wall to cover up the whitewash, and pictures. They would have to be little ones, but they could be beautiful; and there could be a lamp with a deep rose-colored shade; and a table in the middle, with things to have tea with; and a little fat copper kettle singing on the hob; and the bed could be quite different. It could be made soft and covered with a lovely silk coverlet. It could be beautiful. And perhaps we could coax the sparrows until we made such friends with them that they would come and peck at the window and ask to be let in.\"\n\n\"Oh, Sara!\" cried Lottie. \"I should like to live here!\"\n\nWhen Sara had persuaded her to go downstairs again, and, after setting her on her way, had come back to her attic, she stood in the middle of it and looked about her. The enchantment of her imaginings for Lottie had died away. The bed was hard and covered with its dingy quilt. The whitewashed wall showed its broken patches, the floor was cold and bare, the grate was broken and rusty, and the battered footstool, tilted sideways on its injured leg, the only seat in the room. She sat down on it for a few minutes and let her head drop in her hands. The mere fact that Lottie had come and gone away again made things seem a little worse--just as perhaps prisoners feel a little more desolate after visitors come and go, leaving them behind.\n\n\"It's a lonely place,\" she said. \"Sometimes it's the loneliest place in the world.\"\n\nShe was sitting in this way when her attention was attracted by a slight sound near her. She lifted her head to see where it came from, and if she had been a nervous child she would have left her seat on the battered footstool in a great hurry. A large rat was sitting up on his hind quarters and sniffing the air in an interested manner. Some of Lottie's crumbs had dropped upon the floor and their scent had drawn him out of his hole.\n\nHe looked so queer and so like a gray-whiskered dwarf or gnome that Sara was rather fascinated. He looked at her with his bright eyes, as if he were asking a question. He was evidently so doubtful that one of the child's queer thoughts came into her mind.\n\n\"I dare say it is rather hard to be a rat,\" she mused. \"Nobody likes you. People jump and run away and scream out, `Oh, a horrid rat!' I shouldn't like people to scream and jump and say, `Oh, a horrid Sara!' the moment they saw me. And set traps for me, and pretend they were dinner. It's so different to be a sparrow. But nobody asked this rat if he wanted to be a rat when he was made. Nobody said, `Wouldn't you rather be a sparrow?'\"\n\nShe had sat so quietly that the rat had begun to take courage. He was very much afraid of her, but perhaps he had a heart like the sparrow and it told him that she was not a thing which pounced. He was very hungry. He had a wife and a large family in the wall, and they had had frightfully bad luck for several days. He had left the children crying bitterly, and felt he would risk a good deal for a few crumbs, so he cautiously dropped upon his feet.\n\n\"Come on,\" said Sara; \"I'm not a trap. You can have them, poor thing! Prisoners in the Bastille used to make friends with rats. Suppose I make friends with you.\"\n\nHow it is that animals understand things I do not know, but it is certain that they do understand. Perhaps there is a language which is not made of words and everything in the world understands it. Perhaps there is a soul hidden in everything and it can always speak, without even making a sound, to another soul. But whatsoever was the reason, the rat knew from that moment that he was safe--even though he was a rat. He knew that this young human being sitting on the red footstool would not jump up and terrify him with wild, sharp noises or throw heavy objects at him which, if they did not fall and crush him, would send him limping in his scurry back to his hole. He was really a very nice rat, and did not mean the least harm. When he had stood on his hind legs and sniffed the air, with his bright eyes fixed on Sara, he had hoped that she would understand this, and would not begin by hating him as an enemy. When the mysterious thing which speaks without saying any words told him that she would not, he went softly toward the crumbs and began to eat them. As he did it he glanced every now and then at Sara, just as the sparrows had done, and his expression was so very apologetic that it touched her heart.\n\nShe sat and watched him without making any movement. One crumb was very much larger than the others--in fact, it could scarcely be called a crumb. It was evident that he wanted that piece very much, but it lay quite near the footstool and he was still rather timid.\n\n\"I believe he wants it to carry to his family in the wall,\" Sara thought. \"If I do not stir at all, perhaps he will come and get it.\"\n\nShe scarcely allowed herself to breathe, she was so deeply interested. The rat shuffled a little nearer and ate a few more crumbs, then he stopped and sniffed delicately, giving a side glance at the occupant of the footstool; then he darted at the piece of bun with something very like the sudden boldness of the sparrow, and the instant he had possession of it fled back to the wall, slipped down a crack in the skirting board, and was gone.\n\n\"I knew he wanted it for his children,\" said Sara. \"I do believe I could make friends with him.\"\n\nA week or so afterward, on one of the rare nights when Ermengarde found it safe to steal up to the attic, when she tapped on the door with the tips of her fingers Sara did not come to her for two or three minutes. There was, indeed, such a silence in the room at first that Ermengarde wondered if she could have fallen asleep. Then, to her surprise, she heard her utter a little, low laugh and speak coaxingly to someone.\n\n\"There!\" Ermengarde heard her say. \"Take it and go home, Melchisedec! Go home to your wife!\"\n\nAlmost immediately Sara opened the door, and when she did so she found Ermengarde standing with alarmed eyes upon the threshold.\n\n\"Who--who ARE you talking to, Sara?\" she gasped out.\n\nSara drew her in cautiously, but she looked as if something pleased and amused her.\n\n\"You must promise not to be frightened--not to scream the least bit, or I can't tell you,\" she answered.\n\nErmengarde felt almost inclined to scream on the spot, but managed to control herself. She looked all round the attic and saw no one. And yet Sara had certainly been speaking TO someone. She thought of ghosts.\n\n\"Is it--something that will frighten me?\" she asked timorously.\n\n\"Some people are afraid of them,\" said Sara. \"I was at first-- but I am not now.\"\n\n\"Was it--a ghost?\" quaked Ermengarde.\n\n\"No,\" said Sara, laughing. \"It was my rat.\"\n\nErmengarde made one bound, and landed in the middle of the little dingy bed. She tucked her feet under her nightgown and the red shawl. She did not scream, but she gasped with fright.\n\n\"Oh! Oh!\" she cried under her breath. \"A rat! A rat!\"\n\n\"I was afraid you would be frightened,\" said Sara. \"But you needn't be. I am making him tame. He actually knows me and comes out when I call him. Are you too frightened to want to see him?\"\n\nThe truth was that, as the days had gone on and, with the aid of scraps brought up from the kitchen, her curious friendship had developed, she had gradually forgotten that the timid creature she was becoming familiar with was a mere rat.\n\nAt first Ermengarde was too much alarmed to do anything but huddle in a heap upon the bed and tuck up her feet, but the sight of Sara's composed little countenance and the story of Melchisedec's first appearance began at last to rouse her curiosity, and she leaned forward over the edge of the bed and watched Sara go and kneel down by the hole in the skirting board.\n\n\"He--he won't run out quickly and jump on the bed, will he?\" she said.\n\n\"No,\" answered Sara. \"He's as polite as we are. He is just like a person. Now watch!\"\n\nShe began to make a low, whistling sound--so low and coaxing that it could only have been heard in entire stillness. She did it several times, looking entirely absorbed in it. Ermengarde thought she looked as if she were working a spell. And at last, evidently in response to it, a gray-whiskered, bright-eyed head peeped out of the hole. Sara had some crumbs in her hand. She dropped them, and Melchisedec came quietly forth and ate them. A piece of larger size than the rest he took and carried in the most businesslike manner back to his home.\n\n\"You see,\" said Sara, \"that is for his wife and children. He is very nice. He only eats the little bits. After he goes back I can always hear his family squeaking for joy. There are three kinds of squeaks. One kind is the children's, and one is Mrs. Melchisedec's, and one is Melchisedec's own.\"\n\nErmengarde began to laugh.\n\n\"Oh, Sara!\" she said. \"You ARE queer--but you are nice.\"\n\n\"I know I am queer,\" admitted Sara, cheerfully; \"and I TRY to be nice.\" She rubbed her forehead with her little brown paw, and a puzzled, tender look came into her face. \"Papa always laughed at me,\" she said; \"but I liked it. He thought I was queer, but he liked me to make up things. I--I can't help making up things. If I didn't, I don't believe I could live.\" She paused and glanced around the attic. \"I'm sure I couldn't live here,\" she added in a low voice.\n\nErmengarde was interested, as she always was. \"When you talk about things,\" she said, \"they seem as if they grew real. You talk about Melchisedec as if he was a person.\"\n\n\"He IS a person,\" said Sara. \"He gets hungry and frightened, just as we do; and he is married and has children. How do we know he doesn't think things, just as we do? His eyes look as if he was a person. That was why I gave him a name.\"\n\nShe sat down on the floor in her favorite attitude, holding her knees.\n\n\"Besides,\" she said, \"he is a Bastille rat sent to be my friend. I can always get a bit of bread the cook has thrown away, and it is quite enough to support him.\"\n\n\"Is it the Bastille yet?\" asked Ermengarde, eagerly. \"Do you always pretend it is the Bastille?\"\n\n\"Nearly always,\" answered Sara. \"Sometimes I try to pretend it is another kind of place; but the Bastille is generally easiest-- particularly when it is cold.\"\n\nJust at that moment Ermengarde almost jumped off the bed, she was so startled by a sound she heard. It was like two distinct knocks on the wall.\n\n\"What is that?\" she exclaimed.\n\nSara got up from the floor and answered quite dramatically:\n\n\"It is the prisoner in the next cell.\"\n\n\"Becky!\" cried Ermengarde, enraptured.\n\n\"Yes,\" said Sara. \"Listen; the two knocks meant, `Prisoner, are you there?'\"\n\nShe knocked three times on the wall herself, as if in answer.\n\n\"That means, `Yes, I am here, and all is well.'\"\n\nFour knocks came from Becky's side of the wall.\n\n\"That means,\" explained Sara, \"`Then, fellow-sufferer, we will sleep in peace. Good night.'\"\n\nErmengarde quite beamed with delight.\n\n\"Oh, Sara!\" she whispered joyfully. \"It is like a story!\"\n\n\"It IS a story,\" said Sara. \"EVERYTHING'S a story. You are a story--I am a story. Miss Minchin is a story.\"\n\nAnd she sat down again and talked until Ermengarde forgot that she was a sort of escaped prisoner herself, and had to be reminded by Sara that she could not remain in the Bastille all night, but must steal noiselessly downstairs again and creep back into her deserted bed.\n\n\n## Information about Project Gutenberg\n(one page)\nWe produce about two million dollars for each hour we work. The time it takes us, a rather conservative estimate, is fifty hours to get any etext selected, entered, proofread, edited, copyright searched and analyzed, the copyright letters written, etc. This projected audience is one hundred million readers. If our value per text is nominally estimated at one dollar then we produce $2 million dollars per hour this year as we release fifty new Etext files per month, or 500 more Etexts in 2000 for a total of 3000+ If they reach just 1-2% of the world's population then the total should reach over 300 billion Etexts given away by year's end.\n\nThe Goal of Project Gutenberg is to Give Away One Trillion Etext Files by December 31, 2001. [10,000 x 100,000,000 = 1 Trillion] This is ten thousand titles each to one hundred million readers, which is only about 4% of the present number of computer users.\n\nAt our revised rates of production, we will reach only one-third of that goal by the end of 2001, or about 3,333 Etexts unless we manage to get some real funding.\n\nSomething is needed to create a future for Project Gutenberg for the next 100 years.",
      "summary": "Sara befriends a rat she names Melchisedec, demonstrating her ability to find companionship and use her imagination even in dire circumstances. Lottie discovers Sara's attic room, and Sara uses her storytelling skills to make the bleak space seem magical. Ermengarde also visits Sara in secret, and they develop a system of communication with Becky through wall knocks, pretending they are prisoners in the Bastille.",
      "prominence": 95,
      "key_characters": [
        {
          "name": "Sara Crewe",
          "description": "A formerly wealthy student now living in the attic and working as a servant.",
          "summary": "Sara shows resilience and creativity, befriending a rat and using her imagination to cope with her harsh living conditions. She maintains her kindness and storytelling abilities despite her circumstances."
        },
        {
          "name": "Lottie",
          "description": "A young student who looks up to Sara as a mother figure.",
          "summary": "Lottie discovers Sara's attic room and is initially shocked, but Sara's imaginative descriptions help her see beauty in the bleak space."
        },
        {
          "name": "Ermengarde",
          "description": "Sara's friend who secretly visits her in the attic.",
          "summary": "Ermengarde overcomes her fear to visit Sara, participating in her imaginative games and providing companionship."
        },
        {
          "name": "Melchisedec",
          "description": "A rat that Sara befriends in the attic.",
          "summary": "Melchisedec becomes Sara's unexpected companion, symbolizing her ability to find friendship and meaning in unlikely places."
        }
      ],
      "chapter": "Melchisedec",
      "conversation": [
        {
          "scenario": "Sara introduces Ermengarde to Melchisedec, her rat friend, in the attic room.",
          "topic": "Sara's friendship with Melchisedec and her imagination in the attic",
          "key_characters": [
            {
              "name": "Sara Crewe",
              "thought": "I hope Ermengarde understands my friendship with Melchisedec and doesn't think I'm too strange."
            },
            {
              "name": "Ermengarde",
              "thought": "I'm terrified of rats, but I trust Sara. I hope I can be brave for her sake."
            }
          ],
          "dialogues": [
            {
              "character": "Sara Crewe",
              "message": "[I need to prepare Ermengarde for what she's about to see.] Ermengarde, I have someone I'd like you to meet. But you must promise not to be frightened."
            },
            {
              "character": "Ermengarde",
              "message": "[Oh no, what could it be?] (Looking nervous) Who-who are you talking to, Sara?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I hope she doesn't scream.] You must promise not to be frightenednot to scream the least bit, or I can't tell you."
            },
            {
              "character": "Ermengarde",
              "message": "[I'm getting really scared now.] (Voice quavering) Is itsomething that will frighten me?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I need to reassure her.] Some people are afraid of them. I was at firstbut I am not now."
            },
            {
              "character": "Ermengarde",
              "message": "[My imagination is running wild.] (In a terrified whisper) Was ita ghost?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I can't help but laugh at her reaction.] (Laughing lightly) No, it was my rat."
            },
            {
              "character": "Ermengarde",
              "message": "[A rat?!] (Jumping onto the bed) Oh! Oh! A rat! A rat!"
            },
            {
              "character": "Sara Crewe",
              "message": "[I need to calm her down.] I was afraid you would be frightened. But you needn't be. I am making him tame. He actually knows me and comes out when I call him. Are you too frightened to want to see him?"
            },
            {
              "character": "Ermengarde",
              "message": "[I'm curious, but still scared.] (Peering over the edge of the bed) Hehe won't run out quickly and jump on the bed, will he?"
            },
            {
              "character": "Sara Crewe",
              "message": "[I need to show her how gentle Melchisedec is.] No, he's as polite as we are. He is just like a person. Now watch!"
            },
            {
              "character": "Environment",
              "message": "Sara begins to make a low, whistling sound. After a few moments, a gray-whiskered, bright-eyed head peeps out of a hole in the skirting board."
            },
            {
              "character": "Sara Crewe",
              "message": "[I'm so proud of Melchisedec.] (Dropping some crumbs) You see, that is for his wife and children. He is very nice. He only eats the little bits. After he goes back I can always hear his family squeaking for joy."
            },
            {
              "character": "Ermengarde",
              "message": "[This is actually quite fascinating.] (Beginning to laugh) Oh, Sara! You ARE queerbut you are nice."
            },
            {
              "character": "Sara Crewe",
              "message": "[I feel a mix of pride and sadness.] I know I am queer, and I TRY to be nice. Papa always laughed at me, but I liked it. He thought I was queer, but he liked me to make up things. II can't help making up things. If I didn't, I don't believe I could live."
            }
          ]
        }
      ],
      "state": "finished"
    }
  ]
}