{
  "chapter_beginnings": [
    {
      "beginning_sentence": "ACT ONE"
    }
  ],
  "plots": [
    {
      "text": "The play opens to the sound of hand bells.\n\nThey are played with Christmas cheer – but there’s something faintly ominous about them – something faintly mournful.\n\nSomething faintly wrong.\n\nThey are broken by a voice –\n\nNARRATOR. A Christmas Carol. Being a Ghost Story at Christmas.\n\nAnd then a new voice emerges, and it is soon followed by a dozen more. The cast speak sometimes in unison, sometimes solo.\n\nMarley was dead, to begin with. There is no doubt whatever about that. The register of his burial was signed by the clergyman, the clerk, the undertaker and the chief mourner. Marley was dead as a doornail.\n\nDid Scrooge know he was dead? Of course. How could it be otherwise? Scrooge was his sole executor, his sole assign, his sole residuary legatee, his sole friend, and sole mourner. And even Scrooge was not so dreadfully upset by the sad event, indeed on the very day of the funeral he solemnised Marley’s passing with an undoubted bargain.\n\nThe COMPANY pull money boxes out of the stage and use them to construct a desk.\n\nScrooge never painted out Old Marley’s name. There it stood, years afterwards, above the warehouse door: ‘Scrooge and Marley’. He did not even mind what debtors called him – Scrooge or Marley – he’d answer to both. It was all the same to him. It was all money.\n\nEBENEZER SCROOGE, old before his time and bent by years of his own neglect, enters – seemingly oblivious to the company around him.\n \nFor Scrooge was a squeezing, wrenching, grasping, scraping, clutching, covetous old sinner. Hard and sharp as flint from which no steel had ever struck out generous fire, secret and self-contained and solitary as an oyster.\n\nSCROOGE sits at his desk and scrutinises his ledger, looking at it with deep intensity.\n\nNobody ever stopped him in the street to say, with gladsome looks, ‘My dear Scrooge, how are you? When will you come to see me?’ No beggars implored him to bestow a trifle, no children asked him what it was o’clock, no man or woman ever once in all his life enquired the way to such and such a place, of Scrooge. Even the blind men’s dogs appeared to know him and when they saw him coming on, would tug their owners into doorways. But what did Scrooge care? It was the very thing he liked. To edge his way along the crowded paths of life, warning all human sympathy to keep a distance.\n\nSuddenly four doorframes rise on either side of SCROOGE, and he is encased inside.\n\nCHOIR.\n\nGod rest ye merry, gentlemen\n\nLet nothing you dismay\n\nRemember, Christ, our Saviour\n\nWas born on Christmas Day\n\nSCROOGE tries to stay concentrated on his work, but he’s clearly irritated by the noise.\n\nTo save us all from Satan’s pow’r\n\nWhen we were gone astray\n\nThe CHOIR melts away and just three CAROL SINGERS are left, outside one of Scrooge’s doors. Their voices are kind, but sadly not blessed with musicality.\n\nCAROL SINGERS.\n\nOh tidings of comfort and joy\n\nComfort and joy\n\nSCROOGE ( giving up ). Oh Christ.\n\nCAROL SINGERS.\n\nOh tidings of comfort and joy\n \nSCROOGE. Not tonight there’s not.\n\nCAROL SINGERS.\n\nGod rest ye merry, gentlemen\n\nLet nothing you dismay\n\nSCROOGE. You dismay me.\n\nCAROL SINGERS.\n\nRemember, Christ, our Saviour\n\nWas born on Christmas Day\n\nTo save us all from Satan’s pow’r\n\nWhen we were gone astray\n\nSCROOGE. Please stop.\n\nCAROL SINGERS.\n\nOh tidings of comfort and joy\n\nComfort and joy\n\nSCROOGE stalks towards the door, full of anger.\n\nSCROOGE. I have warned you enough.\n\nCAROL SINGERS.\n\nOh tidings of comfort and joy\n\nIn Bethlehem…\n\nSCROOGE wrenches open his door.\n\nSCROOGE. Go. Go.\n\nCAROL SINGER ( spoken ). But, sir, we only seek…\n\nSCROOGE. Seek it elsewhere.\n\nHe slams the door in their faces. The CAROL SINGERS remain outside the door, he inside.\n\nCAROL SINGER. But there are thousands in want, sir. Surely, at this charitable time of the year, you could spare us something.\n\nSCROOGE. Many thousands in want you say.\n\nCAROL SINGER. Yes, sir.\n\nSCROOGE. Are there no prisons?\n\nCAROL SINGER. Well, yes, plenty of prisons.\n \nSCROOGE. And the Union workhouses? Are they still in operation?\n\nCAROL SINGER. They are. Still. I wish I could say they were not.\n\nSCROOGE. The Treadmill and the Poor Law are in full vigour then?\n\nCAROL SINGER. Sir, you seem to misunderstand me. A few of us are endeavouring to raise a fund to buy the poor some meat and drink, and means of warmth.\n\nSCROOGE thinks .\n\nSCROOGE. I help only to support the establishments I have mentioned – they cost enough; and those who are badly off must go there.\n\nCAROL SINGER. But, sir, many can’t go there; and many would rather die.\n\nSCROOGE. If they would rather die, they had better do it, and decrease the surplus population.\n\nCAROL SINGER. You cannot mean so…\n\nSCROOGE. It’s enough for a man to understand his own business and not to interfere with other people. Mine occupies me constantly. Good evening, sir.\n\nThe CAROL SINGERS, slightly daunted, walk away, singing.\n\nCAROL SINGERS.\n\nGod bless ye merry –\n\nSCROOGE. Bob. BOB.\n\nHe rings a bell. BOB CRATCHIT, whose cowed demeanour can’t disguise his natural optimism, appears at speed.\n\nI need those singing creatures kept away from my door.\n\nBOB. But it is Christmas, sir.\n\nSCROOGE. Is that cause for trespass?\n\nBOB. They do not come inside the property, sir, they do not trespass.\n \nSCROOGE. They trespass on my time. Keep them away.\n\nBOB. Maybe – if we both refrained from answering the door.\n\nSCROOGE. But what if it is a man paying his debts? No, you must answer the door. Just don’t let the singing creatures inside.\n\nHe looks at BOB.\n\nYou hesitate?\n\nBOB. No, sir.\n\nBeat.\n\nIt’s late, sir – and I am due home, you see, it is Christmas Eve and my children –\n\nSCROOGE. It is late and late is when the singing creatures come. Come, man, you can stay longer.\n\nBOB exits. SCROOGE turns back to his work.\n\nScene Two\n\nThere is a knock upon the door.\n\nSCROOGE. Bob. BOB.\n\nBOB. Yes, sir.\n\nBOB hurries to the door and opens it. He smiles when he sees who is on the other side, Scrooge’s nephew , FRED, a thoughtful and rather delightful individual.\n\nFRED. A merry Christmas, Uncle. God save you.\n\nSCROOGE. Bah. Humbug.\n\nFRED. Christmas, a humbug, Uncle. You don’t mean that.\n\nSCROOGE. Bob, I believe I told you to keep revellers out.\n\nBOB. Not family – this is your nephew, sir.\n\nFRED. Ignore him, Bob, and get off home.\n \nSCROOGE. You will not! You will stay here!\n\nBOB. Yes, sir.\n\nSCROOGE looks at FRED. And then at BOB.\n\nSCROOGE. Leave us.\n\nBOB exits and SCROOGE turns his venom onto his nephew.\n\nMerry Christmas! What right have you to be merry? What reason have you to be merry? You’re poor enough.\n\nFRED. I could equally reply what right have you to be dismal? Morose? You’re rich enough.\n\nSCROOGE. What’s Christmastime but a time for paying bills without money, a time for finding yourself a year older, and not an hour richer?\n\nFRED. Christmastime is a good time: a kind, forgiving, charitable, pleasant time –\n\nSCROOGE. Charitable.\n\nFRED. – and the only time I know of, in the long calender of the year, when men and women open their shut-up hearts freely, and to think of people below them as if they really were fellow-passengers to the grave, and not another race of creatures bound on other journeys.\n\nSCROOGE. And if they are creatures?\n\nFRED. Don’t be angry, Uncle, come dine with us tomorrow.\n\nSCROOGE. I’m busy tomorrow.\n\nFRED. There will be a place laid for you.\n\nHe exits. SCROOGE sits.\n\nSCROOGE. Bob. BOB.\n\nBOB enters. SCROOGE hands him some documents.\n\nDeliver these to the Town Hall, and these to the home of the widow Pritchard.\n\nBeat.\n\nThen you may go.\n\nBOB. Thank you, sir. Merry Christmas, sir.\n \nSCROOGE. Try to be early on Boxing Day, won’t you? There will be plenty to do.\n\nBOB nods and exits.\n\nSCROOGE locks all four doors as he does. He is now encased in a jail of his own making.\n\nHe sets about deconstructing his desk, placing the boxes of money back into the floor. Intent upon his task, he doesn’t hear it when ethereal voices permeate the room. The voices gently carrying the tune but not the lyrics to ‘Gabriel’s Message’.\n\nAnd then the lights start to change, and the music starts to sour, and a voice calls out…\n\nMARLEY. Ebenezer.\n\nSCROOGE looks up for a moment, concerned, but dismisses the thought, and returns to his task.\n\nAnd then he hears the noise of dogs barking and chains approaching.\n\nAnd JACOB MARLEY appears – in an infernal atmosphere of his very own, chains dragging behind him. He walks through his door as if it wasn’t there.\n\nEbenezer.\n\nSCROOGE looks at his old friend, and decides to show no fear. It is not his nature, after all, to show fear for anything. But his fear shines through nonetheless.\n\nSCROOGE. Hush now. What do you want with me?\n\nMARLEY. Much.\n\nSCROOGE. Who are you?\n\nMARLEY. Ask me who I was.\n\nSCROOGE. Who were you then? You’re particular, for a shade.\n\nMARLEY. In life, I was your partner. Jacob Marley.\n\nSCROOGE knows this was what was coming but curls his lip up nonetheless.\n\nYou don’t believe in me.\n\nSCROOGE. I don’t.\n \nMARLEY. Why do you doubt your senses?\n\nSCROOGE. Because a little thing affects them. A slight disorder of the stomach makes them cheats. You may be an undigested bit of beef, a blot of mustard, a crumb of cheese, a fragment of an underdone potato. There’s more of gravy than of grave about you, whatever you are.\n\nMARLEY. I am here, Mr Scrooge, and I have waited seven long years to talk to you. Walking the world, on the wings of the wind, no rest, no peace, the incessant torture of remorse.\n\nSCROOGE laughs .\n\nSCROOGE. You are not Jacob Marley, he’d have no need of remorse. Go now. I have work to do.\n\nMARLEY. I am here tonight to warn you that you have yet a chance and hope of escaping my fate.\n\nSCROOGE. Death? We are all fated to die, Jacob.\n\nMARLEY. A chance and hope of my procuring, Ebenezer. At not little cost.\n\nSCROOGE. You were a good friend to me in life, Jacob, I don’t doubt you’d repeat it in death, but this…\n\nMARLEY. You will be haunted, by three spirits.\n\nSCROOGE. I would rather not be.\n\nMARLEY begins to be pulled back by the chains, he tries to resist but he’s powerless to.\n\nMARLEY. Expect the first when you have retired to bed and the bell tolls one.\n\nSCROOGE pursues his friend as he’s pulled back through the door.\n\nSCROOGE. I will not be haunted, I sleep well.\n\nHe thinks, and then he checks the door is bolted, and then he shakes his head. No. He will not be haunted. He must not be haunted.\n \nScene Three\n\nCHOIR.\n\nIt came upon the midnight clear\n\nThat glorious song of old,\n\nFrom angels playing near the earth,\n\nTo touch their harps of gold,\n\n‘Peace on the earth goodwill to men,\n\nFrom heaven’s all-gracious King’\n\nThe world in solemn stillness lay,\n\nTo hear the angels sing.\n\nSCROOGE paces. The CHOIR hums as the NARRATOR speaks over the top.\n\nNARRATOR. Scrooge resolved to resist bed that night till after the clock chimed one, it was not that he believed Jacob Marley, merely that as every good debtor will tell you – it is caution that pays the rent. That is why he finally retired at well past two –\n\nSCROOGE. – well past the time of any haunting.\n\nThere’s a dong of a massive church clock outside the house. SCROOGE smiles, satisfied.\n\nCHOIR.\n\nOh ye beneath life’s crushing load,\n\nWhose forms are bending low,\n\nWho toil along the climbing way\n\nWith painful steps and slow;\n\nLook now, for glad and golden hours\n\nCome swiftly on the wing;\n\nO rest beside the weary road\n\nAnd hear the angels sing.\n\nNARRATOR. So it was to his great surprise that the next time the heavy bell chimed it did not stop at two –\n\nThe bell dongs again, and then – shockingly – keeps going.\n\n– didn’t stop at three or even four but it went from five to six to seven and then regularly up to twelve. Twelve. Well, surely the clock was wrong. An icicle must have got into the works.\n\nSCROOGE gets up and looks about himself.\n \nSCROOGE. Why, it isn’t possible.\n\nHe thinks, and then grabs a pillow and lies upon the floor.\n\nNARRATOR. So Scrooge, confused, concerned, and a tiny bit confounded, at last retired to bed and thought, and thought and thought it over and over and could make nothing of it.\n\nThe bell rings.\n\nSCROOGE. A quarter past.\n\nThe bell rings again.\n\nA half past.\n\nThe bell rings again.\n\nA quarter to it.\n\nThe bell rings again.\n\nThe hour itself.\n\nThere’s a silence.\n\nThe hour itself.\n\nAnd then comes a figure, a GHOST, pushing a small pram in front of her.\n\nCHOIR.\n\nIt came upon the midnight clear\n\nThat glorious song of old\n\nFrom angels playing near the earth\n\nTo touch their harps of gold.\n\nNARRATOR. The figure – well, it was a strange figure – like a child: yet not so like a child as like an old woman.\n\nThe GHOST looks around the room and sniffs like a lonely dog.\n\nSCROOGE. Well, how ridiculous.\n\nThe GHOST turns to him. She hands him a small lantern, so he can see back to his past.\n\nGHOST OF CHRISTMAS PAST. Hello. Sir.\n \nSCROOGE. Presumably you’re the spirit, whose coming was foretold to me?\n\nGHOST OF CHRISTMAS PAST. I am the Ghost of Christmas Past. Stand up, man.\n\nSCROOGE. Madam, I have no time for –\n\nThe GHOST breathes out, and the doors fall down around them.\n\nGHOST OF CHRISTMAS PAST. You have time, Mr Scrooge.\n\nScene Four\n\nAnd suddenly from all around them the world emerges and is running past them, almost too fast for SCROOGE to take it in.\n\nCHOIR.\n\nIl est né le divin enfant,\n\nJouez hautbois, résonnez musettes!\n\nIl est né le divin enfant,\n\nChantons tous son avènement!\n\nSCROOGE stands amazed as a soundscape is built of a world full of fun.\n\nSCROOGE. But – what is this?\n\nGHOST OF CHRISTMAS PAST. Quite something, isn’t it?\n\nCHILDREN run past throwing snowballs. Having a joyful time in the snow.\n\nSCROOGE. But that’s Ferdy. And Will. And there’s Annie.\n\nGHOST OF CHRISTMAS PAST. You know where we are…\n\nSCROOGE. What magic is this?\n\nGHOST OF CHRISTMAS PAST. No magic at all, simply history.\n\nSCROOGE. But they’ll see…\n \nGHOST OF CHRISTMAS PAST. They are but shadows of the things that have been. They have no consciousness of us. Unless we let them.\n\nFERDY. Merry Christmas!\n\nANNIE. Merry Christmas, Ferdy.\n\nAnd then the world changes again as a SCHOOLMASTER thunders past ringing a bell. SCROOGE flinches away.\n\nGHOST OF CHRISTMAS PAST. You recognise this place?\n\nSCROOGE. My school.\n\nGHOST OF CHRISTMAS PAST. The school is empty now, but not quite deserted. A solitary child, neglected by his friends, is left still there.\n\nA child appears , YOUNG EBENEZER. He looks around himself, he’s lonely. Music begins to play.\n\nSCROOGE. Who’s that?\n\nGHOST OF CHRISTMAS PAST. You don’t recognise him?\n\nSCROOGE. There’s parts of him I do and yet –\n\nGHOST OF CHRISTMAS PAST. You’ve forgotten him in the most part.\n\nSCROOGE walks around the child. And then he realises who it is.\n\nSCROOGE. Oh.\n\nGHOST OF CHRISTMAS PAST. And there we have it. It always takes a moment.\n\nThe GHOST gives YOUNG EBENEZER some toys.\n\nSCROOGE. Was I so unhappy?\n\nGHOST OF CHRISTMAS PAST. Just this day. He has other things to love than friends.\n\nAnd the music becomes optimistic as YOUNG EBENEZER begins playing with his toys.\n\nSCROOGE. Why, it’s Ali Baba!\n\nGHOST OF CHRISTMAS PAST. It’s all returning to you now.\n \nSCROOGE. Dear old Ali Baba.\n\nYOUNG EBENEZER. And Valentine, and his wild brother, Orson. And the Sultan’s groom turned upside down by the Genie –\n\nSCROOGE. The Sultan’s groom.\n\nYOUNG EBENEZER. Serves you right, young groom. I’m glad of it. What business had you to be married to the Princess?!\n\nThe GHOST smiles.\n\nGHOST OF CHRISTMAS PAST. And Parrot.\n\nSCROOGE. Parrot, where’s Parrot?\n\nYOUNG EBENEZER finds Parrot in its satchel.\n\nGreen body and yellow tail, with a thing like a lettuce growing out of the top of his head; there he is!\n\nYOUNG EBENEZER. Poor Robin Crusoe, exhausted he is after sailing round the island. Halloa!\n\nGHOST OF CHRISTMAS PAST. Hoop!\n\nYOUNG EBENEZER. Hallooo!\n\nSCROOGE looks for a moment as if he might join in, but pulls away.\n\nSCROOGE. These toys are long shut away, Ghost – the memories are pleasant but soon forgotten – and as I say –\n\nGHOST OF CHRISTMAS PAST ( interrupting ). That is not all.\n\nLITTLE FAN. A parrot does not a pirate make. But you might be a pirate all the same.\n\nA girl , LITTLE FAN, runs onto the stage. The CHOIR all hum.\n\nSCROOGE. Fan! Is that you?\n\nLITTLE FAN runs into YOUNG EBENEZER ’s arms.\n\nLITTLE FAN. I have come to bring you home, dear brother! To bring you home, home, home.\n \nYOUNG EBENEZER. Home, Little Fan?\n\nLITTLE FAN. Yes.\n\nYOUNG EBENEZER. But he doesn’t want me there.\n\nLITTLE FAN. Father spoke so gently to me one dear night when I was going to bed, that I was not afraid to ask him once more if you might come home; and he said, ‘Yes, go fetch Ebenezer home’; and sent me in a coach to bring you. And you’re to be a man!\n\nSCROOGE. A man? But I’m a child.\n\nLITTLE FAN. And are never to come back here; but first, we’re to be together all the Christmas long, and have the merriest time in all the world.\n\nYOUNG EBENEZER. The merriest time sounds merry indeed.\n\nGHOST OF CHRISTMAS PAST. Always a delicate creature, which a breath might have withered. But she had a large heart.\n\nSCROOGE. You’re right. I will not gainsay it, Spirit. God forbid.\n\nLITTLE FAN leaves the stage. SCROOGE looks after her, moved.\n\nGHOST OF CHRISTMAS PAST. She died a woman, and had, as I think, children.\n\nSCROOGE. One child.\n\nGHOST OF CHRISTMAS PAST. Your nephew.\n\nThe GHOST raises a hand, watching SCROOGE intently. He looks at the spot LITTLE FAN left by.\n\nSCROOGE. Little Fan.\n\nHe shakes his head. The CHOIR ’s hum stops.\n\nIs that it? Is that all I have to see? For I am busy and –\n\nGHOST OF CHRISTMAS PAST. So anxious to get away. What have you to escape?\n\nA man stalks fast onto stage. This is FATHER.\n\nSCROOGE doesn’t see him until YOUNG EBENEZER is hit around the ear, and both are sent hard to the floor.\n \nThey cower as one, united now, neither need look up because both know who’s there.\n\nSCROOGE. Please. Father…\n\nFATHER. Did you expect a fond embrace? After all you’ve done?\n\nSCROOGE. What have I done?\n\nFATHER. You are to leave school.\n\nSCROOGE. I am?\n\nFATHER. Your master tells me you are third in the class. Third? What worth is that? There is no advantage to you staying there that I can see.\n\nSCROOGE. I have worked as hard as I can.\n\nFATHER. Then it is your natural mediocrity that has shone through.\n\nFATHER leans down over his son ominously. SCROOGE covers his face.\n\nDo not weep.\n\nSCROOGE. You’re drunk.\n\nFATHER. I am disappointed. In you. Disappointed men drink.\n\nSCROOGE. Little Fan told me you were bringing me home because I was a man.\n\nFATHER. You will have to be one. I will find you a good apprenticeship.\n\nSCROOGE. So you’ve brought me home because you think I can help out with the debts?\n\nFATHER. There are no debts.\n\nSCROOGE. And yet you send a coach so that the school may think we are not as poor as we are.\n\nFATHER looks at his son a moment more, full of bile.\n\nFATHER. You are not to let me down now.\n\nSCROOGE. I will not let you down.\n\nFATHER. Merry Christmas.\n \nHe walks back to where he came from and is gone.\n\nThe GHOST thinks and then sits beside SCROOGE.\n\nGHOST OF CHRISTMAS PAST. He’s gone.\n\nSCROOGE. I don’t like this.\n\nGHOST OF CHRISTMAS PAST. You are not expected to – but these are the bricks which built you.\n\nSCROOGE looks up, angry now. Unwilling to feel these emotions.\n\nSCROOGE. Nonsense, they’re the bricks you choose to inflict on me as some sort of torture for not leading life as you would have me. Well, enough.\n\nGHOST OF CHRISTMAS PAST. I’m afraid there’s more you need to see.\n\nSCROOGE. You’re sloppy – you’re not even thorough – if you were you’d show my schoolmaster – he did plenty damage.\n\nThe SCHOOLMASTER runs onto stage.\n\nSCHOOLMASTER. BRING DOWN MASTER SCROOGE’S BOX!\n\nSCROOGE turns towards the SCHOOLMASTER who glowers towards him.\n\nGHOST OF CHRISTMAS PAST. But he did not make you who you are, so we travel on.\n\nSCROOGE. He did not affect me? It seems he might have.\n\nGHOST OF CHRISTMAS PAST. Ebenezer, he does not help us to understand as others do.\n\nThe SCHOOLMASTER runs off.\n\nFollow me.\n \nScene Five\n\nAnd now the stage transforms again.\n\nThe CHOIR hum ‘The Wassail’ song as a joyful shop is built. It takes a moment to realise that beneath the joy is an undertaker’s.\n\nSCROOGE. I want to return home.\n\nGHOST OF CHRISTMAS PAST. We only learn through understanding and that means travelling on –\n\nSCROOGE watches the shop being built.\n\nTo your apprenticeship. To your first employer.\n\nFEZZIWIG, a big bear of a man with a big bear of a personality ‘bops’ along with the humming as he crosses the stage . SCROOGE feels conflicted the moment he sees him.\n\nSCROOGE. Fezziwig? No. What possible enlightenment could he [provide]…\n\nG HOST OF CHRISTMAS PAST. Fezziwig, and, of course, his daughter…\n\nBELLE appears and the light changes with her, bright, wonderful, gracious, she is everything SCROOGE is not , SCROOGE walks every step with her. Amazed to see her again.\n\nSCROOGE. Belle.\n\nShe turns, and looks at SCROOGE. Surprised to see him stare.\n\nBELLE. Why do you look at me so?\n\nSCROOGE. I am not looking.\n\nBELLE. You are, and it’s impertinent.\n\nSCROOGE. I apologise, madam.\n\nShe thinks and then walks on.\n\nTell me – what is your connection to this establishment?\n\nBELLE. I am the daughter of the proprietor. Is that why you look at me? Is that why you stare?\n \nSCROOGE. I do not mean to stare.\n\nBELLE. You’re here for the undertaker’s apprentice position and think he may grant it you as a favour to me – so you seek to charm me – by – gazing – at me? A curious strategy.\n\nSCROOGE. I was sent by my father, I don’t care if I’m apprenticed or not.\n\nBELLE. Tell me, if I were to recommend you to Papa, what might I say? You lack enthusiasm but you have a good look to you, are you strong? You seem so.\n\nSCROOGE. Not so strong. But strong enough.\n\nBELLE. Well then – are you quick-witted at least? We need quick-witted souls in our business, for the demands of it are –\n\nSCROOGE. My wits are good. Quiz me.\n\nBELLE. Then you do wish the job?\n\nSCROOGE. Or else I just wish to impress you.\n\nBELLE. Impress me, why would you wish to do that?\n\nSCROOGE. For the game of it, nothing else.\n\nBELLE smiles, amused. SCROOGE smiles with her, he can’t help but do so.\n\nBELLE. You’re fun.\n\nSCROOGE. I’m not.\n\nBELLE. Two families enter at once, they both want a funeral for the same day, one lost a young child, the other an elderly relative, who do you serve?\n\nSCROOGE. Who has the richer purse?\n\nBELLE laughs .\n\nBELLE. Oh, sir.\n\nSCROOGE. I’ve failed?\n\nBELLE. Or shown your truth.\n\nSCROOGE. What would you have said? For fun.\n \nBELLE. The correct answer is you ask the family of the elderly relative to wait – for they’ve had a life with that which they’ve lost – it’s those whose grief most overwhelms that we need to serve first.\n\nShe smiles.\n\nFather. Father.\n\nFEZZIWIG re-emerges from the shop.\n\nFEZZIWIG. Belle. And who is this young man?\n\nBELLE. I rather fear he may be your next apprentice.\n\nFEZZIWIG. And why might you fear that? He has a good face. Strong arms. I already like him.\n\nBELLE. He has ambition, Father.\n\nFEZZIWIG. But has he quick wits? That is the question.\n\nSCROOGE looks at BELLE.\n\nSCROOGE. I’d hope them quick enough.\n\nFEZZIWIG. Tell me, in my establishment, sometimes we have to serve competing needs, so imagine – two families entering together, they both want a funeral for the same day, one lost a young child, the other an elderly relative, who do you prioritise?\n\nSCROOGE looks at BELLE, wryly, she gives nothing away.\n\nSCROOGE. Firstly, sir, I would try and serve them both.\n\nFEZZIWIG. Impossible.\n\nSCROOGE. Then I would prioritise the family that lost a child.\n\nFEZZIWIG. The family with the elderly relative offer more money.\n\nSCROOGE. But they have had a life with that which they’ve lost, the family with the young child has already borne too great a cost.\n\nFEZZIWIG looks at BELLE, so does SCROOGE.\n\nFEZZIWIG. Impressive, Belle. Do you not think?\n \nBELLE. I believe I do.\n\nFEZZIWIG extends an enthusiastic hand to SCROOGE.\n\nFEZZIWIG. You’re hired. You’re hired.\n\nHe disappears back into his shop.\n\nSCROOGE looks at BELLE a moment longer.\n\nSCROOGE. Thank you.\n\nBELLE. What do I call you?\n\nSCROOGE. I’m Ebenezer Scrooge.\n\nBELLE. Good morning, Ebenezer. You may call me Belle.\n\nScene Six\n\nAnd if you could get happiness in a jar that’s what you’d see now. BELLE and SCROOGE work hard within Fezziwig’s workshop. Their symmetry a thing of true loveliness. There’s hustle, there’s bustle, coffins are made, and futures come with them.\n\nCHOIR.\n\nI saw three ships come sailing in,\n\nOn Christmas Day, on Christmas Day;\n\nI saw three ships come sailing in,\n\nOn Christmas Day in the morning.\n\nAnd wither sailed those ships all three,\n\nOn Christmas Day, on Christmas Day;\n\nAnd wither sailed those ships all three,\n\nOn Christmas Day in the morning.\n\nFEZZIWIG enters – full of action and meaning.\n\nFEZZIWIG. They cannot pay.\n\nSCROOGE. Sir?\n\nFEZZIWIG. They want to bury their brother, but they lack the funds. We will build them a strong coffin nonetheless.\n \nSCROOGE. Sir.\n\nBELLE. And we will charge a little more to the next family with money that comes through our door. Those with – can afford to support those without.\n\nSCROOGE smiles .\n\nFEZZIWIG. My daughter has a head for everything, Mr Scrooge.\n\nSCROOGE. She certainly does.\n\nBeat.\n\nI think your daughter might be quite quite extraordinary.\n\nAs SCROOGE moves happily about the stage, so something new is built. His father’s office. Though SCROOGE doesn’t at first see it.\n\nCHOIR.\n\nAnd all the bells on earth shall ring,\n\nOn Christmas Day, on Christmas Day;\n\nAnd all the bells on earth shall ring,\n\nOn Christmas Day in the morning.\n\nAnd all the souls on earth shall sing,\n\nOn Christmas Day, on Christmas Day;\n\nAnd all the souls on earth shall sing,\n\nOn Christmas Day in the morning.\n\nBut something about the final note seems wrong. And so it is, as from light comes darkness and SCROOGE sees his FATHER again.\n\nSCROOGE. Father.\n\nFATHER sits at a smaller desk than SCROOGE had at the beginning of the play. His cuffs are frayed. He looks overwhelmed. He looks increasingly destitute.\n\nFATHER. Ebenezer.\n\nSCROOGE. Merry Christmas, Father.\n\nFATHER. And to you, Ebenezer.\n\nSCROOGE. Father, you don’t seem yourself.\n \nFATHER. Why are you home?\n\nSCROOGE. For Christmas, sir.\n\nFATHER looks around distractedly.\n\nFATHER. Has that come so soon?\n\nSCROOGE. I have gifts.\n\nFATHER looks up, suddenly engaged.\n\nFATHER. You do? What worth have they?\n\nSCROOGE. I have gifts for Fanny –\n\nFATHER. Fanny is studying…\n\nHe opens SCROOGE ’s bag. He pulls out what’s inside.\n\nSome silk…\n\nSCROOGE. I thought she might make a dress.\n\nFATHER. Some ribbon.\n\nSCROOGE. Father, this is not how I wanted to give these –\n\nFATHER. Did I not support you?\n\nSCROOGE. I send you money.\n\nFATHER. Did I not put food on your table?\n\nSCROOGE. Not always. I send you money.\n\nFATHER. Not enough. Your sister needs supporting. Your mother is sick. You must contribute.\n\nHe looks at SCROOGE. And then at the bag.\n\nThis – that which I can sell I will – but when you return again – you return with money for the whole family – you understand?\n\nLITTLE FAN appears at the side of the stage, full of excitement.\n\nSCROOGE. Yes, Father.\n\nLITTLE FAN. Ebenezer. It is you!\n \nFATHER. Speak not a word of this.\n\nHe picks up the bag of gifts. He exits.\n\nLITTLE FAN rushes into SCROOGE ’s arms.\n\nLITTLE FAN. You’re home.\n\nSCROOGE. It is a joy to see you again, Fan.\n\nLITTLE FAN. You look well, healthy.\n\nSCROOGE. As do you. But Mother…\n\nLITTLE FAN. Getting stronger every day.\n\nSCROOGE. And Father? The debts, are they worse?\n\nLITTLE FAN. Let’s not talk about the sour things, let’s talk about the good.\n\nSCROOGE. How is your practice?\n\nLITTLE FAN. Exasperating.\n\nShe smiles.\n\nBut beautiful. They say I’m becoming accomplished, I don’t believe them. You look happy.\n\nSCROOGE. Yes.\n\nLITTLE FAN. I made you something. Just a fun gift. For Christmas, you understand.\n\nSCROOGE opens the gift. He smiles. It is a scarf, multicoloured and joyful.\n\nSCROOGE. Why, it’s the strangest of scarfs.\n\nHe laughs. He puts it on. And then his expression changes. Grows pained.\n\nI’m afraid – I got you nothing.\n\nLITTLE FAN. You’re busy. You have many matters to attend to. You don’t need think of me.\n\nSCROOGE thinks how to respond to this.\n\nSCROOGE. Thank you. I will use it always.\n \nLITTLE FAN. I worry of you in that parlour – I want to keep you safe – from those coffins – from the dead.\n\nSCROOGE. Thank you, Fan. Merry Christmas.\n\nLITTLE FAN. Merry Christmas, Ebenezer.\n\nScene Seven\n\nFezziwig’s house is full of Christmas cheer. Everyone is eating and being merry.\n\nCHOIR.\n\nWassail! wassail! All over the town,\n\nOur toast it is white and our ale it is brown;\n\nOur bowl it is made of the white maple tree;\n\nWith the wassailing bowl, we’ll drink to thee.\n\nNARRATOR. Fezziwig’s house at Christmas was a house unlike any other. Perhaps because it specialised in death, the house desired to live, and at Christmas that is what it did.\n\nThere were games and forfeits, there was laughter, there was port and hock, and there was a great piece of cold roast and a great piece of cold boiled and there were mince pies and plenty of beer.\n\nAnd the whole room dances. A revel, a jig, an expansive affair that is full of joy ( and beer ).\n\nAnd somehow BELLE ends up dancing with SCROOGE. And it’d be a lie to say that the two are unhappy with this arrangement. Something is happening here, and it is happening fast.\n\nThe two look shy at first. But the dance takes them ( or they take the dance ) and magic happens.\n\nAnd a great undulating rhythm takes over them and the whole room.\n\nThis is a ceilidh and it is joyful.",
      "summary": "The play begins with Ebenezer Scrooge's introduction as a miserly, cold-hearted man. On Christmas Eve, he is visited by the ghost of his former partner, Jacob Marley, who warns him of three spirits to come. The Ghost of Christmas Past appears and takes Scrooge on a journey through his childhood and early adult life, showing him pivotal moments that shaped his character.",
      "prominence": 95,
      "key_characters": [
        {
          "name": "Ebenezer Scrooge",
          "description": "A miserly, cold-hearted old man who hates Christmas and kindness.",
          "summary": "Scrooge is forced to confront his past and the choices that led him to become the man he is. He experiences a range of emotions from denial to reluctant acceptance as he revisits key moments in his life."
        },
        {
          "name": "Ghost of Christmas Past",
          "description": "A spirit that appears as both childlike and elderly.",
          "summary": "The Ghost guides Scrooge through his past, showing him significant events that shaped his character and decisions."
        },
        {
          "name": "Belle",
          "description": "Fezziwig's daughter and Scrooge's love interest in his youth.",
          "summary": "Belle represents the path not taken for Scrooge, showing his capacity for love and joy in his younger years."
        },
        {
          "name": "Fezziwig",
          "description": "Scrooge's kind and jolly first employer.",
          "summary": "Fezziwig embodies the spirit of generosity and joy that Scrooge has lost, serving as a contrast to Scrooge's current demeanor."
        }
      ],
      "chapter": "ACT ONE",
      "conversation": [
        {
          "scenario": "Scrooge is transported back to his past, witnessing his younger self meeting Belle for the first time at Fezziwig's shop.",
          "topic": "Scrooge's job interview and first encounter with Belle",
          "key_characters": [
            {
              "name": "Ebenezer Scrooge",
              "thought": "[I'm overwhelmed with emotions seeing Belle again. I must maintain my composure and not show how much this affects me.]"
            },
            {
              "name": "Belle",
              "thought": "[This young man seems interesting, though a bit impertinent. I'm curious to see how he handles Father's test.]"
            },
            {
              "name": "Fezziwig",
              "thought": "[I hope this lad has the quick wit we need for our business. Belle seems to like him, which is a good sign.]"
            }
          ],
          "dialogues": [
            {
              "character": "Belle",
              "message": "[This young man is quite bold, staring at me so. I'll challenge him a bit.] Why do you look at me so?"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm caught off guard by her directness. I must be careful with my words.] I am not looking."
            },
            {
              "character": "Belle",
              "message": "[He's lying, but I find it amusing.] You are, and it's impertinent."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I feel embarrassed, but also intrigued by her.] I apologise, madam."
            },
            {
              "character": "Belle",
              "message": "[I'll give him a chance to explain himself.] Tell me – what is your connection to this establishment?"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'll be honest, but maintain some mystery.] I am the daughter of the proprietor. Is that why you look at me? Is that why you stare?"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[Her directness is both intimidating and appealing.] I do not mean to stare."
            },
            {
              "character": "Belle",
              "message": "[He's interesting. I'll test him further.] You're here for the undertaker's apprentice position and think he may grant it you as a favour to me – so you seek to charm me – by – gazing – at me? A curious strategy."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'll show her I'm not easily swayed.] I was sent by my father, I don't care if I'm apprenticed or not."
            },
            {
              "character": "Belle",
              "message": "[His indifference intrigues me. I'll push him a bit more.] Tell me, if I were to recommend you to Papa, what might I say? You lack enthusiasm but you have a good look to you, are you strong? You seem so."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'll be modest, but not self-deprecating.] Not so strong. But strong enough."
            },
            {
              "character": "Belle",
              "message": "[He's clever. I'll challenge him one last time.] Well then – are you quick-witted at least? We need quick-witted souls in our business, for the demands of it are –"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'll show her my confidence.] My wits are good. Quiz me."
            },
            {
              "character": "Belle",
              "message": "[He's fun. I'll play along.] Then you do wish the job?"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'll be bold and flirtatious.] Or else I just wish to impress you."
            },
            {
              "character": "Belle",
              "message": "[His charm is working, but I won't let him see that easily.] Impress me, why would you wish to do that?"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'll keep the banter going.] For the game of it, nothing else."
            },
            {
              "character": "Belle",
              "message": "[I can't help but smile. He's quite charming.] You're fun."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'll maintain the playful denial.] I'm not."
            },
            {
              "character": "Belle",
              "message": "[Time for the real test.] Two families enter at once, they both want a funeral for the same day, one lost a young child, the other an elderly relative, who do you serve?"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'll answer honestly, even if it might not be what she wants to hear.] Who has the richer purse?"
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "The COMPANY stand in full on stage.\n\nArmed ominously with hand bells.\n\nThey smile at the audience.\n\nThey play ‘Ding Dong Merrily on High’.\n\nIt gets quite involved.\n\nThey finish with a flourish.\n\nThe promise of Christmas.\n\nAnd as they do, so SCROOGE enters and the promise disappears, the walls reform and the darkness returns.\n\nAnd the COMPANY becomes a CHOIR and the CHOIR begins to sing the dark and enchanting ‘Coventry Carol’.\n\nCHOIR.\n\nLullay, lullay\n\nMy little tiny child\n\nBy-by, lullay, lullay\n\nNARRATOR. Scrooge did not sleep. Instead sat in his chair…\n\nSCROOGE tries to resist, every part of his body strains.\n\nThe NARRATOR turns and looks at him.\n\nScrooge did not sleep. Instead, he sat upon his chair…\n\nSCROOGE is compelled backwards, every sinew fighting it, into his chair.\n\nAnd he waited. For he knew he had one last ghost to visit him.\n\nCHOIR.\n\nLullay, lullay\n\nMy little tiny child\n\nBy-by, lullay, lullay\n \nNARRATOR. When the phantom arrived it looked like no other…\n\nA black mist appears in the room, spiralling over chairs. The wind howls through the windows.\n\nCHOIR.\n\nOh, sisters too\n\nHow may we do\n\nFor to preserve this day?\n\nNARRATOR. It slowly, gravely, silently approached. When it came near him, Scrooge bent down upon his knee; for in the very air through which this spirit moved it seemed to scatter gloom and mystery.\n\nSCROOGE descends to one knee, looking up at the mist.\n\nCHOIR.\n\nThis poor youngling\n\nOf whom we do sing\n\nBy-by, lullay, lullay\n\nHerod the King\n\nIn his raging\n\nCharged he hath this day\n\nHis men of might\n\nIn his own sight\n\nAll children young to slay\n\nThen woe is me\n\nPoor child for thee\n\nAnd ever mourn and say\n\nFor thy parting\n\nNor say nor sing\n\nBy-by, lullay, lullay\n\nA dripping hand stretches out of the black mist.\n\nNARRATOR. Nothing of the figure was visible save one outstretched hand. But for this it would have been difficult to detach its figure from the night, and separate it from the darkness by which it was surrounded. Scrooge felt that it was tall and stately when it came beside him, and that its mysterious presence filled him with a solemn dread. He knew no more, for the spirit neither spoke nor moved.\n\nCHOIR.\n\nLullay, lullay\n\nMy little tiny child\n\nBy-by, lullay, lullay\n\nLullay, lullay\n\nMy little tiny child\n\nBy-by, lullay, lu\n\nBy-by, lullay, lu\n\nBy-by, lullay, lu –\n\nAnd then everything goes dark and silent.\n\nSCROOGE ( in darkness ). You are the Ghost of Christmas Future?\n\nThere is nothing, no sound.\n\nYou will not speak?\n\nThere is nothing.\n\nThen you will show. Show me my future.\n\nA coffin appears on the stage. And the walls around him break.\n\nThat is not such an unusual future.\n\nThe black mist reappears above the coffin, and from the coffin emerges a sopping wet LITTLE FAN, she is holding a giant lantern, she absorbs the black mist.\n\nShe is the Ghost of Christmas Future. She drips onto the floor.\n\nLITTLE FAN. Hello, brother.\n\nSCROOGE. Hello, Fan. Are you my ghost?\n\nLITTLE FAN. Yes.\n\nSCROOGE. You are to tell me about my future, Little Fan?\n\nLITTLE FAN. Yes.\n\nSCROOGE. Will I want to hear it?\n \nLITTLE FAN. I won’t be with you when it comes, I’d like to tell you of it now.\n\nSCROOGE. Fan…\n\nLITTLE FAN pulls SCROOGE to the lantern and both grip tight as SCROOGE ’s future passes through them both.\n\nFan, what are you doing?\n\nLITTLE FAN. I’m running through your life.\n\nSCROOGE. What are you seeing?\n\nLITTLE FAN. Doors shutting.\n\nSCROOGE. Doors shutting?\n\nLITTLE FAN. But you’re the one shutting them.\n\nSCROOGE. Is that good?\n\nLITTLE FAN. You never had children?\n\nSCROOGE. Did I not?\n\nLITTLE FAN. Did you think you may?\n\nSCROOGE. I did think I might.\n\nLITTLE FAN. You never had a partner.\n\nSCROOGE. I had Jacob Marley.\n\nLITTLE FAN. You never had someone to share your life with.\n\nSCROOGE. No.\n\nLITTLE FAN. You have so much money.\n\nSCROOGE. I do.\n\nLITTLE FAN. More money than I can even imagine. And yet, you live so humbly.\n\nSCROOGE. Do I?\n\nLITTLE FAN. Are you not cold with no fire?\n\nSCROOGE. Cold is not something to be frightened of.\n\nLITTLE FAN. Are you not blind with so little light?\n \nSCROOGE. I can read well enough.\n\nLITTLE FAN. Are you not hungry with so little love?\n\nSCROOGE wrenches the lantern free from his dead sister’s grasp.\n\nSCROOGE. Fan…\n\nThere is silence.\n\nScene Two\n\nLITTLE FAN turns and faces the coffin.\n\nLITTLE FAN. You will leave a lot. But what you leave will be used by no one but thieves.\n\nSCROOGE. Thieves?\n\nLITTLE FAN. You will cut out those you love.\n\nBOB walks up to face the coffin, older now.\n\nBOB. My name is Bob Cratchit. I had the good fortune to work with Mr Scrooge for a good number of years before we parted ways…\n\nSCROOGE. Why did we part ways?\n\nLITTLE FAN. You fired him for poor timekeeping after he fell apart following the death of his son.\n\nSCROOGE nods sadly.\n\nBOB. Mr Scrooge –\n\nBOB briefly breaks down.\n\nMr Scrooge was not a man known for his charity or his overt acts of kindness. But that doesn’t mean there wasn’t a good man in there. As he told me once, taking on a debt is a kindness, giving rigour to that debt is a kindness indeed. He taught me discipline, he taught me – I will miss him.\n \nSCROOGE. He’s kind.\n\nBOB stands a moment over the coffin. He touches it lovingly.\n\nKinder than I deserve.\n\nFRED walks up to the coffin, he too places a hand upon it. \n\nFRED. My uncle – died as he lived – unable to find joy in the most basic of things. He was a tragedy. As many of you know, we didn’t speak for the last few years of his life, but I tried to make sure he was well cared for, and I like to think he still cared for me. I suspect he did.\n\nSCROOGE. Why did we not speak?\n\nLITTLE FAN. You changed the locks when he tried to move you into his house. He wanted to look after you. But you thought he wanted your money.\n\nSCROOGE. He didn’t?\n\nLITTLE FAN. No. But as a result of his attempted kindness, you left your money to no one. The gold that was hidden will rot, that which you left above ground will be stolen.\n\nSCROOGE. Stolen.\n\nLITTLE FAN. Those you had left around you were mean and merciless. When you died they thieved the blankets from your bed.\n\nAnd then BELLE appears at the back of the stage. SCROOGE senses her presence and turns towards her.\n\nSCROOGE. Belle?\n\nLITTLE FAN. She had to come. She had to say her piece.\n\nShe walks up to the coffin.\n\nBELLE. I knew Ebenezer – for a number of years, but the man I knew is not the man I see reflected in how you’ve spoken. Not that I’m doubting your truth…\n\nSCROOGE. Please doubt it. Please.\n\nBELLE. But my Ebenezer, he was optimistic, forward-thinking, determined to make good with his life and support the lives of others. I cannot mourn him today, for I have mourned him too much already. But I did want to say goodbye.\n\nShe touches the coffin – and then walks away through the church and out.\n\nSCROOGE. Belle –\n\nShe turns around and looks at him.\n\nSo what have you to tell me, Little Fan? Other than I died unloved?\n\nLITTLE FAN. You’ve misunderstood –\n\nSCROOGE. Have I?\n\nLITTLE FAN. These people, they wanted to love you, you just gave them nothing to love you for.\n\nSCROOGE is unprepared for this.\n\nTruly totally unprepared.\n\nSo unprepared he refuses it.\n\nSCROOGE. No. No. Belle would not come to any service for I.\n\nLITTLE FAN. Of course she would.\n\nSCROOGE. And Bob Cratchit – if I truly did fire him – hatred alone would stop him –\n\nBOB. You’re wrong there, sir.\n\nBOB seems almost to see SCROOGE, and FRED the same.\n\nSCROOGE. And my nephew – if I cut him out of my will then what reason –\n\nFRED. Respect, sir.\n\nSCROOGE. But that is no way – you neither liked me or –\n\nFRED. Pity the meek, sir. And the weak.\n\nSCROOGE. Ah, you see, pity, that’s why he is here, pity.\n\nFRED. And love.\n\nSCROOGE is flattened again.\n \nSCROOGE. But that’s not – that’s not –\n\nLITTLE FAN. You find that too hard to believe?\n\nShe looks at him.\n\nYou were alone when you died and you needn’t have been. And you were lonely when you lived and you needn’t have been.\n\nSCROOGE wobbles to and fro.\n\nSCROOGE. No. No. Everyone dies. I refuse to feel sentiment over such an – if you were to show me the funeral of that boy – Tim – then maybe –\n\nLITTLE FAN. We can see that. But I chose not to show it. The pain you’ve caused – I believe my colleagues have ensured you’ve seen it – I wanted to show you the possibilities of love. The love you spurned. The love you turned away.\n\nSCROOGE walks away from her.\n\nSCROOGE. No. No. I don’t believe –\n\nLITTLE FAN. Then don’t believe.\n\nSCROOGE. I don’t wish this lesson.\n\nLITTLE FAN. Then don’t learn it. But this is your fate, if you don’t.\n\nSCROOGE. This was not my fault.\n\nLITTLE FAN. Then whose was it?\n\nSCROOGE looks up at her imploringly.\n\nWe are all made. But we all make in turn.\n\nSCROOGE turns back to her.\n\nFATHER appears at the back of the stage.\n\nThe two feel his ominous presence.\n\nSCROOGE. When I shut my eyes I",
      "summary": "Scrooge is visited by the Ghost of Christmas Future, who appears as his deceased sister, Little Fan. She shows him visions of his own funeral, where despite his miserly ways, people still show compassion and respect. Scrooge struggles to accept these revelations, attempting to rationalize or deny them. The ghost emphasizes that Scrooge has spurned love and connection throughout his life, leading to a lonely death. As Scrooge grapples with these revelations, his father's presence looms, hinting at unresolved childhood issues.",
      "prominence": 95,
      "key_characters": [
        {
          "name": "Ebenezer Scrooge",
          "description": "A miserly old man confronting the consequences of his life choices.",
          "summary": "Scrooge faces the harsh reality of his future, struggling to accept the impact of his actions on others and himself. He attempts to rationalize and deny the visions shown to him, revealing his deep-seated fears and regrets."
        },
        {
          "name": "Little Fan",
          "description": "Scrooge's deceased sister appearing as the Ghost of Christmas Future.",
          "summary": "Little Fan serves as a guide, showing Scrooge visions of his future and the consequences of his actions. She attempts to make him understand the love he has spurned throughout his life."
        },
        {
          "name": "Bob Cratchit",
          "description": "Scrooge's former employee, now older.",
          "summary": "Despite being fired by Scrooge, Bob shows compassion and respect at Scrooge's funeral, demonstrating the kindness Scrooge failed to appreciate in life."
        },
        {
          "name": "Fred",
          "description": "Scrooge's nephew, speaking at his funeral.",
          "summary": "Fred expresses a mix of sadness and pity for his uncle, revealing their estranged relationship and his attempts to care for Scrooge in his final years."
        },
        {
          "name": "Belle",
          "description": "Scrooge's former love interest, attending his funeral.",
          "summary": "Belle's presence at the funeral and her words reveal the lasting impact of their relationship and the man Scrooge once was, highlighting the tragedy of his life choices."
        }
      ],
      "chapter": "ACT THREE",
      "conversation": [
        {
          "scenario": "Scrooge is shown visions of his own funeral by the Ghost of Christmas Future, his sister Little Fan.",
          "topic": "Scrooge's legacy and the impact of his life choices",
          "key_characters": [
            {
              "name": "Ebenezer Scrooge",
              "thought": "[I'm overwhelmed with disbelief and fear. I can't accept that this is my future, but I'm struggling to deny the evidence before me.]"
            },
            {
              "name": "Little Fan",
              "thought": "[I must make my brother understand the consequences of his actions and the love he has rejected throughout his life.]"
            }
          ],
          "dialogues": [
            {
              "character": "Little Fan",
              "message": "[I need to show Ebenezer the harsh truth.] Hello, brother."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm shocked to see my sister as the Ghost of Christmas Future. I must maintain some composure.] Hello, Fan. Are you my ghost?"
            },
            {
              "character": "Little Fan",
              "message": "[I'll be direct.] Yes."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm uncertain about what's to come.] You are to tell me about my future, Little Fan?"
            },
            {
              "character": "Little Fan",
              "message": "[I'll confirm his suspicions.] Yes."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm filled with apprehension.] Will I want to hear it?"
            },
            {
              "character": "Little Fan",
              "message": "[I'll be gentle but firm.] I won't be with you when it comes, I'd like to tell you of it now."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm growing more anxious.] Fan..."
            },
            {
              "character": "Little Fan",
              "message": "[I'll show him the truth of his life.] I'm running through your life."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm curious despite my fear.] What are you seeing?"
            },
            {
              "character": "Little Fan",
              "message": "[I'll be blunt.] Doors shutting."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm confused and defensive.] Doors shutting?"
            },
            {
              "character": "Little Fan",
              "message": "[I need to make him understand his role in this.] But you're the one shutting them."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm uncertain how to interpret this.] Is that good?"
            },
            {
              "character": "Little Fan",
              "message": "[I'll change the subject to something more personal.] You never had children?"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm taken aback by this sudden change.] Did I not?"
            },
            {
              "character": "Little Fan",
              "message": "[I'll probe deeper.] Did you think you may?"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I feel a pang of regret.] I did think I might."
            },
            {
              "character": "Little Fan",
              "message": "[I'll continue to highlight his loneliness.] You never had a partner."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'll try to justify myself.] I had Jacob Marley."
            },
            {
              "character": "Little Fan",
              "message": "[I need to make him understand the difference.] You never had someone to share your life with."
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": " can still see him –\n\nLITTLE FAN. Father appears to me too.\n\nSCROOGE. All this haunting and it’s he that –\n \nLITTLE FAN. And he never will leave you. Some ghosts can’t. I shall leave you soon though – will you listen to me before I do?\n\nSCROOGE sinks to his knees. Thinking.\n\nSCROOGE. It’s too much.\n\nLITTLE FAN. Is it?\n\nSCROOGE looks at her. YOUNG EBENEZER runs into the room and leaps effortlessly onto the coffin.\n\nSCROOGE. Oh.\n\nLITTLE FAN. Look at him. Cradling his Parrot. So full of excitement.\n\nSCROOGE. And fear.\n\nLITTLE FAN. What would you have him be?\n\nSCROOGE looks at his young self. He smiles.\n\nSCROOGE. A scientist.\n\nLITTLE FAN. A teacher.\n\nSCROOGE. A watchmaker.\n\nLITTLE FAN. A shopkeeper.\n\nSCROOGE. A politician.\n\nLITTLE FAN. A singer.\n\nSCROOGE. A journalist.\n\nLITTLE FAN. An adventurer.\n\nSCROOGE laughs, delighted.\n\nSCROOGE. An adventurer to where?\n\nLITTLE FAN. That is not for me to know. Maybe – somewhere that is yet to be found.\n\nSCROOGE approaches YOUNG EBENEZER, quite overwhelmed with all he’s feeling.\n\nYou’re sad.\n \nWe hold on the insecurity of this moment. And then a tap turns.\n\nSCROOGE. Because I don’t want him to be me.\n\nLITTLE FAN. No.\n\nSCROOGE takes YOUNG EBENEZER in his arms as the emotions flood out of him.\n\nNo.\n\nSCROOGE. I don’t want him to be me.\n\nLITTLE FAN. No.\n\nSCROOGE I want him to do good, not harm.\n\nLITTLE FAN That does sound a better life.\n\nSCROOGE. And I want him to love.\n\nLITTLE FAN. Of course you do.\n\nWith a gong from above , YOUNG EBENEZER dismounts the coffin and runs away.\n\nSCROOGE. Oh Little Fan, what have I done?\n\nLITTLE FAN. You’ve simply lived. As man does. Without thought. Without love. For others. Or even for yourself.\n\nSCROOGE. And am I – past all hope?\n\nLITTLE FAN. I’m not sure you can be past hope.\n\nSCROOGE falls to his knees, finally able to let himself free.\n\nSCROOGE. I will honour Christmas in my heart, and try to keep it all the year. I will live in the past, the present, and the future. The spirits of all three shall strive within me. I will not shut out the lessons that they teach. Oh, tell me I may change the way the world spins.\n\nAnd LITTLE FAN fastens the large lantern onto her chain above her.\n\nSCROOGE stands a moment, bereft.\n\nLITTLE FAN. The world does spin.\n \nAnd with that she begins to wheel the lantern around.\n\nFaster. And then faster still.\n\nAnd SCROOGE is rewound through the play.\n\nBack to his bed.\n   \nACT FOUR\n\nScene One\n\nSCROOGE lies in bed, tossing and turning.\n\nCHOIR.\n\nSee amid the winter’s snow,\n\nBorn for us on earth below,\n\nSee the tender Lamb appears,\n\nPromised from eternal years.\n\nHail, thou ever-blessed morn!\n\nHail, redemption’s happy dawn!\n\nSing through all Jerusalem,\n\nChrist is born in Bethlehem.\n\nSCROOGE wakes and the whole stage seems to shudder as he does.\n\nHe looks around himself.\n\nHe climbs out of bed.\n\nSay, ye holy shepherds, say\n\nWhat your joyful news today;\n\nWherefore have ye left your sheep,\n\nOn the lonely mountain steep?\n\nHail, thou ever-blessed morn!\n\nHail, redemption’s happy dawn!\n\nSing through all Jerusalem,\n\nChrist is born in Bethlehem.\n\nSacred infant, all divine,\n\nWhat a tender love was Thine,\n\nThus to come from highest bliss,\n\nDown to such a world as this.\n\nHail, thou ever-blessed morn!\n\nHail, redemption’s happy dawn!\n\nSing through all Jerusalem,\n\nChrist is born in Bethlehem.\n \nHe opens the door.\n\nThe CAROL SINGERS are outside it. He looks at them, astonished.\n\nSCROOGE. But – what are you doing here?\n\nThey look back, frightened at his wide eyes and discombobulation.\n\nWhere are my manners? Come inside, get warm, then tell me what day is today?\n\nHe ushers them inside.\n\nCAROL SINGER. Today, sir?\n\nSCROOGE. Yes. Tell me the day.\n\nCAROL SINGER. But it’s Christmas, sir.\n\nSCROOGE nods. But doesn’t take it in.\n\nWe are collecting for the –\n\nSCROOGE. It’s Christmas. Today?\n\nCAROL SINGER. Yes, sir. Will you give, sir…\n\nSCROOGE pulls a money box from the floor. He grabs a stack of notes from it.\n\nSCROOGE. You promise me now – it’s no trick? It’s Christmas.\n\nCAROL SINGER. Christmas Day, sir.\n\nSCROOGE whoops .\n\nSCROOGE. Then that is good news indeed, is it not?\n\nCAROL SINGER. Yes, sir. You like Christmas?\n\nSCROOGE stuffs notes in the CAROL SINGER ’s hands – and then thinks and then gives her the full money box. The CAROL SINGER is astonished.\n\nSCROOGE. I like it very well indeed.\n\nCAROL SINGER. But this is too much.\n\nSCROOGE. No. This is but a start. Merry Christmas. Merry Christmas, madam.\n\nThe CAROL SINGER departs.\n \nScene Two\n\nAnd SCROOGE erupts with Christmas spirit and around him come the three GHOSTS – the GHOST OF CHRISTMAS PAST, the GHOST OF CHRISTMAS PRESENT and LITTLE FAN.\n\nLITTLE FAN. He is happy.\n\nGHOST OF CHRISTMAS PRESENT. He is ecstatic.\n\nSCROOGE. I don’t know what to do! I am as light as a feather.\n\nGHOST OF CHRISTMAS PAST. He is light as a feather.\n\nSCROOGE. I am as happy as an angel.\n\nGHOST OF CHRISTMAS PAST. Happy as an angel.\n\nSCROOGE. I am as merry as a schoolboy.\n\nGHOST OF CHRISTMAS PAST. Merry as a schoolboy.\n\nGHOST OF CHRISTMAS PRESENT. He is giddy as a drunk.\n\nThe GHOSTS laugh.\n\nSCROOGE. A merry Christmas to everybody! A happy New Year to all the world.\n\nAnd SCROOGE runs out into London.\n\nAnd London snows. Snow falls everywhere.\n\nHe dances amongst the audience, introducing himself, full of glee.\n\nNARRATOR. And Scrooge ran out into Christmas Day morning and he was a very different Scrooge than the one who left his door the morning before.\n\nCHOIR.\n\nJoy to the World, the Lord is come!\n\nLet earth receive her King;\n\nSCROOGE. Hallo here! Whoop! Hallo!\n\nThe audience reacts in a myriad of ways as is their wont and SCROOGE responds to them in turn.\n \nSCROOGE. Merry Christmas indeed.\n\nCHOIR.\n\nLet every heart prepare Him room,\n\nAnd Heaven and nature sing,\n\nAnd Heaven and nature sing,\n\nAnd Heaven, and Heaven, and nature sing.\n\nNARRATOR. He went to church, and walked about the streets, and watched the people hurrying to and fro, and patted children on the head, and questioned beggars, and looked down into the kitchens of houses, and up to the windows, and found that everything could yield him pleasure. He had never dreamed that any walk, that anything could give him so much happiness.\n\nSCROOGE. It does give me happiness.\n\nLITTLE FAN. So much happiness.\n\nNARRATOR. And he stood in the street – and he watched Christmas happen around him and no man has ever loved Christmas more.\n\nSCROOGE. I do love Christmas.\n\nHe shouts at the top of his voice.\n\nI do love Christmas.\n\nGHOST OF CHRISTMAS PRESENT. He loves Christmas.\n\nNARRATOR. And then he realised. As the clock chimed eleven in the morning. Christmas is a time for visiting. And he had visits to make.\n\nSCROOGE. I do. I have visits to make. I have people I want to see.\n\nGHOST OF CHRISTMAS PRESENT. Where must he go?\n\nNARRATOR. And he started where his heart started.\n \nScene Three\n\nAnd on the stage is built BELLE ’s door. And SCROOGE knocks upon it.\n\nShe answers. And is astonished to see him.\n\nSCROOGE. Belle…\n\nBELLE. Ebenezer?\n\nSCROOGE. I was afraid you might not recognise me.\n\nBELLE. I recognise you.\n\nSCROOGE. You see what age has done to me.\n\nBELLE. You think I remain the same?\n\nSCROOGE. I still see you.\n\nBELLE smiles .\n\nI am sorry to interrupt your Christmas Day.\n\nBELLE. It’s no – problem.\n\nSCROOGE. It’s just I was seized by – it’s just I considered – it’s just I was so happy it was Christmas Day.\n\nBELLE smiles.\n\nBELLE. I like this day too. I didn’t think you did though.\n\nHe looks at her, imploring himself to say the things he need say.\n\nSCROOGE. Belle… There are things I would set right.\n\nBELLE. And what might those be?\n\nSCROOGE. Choices I made.\n\nBELLE. You made your choices.\n\nSCROOGE. Paths I wish I could have seen more – clearly.\n\nBELLE. The paths were always clear.\n\nSCROOGE. Given a chance to start again, I would do differently, Belle.\n\nBELLE. Ah.\n \nSCROOGE. You dislike me for saying so?\n\nBELLE thinks, she smiles.\n\nBELLE. No.\n\nSCROOGE. You understand what I am saying?\n\nBELLE. Yes.\n\nBeat.\n\nBut I would not. Do things differently.\n\nSCROOGE. Would you not?\n\nBELLE. I waited for you, spurning others who approached, but when you did not return I eventually married a good man, I brought up good children. I would have married sooner and not have met him if I had not waited for you, and I am happy with what my life became. You’re part of my story, Ebenezer, and I am delighted with how my story turned out.\n\nSCROOGE thinks and then smiles.\n\nSCROOGE. Then I will be happy for you.\n\nBELLE nods .\n\nBELLE. And I am happy you are questioning the man you became. It is not the man you should be. It is not the man I loved.\n\nSCROOGE. But you think I can change him? This man?\n\nBELLE. Of course you can, change is within all of us. It’s why life is such a thrill.\n\nSCROOGE nods .\n\nWell, I must be getting on… my turkey is in a parlous state.\n\nShe makes to walk back inside, he calls after her.\n\nSCROOGE. Belle…\n\nBELLE. Yes?\n\nSCROOGE. I was part of your story.\n \nBELLE. You were. There was a time I wished you were a bigger part… But I was happy – I am perhaps the only one – happy with the part you played.\n\nSCROOGE. Yes.\n\nBELLE. I wish you different only for your own sake. I wish you happiness.\n\nSCROOGE nods .\n\nYou see me. The girl I was. Well, I still see you too, Ebenezer.\n\nBeat. SCROOGE smiles.",
      "summary": "Scrooge continues his conversation with Little Fan, who shows him visions of his potential future. They discuss the different paths Scrooge's life could have taken, emphasizing the importance of love and connection. Scrooge expresses regret for his past actions and a desire to change. The scene concludes with Scrooge embracing the possibility of a new life and making amends.",
      "prominence": 90,
      "key_characters": [
        {
          "name": "Ebenezer Scrooge",
          "description": "A man confronting his past and potential future, showing remorse and a desire to change.",
          "summary": "Scrooge experiences a profound emotional journey, expressing regret for his past actions and embracing the possibility of change. He shows vulnerability and a newfound appreciation for love and connection."
        },
        {
          "name": "Little Fan",
          "description": "Scrooge's deceased sister, appearing as a guide to his potential future.",
          "summary": "Little Fan acts as a compassionate yet firm guide, helping Scrooge confront his past choices and envision a better future. She encourages him to embrace love and connection in his life."
        },
        {
          "name": "Young Ebenezer",
          "description": "A representation of Scrooge's younger self.",
          "summary": "Young Ebenezer serves as a symbol of Scrooge's lost potential and the innocence of his youth, prompting Scrooge to reflect on the path his life has taken."
        }
      ],
      "chapter": "ACT THREE",
      "conversation": [
        {
          "scenario": "Scrooge and Little Fan discuss the potential paths his life could have taken, emphasizing the importance of love and connection.",
          "topic": "Scrooge's regret and desire for change",
          "key_characters": [
            {
              "name": "Ebenezer Scrooge",
              "thought": "[I'm overwhelmed with emotion and the realization of my past mistakes. I desperately want to change but fear it might be too late.]"
            },
            {
              "name": "Little Fan",
              "thought": "[I must guide Ebenezer towards understanding the value of love and connection, showing him it's not too late to change.]"
            }
          ],
          "dialogues": [
            {
              "character": "Little Fan",
              "message": "[I need to show Ebenezer the possibilities of a different life.] Look at him. Cradling his Parrot. So full of excitement."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I feel a mix of nostalgia and fear for my younger self.] And fear."
            },
            {
              "character": "Little Fan",
              "message": "[I'll encourage him to imagine a better future.] What would you have him be?"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm starting to see the potential I once had.] A scientist."
            },
            {
              "character": "Little Fan",
              "message": "[I'll continue to expand his vision.] A teacher."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm becoming more enthusiastic about these possibilities.] A watchmaker."
            },
            {
              "character": "Little Fan",
              "message": "[I'll keep encouraging his imagination.] A shopkeeper."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm fully embracing the exercise now.] A politician."
            },
            {
              "character": "Little Fan",
              "message": "[I'll introduce a more artistic option.] A singer."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm excited by all these possibilities.] A journalist."
            },
            {
              "character": "Little Fan",
              "message": "[I'll suggest something more adventurous.] An adventurer."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm delighted by this idea.] An adventurer to where?"
            },
            {
              "character": "Little Fan",
              "message": "[I'll emphasize the endless possibilities.] That is not for me to know. Maybe – somewhere that is yet to be found."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm suddenly overwhelmed with emotion.] Because I don't want him to be me."
            },
            {
              "character": "Little Fan",
              "message": "[I understand his pain and regret.] No."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm filled with remorse and a desire to change.] I want him to do good, not harm."
            },
            {
              "character": "Little Fan",
              "message": "[I'll gently encourage his newfound desire for change.] That does sound a better life."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm finally expressing my deepest desire.] And I want him to love."
            },
            {
              "character": "Little Fan",
              "message": "[I'm moved by his emotional breakthrough.] Of course you do."
            }
          ]
        }
      ],
      "state": "finished"
    },
    {
      "text": "SCROOGE lies in bed, tossing and turning.\n\nCHOIR.\n\nSee amid the winter’s snow,\n\nBorn for us on earth below,\n\nSee the tender Lamb appears,\n\nPromised from eternal years.\n\nHail, thou ever-blessed morn!\n\nHail, redemption’s happy dawn!\n\nSing through all Jerusalem,\n\nChrist is born in Bethlehem.\n\nSCROOGE wakes and the whole stage seems to shudder as he does.\n\nHe looks around himself.\n\nHe climbs out of bed.\n\nSay, ye holy shepherds, say\n\nWhat your joyful news today;\n\nWherefore have ye left your sheep,\n\nOn the lonely mountain steep?\n\nHail, thou ever-blessed morn!\n\nHail, redemption’s happy dawn!\n\nSing through all Jerusalem,\n\nChrist is born in Bethlehem.\n\nSacred infant, all divine,\n\nWhat a tender love was Thine,\n\nThus to come from highest bliss,\n\nDown to such a world as this.\n\nHail, thou ever-blessed morn!\n\nHail, redemption’s happy dawn!\n\nSing through all Jerusalem,\n\nChrist is born in Bethlehem.\n \nHe opens the door.\n\nThe CAROL SINGERS are outside it. He looks at them, astonished.\n\nSCROOGE. But – what are you doing here?\n\nThey look back, frightened at his wide eyes and discombobulation.\n\nWhere are my manners? Come inside, get warm, then tell me what day is today?\n\nHe ushers them inside.\n\nCAROL SINGER. Today, sir?\n\nSCROOGE. Yes. Tell me the day.\n\nCAROL SINGER. But it’s Christmas, sir.\n\nSCROOGE nods. But doesn’t take it in.\n\nWe are collecting for the –\n\nSCROOGE. It’s Christmas. Today?\n\nCAROL SINGER. Yes, sir. Will you give, sir…\n\nSCROOGE pulls a money box from the floor. He grabs a stack of notes from it.\n\nSCROOGE. You promise me now – it’s no trick? It’s Christmas.\n\nCAROL SINGER. Christmas Day, sir.\n\nSCROOGE whoops .\n\nSCROOGE. Then that is good news indeed, is it not?\n\nCAROL SINGER. Yes, sir. You like Christmas?\n\nSCROOGE stuffs notes in the CAROL SINGER ’s hands – and then thinks and then gives her the full money box. The CAROL SINGER is astonished.\n\nSCROOGE. I like it very well indeed.\n\nCAROL SINGER. But this is too much.\n\nSCROOGE. No. This is but a start. Merry Christmas. Merry Christmas, madam.\n\nThe CAROL SINGER departs.\n \nScene Two\n\nAnd SCROOGE erupts with Christmas spirit and around him come the three GHOSTS – the GHOST OF CHRISTMAS PAST, the GHOST OF CHRISTMAS PRESENT and LITTLE FAN.\n\nLITTLE FAN. He is happy.\n\nGHOST OF CHRISTMAS PRESENT. He is ecstatic.\n\nSCROOGE. I don’t know what to do! I am as light as a feather.\n\nGHOST OF CHRISTMAS PAST. He is light as a feather.\n\nSCROOGE. I am as happy as an angel.\n\nGHOST OF CHRISTMAS PAST. Happy as an angel.\n\nSCROOGE. I am as merry as a schoolboy.\n\nGHOST OF CHRISTMAS PAST. Merry as a schoolboy.\n\nGHOST OF CHRISTMAS PRESENT. He is giddy as a drunk.\n\nThe GHOSTS laugh.\n\nSCROOGE. A merry Christmas to everybody! A happy New Year to all the world.\n\nAnd SCROOGE runs out into London.\n\nAnd London snows. Snow falls everywhere.\n\nHe dances amongst the audience, introducing himself, full of glee.\n\nNARRATOR. And Scrooge ran out into Christmas Day morning and he was a very different Scrooge than the one who left his door the morning before.\n\nCHOIR.\n\nJoy to the World, the Lord is come!\n\nLet earth receive her King;\n\nSCROOGE. Hallo here! Whoop! Hallo!\n\nThe audience reacts in a myriad of ways as is their wont and SCROOGE responds to them in turn.\n \nSCROOGE. Merry Christmas indeed.\n\nCHOIR.\n\nLet every heart prepare Him room,\n\nAnd Heaven and nature sing,\n\nAnd Heaven and nature sing,\n\nAnd Heaven, and Heaven, and nature sing.\n\nNARRATOR. He went to church, and walked about the streets, and watched the people hurrying to and fro, and patted children on the head, and questioned beggars, and looked down into the kitchens of houses, and up to the windows, and found that everything could yield him pleasure. He had never dreamed that any walk, that anything could give him so much happiness.\n\nSCROOGE. It does give me happiness.\n\nLITTLE FAN. So much happiness.\n\nNARRATOR. And he stood in the street – and he watched Christmas happen around him and no man has ever loved Christmas more.\n\nSCROOGE. I do love Christmas.\n\nHe shouts at the top of his voice.\n\nI do love Christmas.\n\nGHOST OF CHRISTMAS PRESENT. He loves Christmas.\n\nNARRATOR. And then he realised. As the clock chimed eleven in the morning. Christmas is a time for visiting. And he had visits to make.\n\nSCROOGE. I do. I have visits to make. I have people I want to see.\n\nGHOST OF CHRISTMAS PRESENT. Where must he go?\n\nNARRATOR. And he started where his heart started.\n \nScene Three\n\nAnd on the stage is built BELLE ’s door. And SCROOGE knocks upon it.\n\nShe answers. And is astonished to see him.\n\nSCROOGE. Belle…\n\nBELLE. Ebenezer?\n\nSCROOGE. I was afraid you might not recognise me.\n\nBELLE. I recognise you.\n\nSCROOGE. You see what age has done to me.\n\nBELLE. You think I remain the same?\n\nSCROOGE. I still see you.\n\nBELLE smiles .\n\nI am sorry to interrupt your Christmas Day.\n\nBELLE. It’s no – problem.\n\nSCROOGE. It’s just I was seized by – it’s just I considered – it’s just I was so happy it was Christmas Day.\n\nBELLE smiles.\n\nBELLE. I like this day too. I didn’t think you did though.\n\nHe looks at her, imploring himself to say the things he need say.\n\nSCROOGE. Belle… There are things I would set right.\n\nBELLE. And what might those be?\n\nSCROOGE. Choices I made.\n\nBELLE. You made your choices.\n\nSCROOGE. Paths I wish I could have seen more – clearly.\n\nBELLE. The paths were always clear.\n\nSCROOGE. Given a chance to start again, I would do differently, Belle.\n\nBELLE. Ah.\n \nSCROOGE. You dislike me for saying so?\n\nBELLE thinks, she smiles.\n\nBELLE. No.\n\nSCROOGE. You understand what I am saying?\n\nBELLE. Yes.\n\nBeat.\n\nBut I would not. Do things differently.\n\nSCROOGE. Would you not?\n\nBELLE. I waited for you, spurning others who approached, but when you did not return I eventually married a good man, I brought up good children. I would have married sooner and not have met him if I had not waited for you, and I am happy with what my life became. You’re part of my story, Ebenezer, and I am delighted with how my story turned out.\n\nSCROOGE thinks and then smiles.\n\nSCROOGE. Then I will be happy for you.\n\nBELLE nods .\n\nBELLE. And I am happy you are questioning the man you became. It is not the man you should be. It is not the man I loved.\n\nSCROOGE. But you think I can change him? This man?\n\nBELLE. Of course you can, change is within all of us. It’s why life is such a thrill.\n\nSCROOGE nods .\n\nWell, I must be getting on… my turkey is in a parlous state.\n\nShe makes to walk back inside, he calls after her.\n\nSCROOGE. Belle…\n\nBELLE. Yes?\n\nSCROOGE. I was part of your story.\n \nBELLE. You were. There was a time I wished you were a bigger part… But I was happy – I am perhaps the only one – happy with the part you played.\n\nSCROOGE. Yes.\n\nBELLE. I wish you different only for your own sake. I wish you happiness.\n\nSCROOGE nods .\n\nYou see me. The girl I was. Well, I still see you too, Ebenezer.\n\nBeat. SCROOGE smiles.\n\nSCROOGE. Merry Christmas.\n\nBELLE smiles .\n\nBELLE. And to you, Ebenezer.\n\nShe walks away.\n\nAnd SCROOGE looks after her, upset.\n\nGHOST OF CHRISTMAS PAST. Will he survive that?\n\nLITTLE FAN. He’ll survive.\n\nGHOST OF CHRISTMAS PAST. In the past whenever he…\n\nLITTLE FAN. This is not the past.\n\nGHOST OF CHRISTMAS PRESENT. I hope he’s strong enough.\n\nSCROOGE thinks – and then he smiles.\n\nHe’s smiling.\n\nLITTLE FAN. He’s smiling.\n\nGHOST OF CHRISTMAS PAST. Ebenezer Scrooge smiles again.\n\nHe begins to walk.\n\nAnd London mills in and around him.\n\nGHOST OF CHRISTMAS PRESENT. Where does he go? What must he do?\n \nNARRATOR. And Scrooge ran. Down Friar Street and Union Street and Blackfriars. And over the bridge – panting as he did. And then he hiked up toward Farringdon – smiling at all those he passed. His energy seemed boundless, his feet inexhaustible and London seemed small to his stride. He doffed hat at the King’s Cross roads and with a merry pace danced up through Camden then jogged happily through Primrose Hill Park. He could smell hope before he could see it and sense it before he could indulge it but soon enough – there it was – the Mansfield Road of his nephew –\n\nSCROOGE stops breathlessly by a house.\n\nSCROOGE. FRED. FRED!\n\nScene Four\n\nFRED appears on high in the audience ( the entire auditorium should feel like the stage now ). SCROOGE is breathless.\n\nFRED. Uncle. Have you been running? Are you quite well?\n\nSCROOGE. You did make the offer.\n\nFRED. I did make the offer of what?\n\nSCROOGE. A place at your table.\n\nFRED. I’m sorry?\n\nSCROOGE. I wondered if you might have another place at your table. For Christmas.\n\nFRED looks at him – surprised.\n\nFRED. Uncle. Of course. You’re most welcome. Most welcome indeed.\n\nSCROOGE. In fact, I wondered if your table might be capable of being carried elsewhere. If I were to hire a carriage.\n\nFRED. Where would you wish us go?\n\nSCROOGE thinks how to put this.\n \nSCROOGE. You told me – ‘Christmas is the only time you know, when men and women seem by one consent to open their shut-up hearts freely, and to think of people below them as if they really were fellow-passengers to the grave.’\n\nFRED. You remembered all that? I always thought you thought my words quite inconsequential.\n\nSCROOGE. You are my sister’s son. I loved Fanny. I see her in you. I remember your every word because I love you.\n\nFRED. Love me?\n\nSCROOGE. Yes. Yes. Of course I do. And I hope you love me too.\n\nFRED. Yes, sir. Uncle Ebenezer, you have been the most important and –\n\nSCROOGE. No, no time for speeches, I’m sure what you had to say would have been – deeply moving – but let’s take it as heard, shall we? We’ve a lunch to get to after all.\n\nFRED. Whose lunch?\n\nSCROOGE. Whose indeed, sir. Whose indeed.\n\nFRED. Sir, are you quite yourself?\n\nSCROOGE. Not to any degree. Isn’t it marvellous?\n\nFRED thinks and then smiles.\n\nFRED. Yes, Uncle. Yes. It is.\n\nSCROOGE. So let’s move a feast. Now, will you pass down to me or will I climb up to you?\n\nFRED Well, I suppose I can pass down. But, sir, there’s rather a lot.\n\nSCROOGE. Then enlist Fred, enlist neighbours, enlist all you can, we’ve a Christmas to share.\n\nAnd now chaos ensues.\n\nFor everyone is enlisted.\n\nSheets descend from balconies. And sprouts descend down them. Followed by clementines, followed by everything else we can think of.\n \nBaskets of fruit are carried across and through the audience .\n\nJellies are wobbled, potatoes are roasted, gravy is slopped, chestnuts are destroyed, and throughout it all – so many sprouts. Too many sprouts, if I’m honest.\n\nA Christmas feast is moved with everyone in the audience getting involved. Or as much as wish to.\n\nAnd just as everything seems set – a turkey descends on a zipwire to the ground below.\n\nI wish I could describe more, but the lines here are entirely improvised.\n\nAnd all the better for it.\n\nScene Five\n\nThe feast arrives outside a house. SCROOGE bangs on the door excited. BOB comes out of it, carrying TINY TIM in his arms.\n\nBOB. Mr Scrooge?\n\nSCROOGE. Bob!\n\nBOB looks at SCROOGE astonished to see him here.\n\nBOB. Mr Scrooge, sir… my apologies, I was just… having my lunch, sir…\n\nSCROOGE. Are we intruding, Bob?\n\nBOB. Never, sir, what do you need, sir? Shall we return to the offices, sir?\n\nSCROOGE. It is Christmas Day, Bob.\n\nBOB. I know, sir, no time to shirk, sir.\n\nSCROOGE. And our turkey is too large to eat alone.\n\nBOB frowns, surprised by this.\n \nBOB. Sir?\n\nBOB looks at FRED.\n\nFRED. Don’t look at me – I don’t understand it either.\n\nSCROOGE. So we wondered if we might share it? With you? And your family?\n\nBOB looks from face to face, thoroughly confused.\n\nBOB. I’m not entirely sure what’s happening here.\n\nSCROOGE. You are being invaded, Bob. Will you allow us to invade?\n\nBOB. Sir?\n\nSCROOGE. I mean no harm.\n\nFRED. He may be ill, he may be happy, either way, he’s giddy. The easiest way of dealing with the situation will be to cede to his demands. May we come in?\n\nBOB. But – of course… if that’s what you want…\n\nFRED and BOB enter the house.\n\nTINY TIM and SCROOGE are left.\n\nTINY TIM. You’re invading.\n\nSCROOGE. I am invading.\n\nTINY TIM. We surrender!\n\nSCROOGE smiles and bends down.\n\nSCROOGE. Hello.\n\nTINY TIM. Hello, mighty invader.\n\nSCROOGE. My name is Ebenezer.\n\nTINY TIM. That’s a long name.\n\nSCROOGE. Some people know me as Scrooge.\n\nTINY TIM. I’m Tim.\n\nSCROOGE. Hello, Tim. Will you have Christmas lunch with me?\n\nTINY TIM. We’ve got lunch too.\n \nSCROOGE. So you have.\n\nTINY TIM. A fine goose.\n\nSCROOGE. I’m sure it is.\n\nTINY TIM. So we can share. Your turkey. Our goose. If you like.\n\nSCROOGE smiles .\n\nSCROOGE. That is an excellent idea. We shall share.\n\nTINY TIM. You look at me strangely.\n\nSCROOGE. You look strangely back.\n\nTINY TIM. I’m happy to have you in my home, Mr Scrooge.\n\nSCROOGE. I am happy to be here.\n\nTINY TIM. May I shake your hand – as a welcome?\n\nSCROOGE. You may.\n\nThey shake hands. It’s lovely. And then they break apart – SCROOGE with tears in his eyes.\n\nTINY TIM. You’re crying, mighty invader.\n\nSCROOGE. I fear so.\n\nTINY TIM. I have controlled your invasion through the power of my handshake.\n\nSCROOGE. You have.\n\nTINY TIM. I am strong, you see.\n\nSCROOGE. I can see. I can.\n\nTINY TIM smiles. He gives SCROOGE a clementine.\n\nTINY TIM. God bless us, every one.\n\nNARRATOR. And Scrooge became as good a friend, as good a master, and as good a man, as the good old city knew, or any other good old city, town, or borough, in the good old world; and to Tiny Tim, who did NOT die, he was a second father. Some people laughed to see the alteration in him, but he let them laugh, and little heeded them; for he was wise enough to know that nothing ever happened on this globe, for good, at which some people did not have their fill of laughter in the outset; and knowing that such as these would be blind anyway, he thought it quite as well that they should wrinkle up their eyes in grins, as have the malady in less attractive forms. His own heart laughed: and that was quite enough for him. And it was always said of him, that he knew how to keep Christmas well, if any man alive possessed the knowledge. May that be truly said of us, and all of us! And so, as Tiny Tim observed, God bless us, every one!\n\nAnd everything melts away apart from SCROOGE and the three GHOSTS.\n\nSCROOGE looks out and around himself and his expression sours.\n\nSCROOGE. What?\n\nHe searches under the table.\n\nAre they hiding?\n\nHe looks around himself.\n\nWas this – did you trick me?\n\nHe is quite heartbroken.\n\nWhere is Tiny Tim? Where is everyone? Or is it – have you…? Is my life is as it was?\n\nLITTLE FAN. Would that be so bad?\n\nSCROOGE. Where have they gone, Little Fan? You cannot treat me like this.\n\nLITTLE FAN. They’re still here.\n\nSCROOGE. Is it – was it – real?\n\nLITTLE FAN indicates the clementine.\n\nLITTLE FAN. Does it taste real?\n\nGHOST OF CHRISTMAS PRESENT. It is and was as real as you want it to be.\n\nSCROOGE. So it won’t – vanish – like the other stories?\n\nLITTLE FAN. Do you want it to vanish?\n \nGHOST OF CHRISTMAS PRESENT. You don’t like it? You made it.\n\nGHOST OF CHRISTMAS PAST. Or it made you.\n\nSCROOGE. I love it. But I know I don’t deserve it – do I?\n\nGHOST OF CHRISTMAS PRESENT. No.\n\nBeat. SCROOGE is surprised by the baldness of this statement.\n\nSCROOGE. A brutal truth I’m sure.\n\nGHOST OF CHRISTMAS PAST. But you might. Deserve it.\n\nGHOST OF CHRISTMAS PRESENT. Given time.\n\nGHOST OF CHRISTMAS PAST. And as you work – so you can expect – many things to work around you.\n\nLITTLE FAN. For the world is generally kind to those who change.\n\nGHOST OF CHRISTMAS PAST. History is still to be made.\n\nSCROOGE. There’s so much I need to change.\n\nMARLEY. Then set about changing it.\n\nMARLEY appears back amongst them, walking heavily in his chains.\n\nSCROOGE. Jacob.\n\nMARLEY. Ebenezer.\n\nSCROOGE. I will – I will change it.\n\nMARLEY. Then get started.\n\nSCROOGE looks at the GHOSTS.\n\nSCROOGE. Little Fan. I cannot thank you.\n\nLITTLE FAN. You don’t need to.\n\nSCROOGE. And you –\n\nHe looks at the GHOSTS OF CHRISTMAS PAST and PRESENT.\n\nI don’t even have a name for you.\n \nGHOST OF CHRISTMAS PAST. You don’t need one.\n\nGHOST OF CHRISTMAS PRESENT. I always wanted to be called Brenda.\n\nBeat.\n\nIt seems a kind name.\n\nSCROOGE. Thank you. Thank you.\n\nHe hugs the three GHOSTS in turn.\n\nThank you. Thank you. Brenda.\n\nAnd then he turns to MARLEY. And he doesn’t hug him.\n\nIs it so bad? So lonely?\n\nMARLEY. It is.\n\nSCROOGE. If I could ease your path…\n\nMARLEY. You can’t. You can only ease your own.\n\nThe two look at each other.\n\nSCROOGE. Thank you.\n\nMARLEY. Earn this.\n\nSCROOGE. I will.\n\nSCROOGE embraces him.\n\nI will.\n\nLITTLE FAN.\n\nGod rest you merry, gentlemen.\n\nLet nothing you dismay\n\nSCROOGE looks up, surprised to hear her sing.\n\nSCROOGE. That is still a song I have little time for.\n\nGHOST OF CHRISTMAS PRESENT.\n\nRemember, Christ, our Saviour\n\nWas born on Christmas Day\n\nSCROOGE. But you will sing it anyway no doubt.\n \nGHOST OF CHRISTMAS PAST.\n\nTo save us all from Satan’s power\n\nWhen we were gone astray\n\nTHREE GHOSTS.\n\nGlad tidings of comfort and joy\n\nComfort and joy\n\nGlad tidings of comfort and joy\n\nSCROOGE. Your voices don’t necessarily fit together, do they?\n\nMARLEY.\n\nIn Bethlehem, in Israel this blessed Babe was born\n\nSCROOGE is astonished.\n\nSCROOGE. Jacob? I didn’t know you could sing, Jacob.\n\nMARLEY.\n\nAnd laid within a manger upon this blessed morn\n\nThe which His Mother Mary did nothing take in scorn\n\nSCROOGE. You have a surprisingly fine voice.\n\nGHOSTS and MARLEY.\n\nOh, tidings of comfort and joy\n\nComfort and joy\n\nOh, tidings of comfort and joy\n\nAnd slowly the walls come alive.\n\nPeople from the past, present and future.\n\nAnd everyone is singing.\n\nYes, the full COMPANY emerges, and together with the CHOIR they rip the head off this hymn.\n\nFULL COMPANY.\n\nFrom God our Heavenly Father a blessed angel came\n\nAnd unto certain shepherds brought tidings of the same\n\nHow that in Bethlehem was born the Son of God by name\n\nOh, tidings of comfort and joy\n\nComfort and joy\n\nOh, tidings of comfort and joy\n\nAnd the dance becomes a circus.\n \nAnd this circus becomes happier and happier.\n\nAnd a dance begins and takes over the stage.\n\nIt is triumphant. And joyful. And comforting.\n\nWOMEN OF THE COMPANY.\n\nGod rest you merry, gentlemen.\n\nMEN OF THE COMPANY.\n\nLet nothing you dismay\n\nWOMEN OF THE COMPANY.\n\nRemember, Christ, our Saviour\n\nMEN OF THE COMPANY.\n\nWas born on Christmas Day\n\nFULL COMPANY.\n\nTo save us all from Satan’s power\n\nWhen we were gone astray\n\nOh, tidings of comfort\n\nOh, tidings of comfort\n\nOh, tidings of comfort and\n\nJOY!\n\nCurtain.",
      "summary": "Scrooge awakens on Christmas morning, transformed by his experiences with the ghosts. He joyfully embraces the holiday spirit, surprising carol singers with his generosity. He visits Belle to make amends, then joins his nephew Fred for Christmas dinner. Finally, he brings the feast to Bob Cratchit's home, beginning a new chapter in his life filled with kindness and generosity.",
      "prominence": 95,
      "key_characters": [
        {
          "name": "Ebenezer Scrooge",
          "description": "A man transformed by his ghostly experiences, now embracing the Christmas spirit.",
          "summary": "Scrooge undergoes a complete transformation, becoming joyful, generous, and eager to make amends. He actively seeks to spread happiness and reconnect with those he had previously pushed away."
        },
        {
          "name": "Belle",
          "description": "Scrooge's former love interest, now married with a family.",
          "summary": "Belle receives Scrooge's visit with grace and understanding. She acknowledges their past but expresses contentment with her life choices, encouraging Scrooge to find his own happiness."
        },
        {
          "name": "Fred",
          "description": "Scrooge's nephew, surprised by his uncle's change of heart.",
          "summary": "Fred welcomes Scrooge's transformation with joy and enthusiasm, readily accepting his uncle's desire to join the Christmas celebrations."
        },
        {
          "name": "Bob Cratchit",
          "description": "Scrooge's clerk, astonished by his employer's sudden change.",
          "summary": "Bob is initially confused by Scrooge's unexpected visit and generosity, but gradually accepts the positive change in his employer."
        },
        {
          "name": "Tiny Tim",
          "description": "Bob Cratchit's young, disabled son.",
          "summary": "Tiny Tim warmly welcomes Scrooge into their home, showing innocence and kindness that deeply affects Scrooge."
        }
      ],
      "chapter": "ACT FOUR",
      "conversation": [
        {
          "scenario": "Scrooge visits Belle on Christmas morning to make amends for his past actions.",
          "topic": "Reconciliation and acceptance of the past",
          "key_characters": [
            {
              "name": "Ebenezer Scrooge",
              "thought": "[I'm filled with regret and hope. I need to make things right with Belle, but I'm unsure how she'll receive me.]"
            },
            {
              "name": "Belle",
              "thought": "[I'm surprised to see Ebenezer after all these years. I wonder what has brought him here on Christmas Day.]"
            }
          ],
          "dialogues": [
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm nervous but determined to speak.] Belle..."
            },
            {
              "character": "Belle",
              "message": "[I'm taken aback by his appearance.] Ebenezer?"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I feel self-conscious about my appearance.] I was afraid you might not recognise me."
            },
            {
              "character": "Belle",
              "message": "[I'm slightly amused by his concern.] I recognise you."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm acutely aware of the passage of time.] You see what age has done to me."
            },
            {
              "character": "Belle",
              "message": "[I'll remind him that time affects us all.] You think I remain the same?"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I still see her beauty despite the years.] I still see you."
            },
            {
              "character": "Belle",
              "message": "[I'm touched by his words but remain cautious.] (smiles)"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I feel the need to explain my sudden appearance.] I am sorry to interrupt your Christmas Day."
            },
            {
              "character": "Belle",
              "message": "[I'm curious about his visit.] It's no – problem."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I struggle to explain my newfound joy.] It's just I was seized by – it's just I considered – it's just I was so happy it was Christmas Day."
            },
            {
              "character": "Belle",
              "message": "[I'm surprised by his enthusiasm for Christmas.] I like this day too. I didn't think you did though."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I gather my courage to express my regret.] Belle... There are things I would set right."
            },
            {
              "character": "Belle",
              "message": "[I'm curious about what he means.] And what might those be?"
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I feel the weight of my past decisions.] Choices I made."
            },
            {
              "character": "Belle",
              "message": "[I'll remind him of his agency in those choices.] You made your choices."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I wish I could change the past.] Given a chance to start again, I would do differently, Belle."
            },
            {
              "character": "Belle",
              "message": "[I consider his words carefully.] (thinks) No."
            },
            {
              "character": "Ebenezer Scrooge",
              "message": "[I'm confused by her response.] You dislike me for saying so?"
            },
            {
              "character": "Belle",
              "message": "[I'll explain my perspective.] I waited for you, spurning others who approached, but when you did not return I eventually married a good man, I brought up good children. I would have married sooner and not have met him if I had not waited for you, and I am happy with what my life became. You're part of my story, Ebenezer, and I am delighted with how my story turned out."
            }
          ]
        }
      ],
      "state": "finished"
    }
  ]
}